[{"title":"Friend of Boston Marathon bombing suspect threatened FBI agent, prosecutor says","url":"http://www.foxnews.com/us/2014/03/25/friend-boston-marathon-bombing-suspect-threatened-fbi-agent-prosecutor-says/","source":"FOX News","description":"A friend of one of the Boston marathon bombing suspects threatened ... State Attorney Jeff Ashton said in a report the agent was justified in shooting Ibragim Todashev, 27, last May. The officers were questioning Todashev about the 2011 slaying ...","date":"2014-03-25T14:46:26Z"},{"title":"FBI agent cleared in killing of friend of Boston bombing suspect","url":"http://www.latimes.com/nation/la-na-boston-marathon-todashev-20140326,0,2476666.story","source":"Los Angeles Times","description":"ORLANDO, Fla. — One of the lingering mysteries of the Boston Marathon bombing involves the grisly triple slaying that preceded it. On the night of Sept. 11, 2011, three men had their throats slashed in the quiet suburb of Waltham, Mass.","date":"2014-03-26T04:29:38Z"},{"title":"Congressional report on Boston bombing raises questions over Tsarnaev travel to Russia, possible links to militants","url":"http://www.foxnews.com/politics/2014/03/26/boston-marathon-bombings-report-raises-questions-about-tsarnaev-travel-to/","source":"FOX News","description":"A congressional report on the Boston Marathon bombing raises fresh questions about alleged bomber Tamerlan Tsarnaev's travels to Russia and whether he used the trip to meet up with militants. The report, released Wednesday by members of the ...","date":"2014-03-26T22:44:51Z"},{"title":"FBI shooting after Boston bombing was justified, investigator says","url":"http://www.cnn.com/2014/03/25/justice/florida-fbi-shooting-boston/index.html","source":"CNN","description":"(CNN)-- The shooting death of Ibragim Todashev, an associate of the alleged mastermind of the Boston Marathon bombing who was killed in a scuffle with FBI agents, was justified, Florida's Ninth Circuit State Attorney Jeffrey L. Ashton said in an ...","date":"2014-03-25T19:04:08Z"},{"title":"Michael Kennedy honored as hero of marathon bombing, Big Brother","url":"http://www.wsvn.com/story/25089043/michael-kennedy-honored-as-hero-of-marathon-bombing-big-brother","source":"WSVN-TV","description":"BOSTON (WHDH) - Many of the firefighters from the Boylston Street station were first responders to the Boston Marathon bombings and Michael Kennedy, who died battling the Back Bay fire on Wednesday, was one of them. Last month he was reunited with many of ...","date":"2014-03-27T10:04:54Z"},{"title":"Boston Marathon bombing report from House committee is sharply critical of agencies’ missed chances to scrutinize Tamerlan Tsarnaev","url":"http://www.boston.com/news/local/massachusetts/2014/03/26/congressional-report-marathon-bombings-critical-government-failures-focus-more-scrutiny-tamerlan-tsarnaev/X1mWZT1nQ2wxZOKQ6ZfobO/story.html","source":"Boston","description":"WASHINGTON—A sharply critical congressional report Wednesday said federal officials suffered multiple communication failures in the year before the Boston Marathon bombing and called on authorities to significantly tighten up scrutiny of ``hot ...","date":"2014-03-27T05:11:24Z"},{"title":"Boston Marathon bombing findings by House committee are boycotted by top Democrats","url":"http://www.boston.com/news/nation/2014/03/26/boston-marathon-bombing-findings-house-committee-are-boycotted-top-democrats/VWtdHR1iifg7lUst5YGEKJ/story.html","source":"Boston","description":"WASHINGTON — A bipartisan spirit of cooperation in Congress following last year’s Boston Marathon bombing dissolved into partisan rancor Wednesday, with all but one Democrat refusing to sign off on a House report documenting intelligence ...","date":"2014-03-27T02:26:46Z"},{"title":"Boston Marathon Bombing Victim, Heather Abbott, To Attend This Year's Race","url":"http://www.hngn.com/articles/27517/20140327/boston-bombing-victims-boston-marathon-bombing-victims-heather-abbott-boston-marathon-victim-boston-news-boston-marathon-news-boston-marathon-bombing-news.htm","source":"HNGN","description":"When the pressure-cooker bombs exploded in the crowds, she was hit by shrapnel and lost her lower left leg. Share This Story On Tuesday, she arrived at Olympic Physical Therapy in Newport, her hometown, to give an update on her progress and some ...","date":"2014-03-27T10:19:13Z"},{"title":"Russia warned U.S. about Boston Marathon bomb suspect Tsarnaev - report","url":"http://in.reuters.com/article/2014/03/26/usa-explosions-boston-congress-idINDEEA2P02X20140326","source":"Reuters Group PLC","description":"Citing a congressional report it said could be released by the House of Representatives Homeland Security Committee as soon as Thursday, NBC News said the Russian intelligence agency FSB cabled the FBI about its concerns in March 2011, warning ...","date":"2014-03-26T03:32:22Z"},{"title":"Boston Marathon bombings victim to return to 2014 race","url":"http://www.necn.com/03/26/14/Boston-Marathon-bombings-victim-to-retur/landing.html?blockID=864290","source":"NECN","description":"MIDDLETOWN, R.I. (AP) - A Rhode Island woman is planning to return to the Boston Marathon, a year after losing her lower left leg in the bombing at the race. Heather Abbott talked about her plans Tuesday during a visit to Olympic Physical Therapy in ...","date":"2014-03-26T09:08:49Z"},{"title":"Marathon bombing report critical of intelligence agencies","url":"http://www.bostonglobe.com/2014/03/26/congressional-report-marathon-bombings-critical-government-failures-focus-more-scrutiny-tamerlan-tsarnaev/hCstgRy3myIu4jKJZ3SbEO/story.html","source":"The Boston Globe","description":"WASHINGTON — A sharply critical congressional report on Wednesday said federal officials suffered multiple communication failures in the year before the Boston Marathon bombing and called on authorities to significantly tighten up scrutiny of ...","date":"2014-03-25T23:57:37Z"},{"title":"Ashland Scouts to decorate canvas honoring Marathon bombing victims","url":"http://www.metrowestdailynews.com/article/20140328/News/140326302","source":"MetroWest Daily News","description":"Friday’s event at the Mindess School is organized by the town’s Daisy and Brownie Girl Scout troops. Some of the girls have ... said Cronan. She had wanted kids to decorate the canvas during art class. Soderlund says America 4 Boston is ...","date":"2014-03-28T03:51:29Z"},{"title":"Boston Marathon Bombing Double Amputee Expecting Child","url":"http://newsok.com/boston-marathon-bombing-double-amputee-expecting-child/article/3946853","source":"Oklahoma News","description":"Photo via Mashable.com Mashable reports Bauman, 28, and Erin Hurley, 27, told the Associated Press the baby is due July 18. The couple, who got engaged in February, have opted not to learn the baby's gender. Bauman was standing at the marathon's ...","date":"2014-03-26T11:39:08Z"},{"title":"Russia Warned US About Boston Marathon bombing suspect Tamerlan Tsarnaev Years Before Attack","url":"http://aol.com/article/2014/03/26/russia-warned-u-s-about-boston-bomber-years-before-attack/20857080/","source":"AOL","description":"WASHINGTON, March 25 (Reuters) - Russian authorities warned the FBI in 2011 about Tamerlan Tsarnaev, one of two Chechen brothers accused of carrying out last year's Boston Marathon bombings, but U.S. authorities missed chances to detain him, NBC ...","date":"2014-03-26T09:51:46Z"},{"title":"US House panel releases Boston Marathon bombings report","url":"http://www.necn.com/03/26/14/US-House-panel-releases-Boston-Marathon-/landing.html?blockID=864322","source":"NECN","description":"(NECN) - Members of the U.S. House Homeland Security Committee, including Massachusetts' Congressman Bill Keating, released a bi-partisan report on the Boston Marathon bombings Wednesday. The report details the history of the Tsarnaev family, a timeline of ...","date":"2014-03-26T21:18:57Z"},{"title":"Reports detail killing of bombing suspect's friend","url":"http://www.ajc.com/ap/ap/top-news/fla-prosecutor-releases-report-on-fbi-shooting/nfKrs/","source":"Atlanta Journal Constitution","description":"\"Abdul-Baki Todashev told The Associated Press in Russia. \"Who could believe this?\" Tsarnaev and his brother, Dzhokhar, have roots in the turbulent Russian regions of Dagestan and Chechnya, which have become recruiting grounds for Islamic extremists.","date":"2014-03-24T23:58:49Z"},{"title":"Nurses bond with bombing victims inspires 6 to run","url":"http://bostonherald.com/news_opinion/local_coverage/2014/03/nurses_bond_with_bombing_victims_inspires_6_to_run","source":"Boston Herald","description":"Six ICU nurses at Massachusetts General Hospital who cared for some of the most severely injured after last year’s Boston Marathon bombings are completing their own healing process as they prepare to run the 26.2-mile race in honor of their courageous ...","date":"2014-03-25T23:57:37Z"},{"title":"FBI Agents Cleared in Shooting Tied to Boston Marathon Probe","url":"http://online.wsj.com/news/articles/SB10001424052702304679404579461321388046830","source":"The Wall Street Journal","description":"A Florida man shot dead by a Federal Bureau of Investigation agent during the probe of last year's Boston Marathon bombing had written nearly a full page of a confession of his involvement in a triple murder when he suddenly attacked the agent ...","date":"2014-03-25T12:16:07Z"},{"title":"Boston Marathon bombing suspect remains hospitalized in 'serious condition,' unable to be questioned about motives","url":"http://www.nydailynews.com/news/national/boston-marathon-bombing-suspect-dzhokhar-tsarnaev-serious-condition-hospital-article-1.1322801","source":"New York Daily News","description":"The only who knows the motive in the Boston Marathon bombing still wasn’t speaking Saturday as federal authorities re-arrested two of his associates. Accused teen terrorist Dzhokhar Tsarnaev remained hospitalized and silent Saturday with a ...","date":"2013-04-20T16:34:59Z"},{"title":"Victims killed in Boston Marathon bombings identified","url":"http://www.cbsnews.com/news/victims-killed-in-boston-marathon-bombings-identified/","source":"CBS News","description":"Krystle Campbell of Arlington, Mass., was among the three people killed in the Boston Marathon bombings, CBS News confirmed Tuesday afternoon. Campbell, 29, was a restaurant manager who was at the race with her best friend, her father William Campbell told ...","date":"2013-04-17T08:17:28Z"},{"title":"Boston Marathon bombing: US seeks death penalty for Dzhokhar Tsarnaev (+video)","url":"http://www.csmonitor.com/USA/Justice/2014/0130/Boston-Marathon-bombing-US-seeks-death-penalty-for-Dzhokhar-Tsarnaev-video","source":"The Christian Science Monitor","description":"US Attorney General Eric Holder Thursday authorized federal prosecutors to seek the death penalty in the trial of Dzhokhar Tsarnaev, who is accused of killing three and wounding hundreds in a bombing near the finish line of the Boston Marathon ...","date":"2014-01-31T01:51:46Z"},{"title":"CHARLOTTE: Charlotte woman hurt in marathon bombing going back","url":"http://www.wate.com/story/25064722/charlotte-woman-hurt-in-marathon-bombing-going-back","source":"WATE","description":"A Charlotte woman who was injured in the bombing at the Boston Marathon last year is heading back for this year's event. The Charlotte Observer reported that Nicole Gross was near the finish line last year waiting for her mother to finish the race when the ...","date":"2014-03-25T01:17:33Z"},{"title":"SALINE: Local resident runs for charity in Boston Marathon","url":"http://heritage.com/articles/2014/03/27/saline_reporter/news/doc53336401e0490907860990.txt","source":"Heritage","description":"Jeff Miller, a resident of Saline and a reserve officer for the Washtenaw Sheriff’s Office, will raise fund to help kids with cancer during the upcoming Boston Marathon. Jeff Miller of Saline, a reserve deputy for the Washtenaw County Sheriff ...","date":"2014-03-27T09:29:06Z"},{"title":"TERROR BOMBING at Boston Marathon — 3 Dead, 130-Plus Wounded","url":"http://www.heavy.com/news/2013/04/boston-marathon-bomb-explosion/","source":"heavy.com","description":"UPDATE ... the bombing. Photo: Unclaimed bags at finish line of Boston Marathon following explosion (Mary Pilon/NY Times) - twitter.com/TheMatthewKeys… — Matthew Keys (@TheMatthewKeys) April 16, 2013 UPDATE 8:13 p.m. — CNN reports at least 10 ...","date":"2013-04-15T20:58:37Z"},{"title":"3 killed, more than 140 hurt in Boston Marathon bombing","url":"http://news.blogs.cnn.com/2013/04/15/explosions-near-finish-of-boston-marathon/","source":"CNN (blog)","description":"Three killed – including 8-year-old boy – in bomb blasts near finish line of Boston Marathon, officials say. Area hospitals say at least 144 are injured, including eight children. Two explosions happened at about 2:50 p.m., more than two ...","date":"2013-04-16T01:37:47Z"},{"title":"Investigators claim major progress in Boston bombings","url":"http://www.usatoday.com/story/news/nation/2013/04/17/boston-marathon-pressure-cooker-bomb/2089963/","source":"USA Today","description":"Investigators are exploring a number of promising leads in the Boston Marathon bombing case, including an image of a man believed possibly involved in one of Monday's twin explosions that killed three people and injured 176. A federal law ...","date":"2013-04-18T02:11:12Z"},{"title":"Boston Marathon 2013 bombing: Two dead, 100 hurt in twin blasts","url":"http://news.nationalpost.com/2013/04/15/two-explosions-at-boston-marathon-finish-line-injure-dozens-reports/","source":"National Post","description":"The fiery twin blasts took place about 10 seconds ... hit 'Bomb makers all have unique signatures': Explosive devices may lead investigators to culprits ‘There was blood everywhere': Canadians recount the horror of witnessing the Boston Marathon blasts ...","date":"2013-04-14T23:58:45Z"},{"title":"FBI agent cleared in shooting tied to Boston bombings probe","url":"http://sg.news.yahoo.com/florida-prosecutor-findings-marathon-related-shooting-124335173--spt.html","source":"Yahoo News Singapore","description":"After a long interview with law enforcement officers, Ashton said Todashev was writing a statement about his involvement in the triple murder when he suddenly threw a coffee table, striking the agent in the head ... seconds he pulled the trigger,\" said ...","date":"2014-03-25T12:37:35Z"},{"title":"‘Boston Strong’ T-shirts raise nearly $1M","url":"http://bostonherald.com/business/business_markets/2014/03/boston_strong_t_shirts_raise_nearly_1m","source":"Boston Herald","description":"... Strong” are approaching $1 million in donations to The One Fund Boston. Senior Nick Reynolds and sophomore Chris Dobens have sold 65,111 blue and gold “Boston Strong” shirts, with $983,243 in net proceeds going to the nonprofit that aids victims ...","date":"2014-03-27T19:30:24Z"},{"title":"Canton Runners Spotlight: Boston Marathon Edition","url":"http://www.thecantoncitizen.com/2014/03/27/marathon-runners/","source":"Canton Citizen","description":"To make a donation to MR8, go to www.firstgiving.com/fundraiser/JoLysko/team-mr8-boston-marathon-2014. Are you a Canton resident running in the upcoming Boston Marathon? If so and you would like to be highlighted in the Canton Citizen ...","date":"2014-03-28T01:42:38Z"},{"title":"Boston Marathon bombing investigated as world shows support (LIVE BLOG)","url":"http://www.globalpost.com/dispatch/news/regions/americas/united-states/130415/boston-marathon-explosion-reported","source":"GlobalPost","description":"As the second day after the bombings at the Boston Marathon draws to a close, the death toll still stands at 3, with more than 180 people having received treatment at area hospitals for injuries. At least 17 people remain in critical condition. The ...","date":"2013-04-17T18:47:24Z"},{"title":"Bombs at Boston Marathon fashioned out of pressure cookers","url":"http://sportsillustrated.cnn.com/more/news/20130416/boston-marathon-bombings-fbi-investigation.ap/","source":"CNN Sports Illustrated","description":"BOSTON (AP) Federal agents zeroed in Tuesday on how the Boston Marathon bombing was carried out - with kitchen pressure cookers packed with explosives, nails and other lethal shrapnel - but said they still didn't know who did it and why.","date":"2013-04-16T16:11:06Z"},{"title":"Latest News On Boston Marathon Bombings","url":"http://hereandnow.wbur.org/2013/04/16/boston-marathon-bombing","source":"hereandnow.wbur.org","description":"Note: Our whole show today is dedicated to the bombings at the Boston Marathon. We’ll have a series of live guests, starting at 12 p.m. Eastern time, to get the latest updates on the investigation and the victims. The attack hit extremely close to home ...","date":"2013-04-14T23:58:45Z"},{"title":"Marathon bombing suspect dead, another on run","url":"http://sportsillustrated.cnn.com/more/news/20130419/boston-marathon-bombing-suspects.ap/","source":"CNN Sports Illustrated","description":"WATERTOWN, Mass. (AP) -- All residents of Boston were ordered to stay in their homes Friday morning as the search for the surviving suspect in the marathon bombings continued after a long night of violence that left another suspect dead.","date":"2013-04-20T04:39:10Z"},{"title":"Death penalty sought for bombings","url":"http://espn.go.com/boston/story/_/id/10377199/federal-prosecutors-seek-death-penalty-boston-marathon-bombing","source":"ESPN","description":"... Thursday announced they will seek the death penalty against 20-year-old Dzhokhar Tsarnaev in the Boston Marathon bombing, accusing him of betraying his adopted country by ruthlessly carrying out a terrorist attack calculated to cause maximum ...","date":"2014-01-30T22:24:11Z"},{"title":"Boston Marathon bombing: Celebs react","url":"http://www.sheknows.com/entertainment/articles/991293/boston-marathon-bombing-celebs-react","source":"SheKnows","description":"Ellen DeGeneres: \"Let's all send our thoughts, our prayers and our energy to the people injured in Boston. My heart is with you.\" Chloë Grace Moretz: \"Horrific things happening in the world today. God bless those who have died and are injured.\" Patton ...","date":"2013-04-16T08:04:20Z"},{"title":"Developments in the Boston Marathon bombings probe","url":"http://www.newsday.com/news/nation/developments-in-the-boston-marathon-bombings-probe-1.5109774","source":"Newsday","description":"WILMINGTON, Mass. — A vigil has been held in Massachusetts for an MIT police officer authorities say was shot and killed by the alleged Boston Marathon bombers. Hundreds turned out Saturday night in Wilmington to honor 26-year-old Sean Collier ...","date":"2013-04-20T17:25:06Z"},{"title":"Russia Warned U.S. on Tsarnaev","url":"http://www.thedailybeast.com/cheats/2014/03/26/russian-warned-u-s-on-tsarnaev.html","source":"Daily Beast","description":"A soon-to-be-released congressional report says the Russian government had warned the U.S. that Tamerlan Tsarnaev was a radical Islamist a year and a half before the Boston Marathon bombing. However, Tsarnaev slipped through authorities’ hands ...","date":"2014-03-25T23:57:37Z"},{"title":"Report on FBI’s Shooting of Ibragim Todashev Draws Critics, More Questions","url":"http://www.ticklethewire.com/2014/03/27/report-on-fbis-shooting-of-ibragim-todashev-draws-critics-more-questions/","source":"Tickle The Wire","description":"The Christian Science Monitor reports that state prosecutor ... an American Civil Liberties Union spokesman, told NPR after the report was released Tuesday.","date":"2014-03-27T12:20:54Z"},{"title":"Boston Marathon Bombing Suspect: ID'd By 4Chan Think Tank?","url":"http://www.thehollywoodgossip.com/2013/04/boston-marathon-bombing-suspect-idd-by-4chan-think-tank/","source":"The Hollywood Gossip","description":"The FBI, Boston Police and Massachusetts State Police are working at a frenzied pace to track down who is responsible for Monday's Boston Marathon bombings. The Internet is also doing its investigative thing. Specifically, a 4Chan Think Tank purports to ...","date":"2013-04-17T18:04:27Z"},{"title":"BREAKING: Boston Marathon bombing is “terrorist attack,” federal officials say","url":"http://americablog.com/2013/04/breaking-multiple-explosions-boston-marathon.html","source":"americablog.com","description":"Photos from the scene – one is graphic, and fortunately is protected behind a wall, it’s seriously graphic, not sure I’m glad I clicked. Boston Police Commissioner: If anyone saw anything, call 1-800-494-TIPS. — John Dickerson (@jdickerson) April ...","date":"2013-04-15T19:47:02Z"},{"title":"Your Guide To The Boston Marathon Bombing Amateur Internet Crowd-Sleuthing","url":"http://gawker.com/5994892/your-guide-to-the-boston-marathon-bombing-amateur-internet-crowd-sleuthing","source":"Gawker","description":"In the wake of the Boston Marathon bombing, people on the internet have taken to groundlessly speculating on the identity of the attacker or attackers based on photos and videos from the scene, a process known as \"procrastinating at work,\" or \"crowdsourcing.","date":"2013-04-17T17:28:39Z"},{"title":"The Boston Marathon Bombings","url":"http://onpoint.wbur.org/2013/04/16/the-boston-marathon-bombing","source":"onpoint.wbur.org","description":"The annual Boston Marathon is a day for joy. Yesterday began that way. 23,000 runners from around the world. Maybe half a million spectators, families, lining the 26-mile course in the spring sunshine, celebrating, cheering strangers on. And then, just ...","date":"2013-04-16T12:14:52Z"},{"title":"'Family Guy' Boston Marathon bombing clip is an Internet hoax","url":"http://insidetv.ew.com/2013/04/16/family-guy-boston-marathon-bombing-clip-internet-hoax/","source":"Entertainment Weekly Online","description":"A clip purporting to be from a March 17 episode of Fox’s animated comedy Family Guy was edited to suggest the show depicted the bombing of the Boston Marathon, representatives for the show have confirmed to EW. “The edited Family Guy clip ...","date":"2013-04-15T23:57:34Z"},{"title":"Boston Marathon Bombing: Congress reacts, Dems talk sequester","url":"http://www.politico.com/story/2013/04/boston-marathon-bombing-congress-reacts-90136.html","source":"POLITICO","description":"With the Boston Marathon bombings less than 24 hours old, some on Capitol Hill are beginning to say the attack shows why Congress should’ve stopped automatic spending cuts from taking hold in March. House Minority Whip Steny Hoyer (D-Md.), responding to ...","date":"2013-04-17T09:29:03Z"},{"title":"Boston Marathon bombings: Timeline of events","url":"http://www.wjla.com/articles/2013/04/boston-marathon-bombings-timeline-of-events-87715.html","source":"ABC 27","description":"BOSTON (AP) - Key moments related to the search for the Boston Marathon bombing suspects, based on reports from the Middlesex County district attorney, Massachusetts State Police and Boston police. April 18, 5:10 p.m. Investigators of the bombings release ...","date":"2013-04-19T18:09:14Z"},{"title":"What We Know About The Boston Marathon Explosions","url":"http://www.motherjones.com/politics/2013/04/boston-marathon-explosions","source":"Mother Jones","description":"Today is a holiday in Massachusetts ... Here are two photos of Martin Richard, the 8-year-old boy who was killed in Monday's attack. A vigil was held for the family on Tuesday night in Dorchester, Mass. UPDATE 26, Wednesday, April 17, 1:54 p.m. EDT ...","date":"2013-04-15T12:44:42Z"},{"title":"Pictures from the Boston Marathon Bombing","url":"http://www.newyorker.com/online/blogs/newsdesk/2013/04/slide-show-the-boston-marathon-bombing.html","source":"The New Yorker","description":"“This was a heinous and cowardly act, and given what we now know about what took place, the F.B.I. is investigating it as an act of terrorism,” President Obama said the morning after the Boston Marathon explosions. He also spoke of what the horror of ...","date":"2013-04-16T15:35:18Z"},{"title":"Boston Marathon bombing suspect Dzhokhar Tsarnaev arrested","url":"http://rt.com/usa/dzhokhar-tsarnaev-boston-apprehended-126/","source":"RT","description":"Boston Marathon bombing suspect Dzhokhar Tsarnaev has been arrested following an extensive manhunt that ended in the Boston suburb of Watertown. Law enforcement units from around the country were involved in the search. The crowd around the standoff scene ...","date":"2013-04-21T07:36:56Z"},{"title":"Boston Marathon bombings Rumor Control: Man on the roof, 'false flag,' American Airlines, Family Guy, JFK Library, more (Updated)","url":"http://www.scpr.org/blogs/news/2013/04/16/13322/boston-marathon-bombings-rumor-control-man-on-the/","source":"89.3 KPCC","description":"Medical responders run an injured man past the finish line the 2013 Boston Marathon following an explosion in Boston, Monday, April 15, 2013. Conspiracy theorists spread rumors that the man was an \"actor.\" In reality, the father of the man in the ...","date":"2013-04-16T23:56:23Z"},{"title":"The Latest on the Boston Marathon Bombing: What We Know So Far","url":"http://www.alternet.org/news-amp-politics/latest-boston-marathon-bombing-what-we-know-so-far","source":"AlterNet","description":"Update: Sen. Dianne Feinstein told reporters that the Saudi National whose home was searched in relation to the Boston bombings is not a suspect. \"As far as I know, he is not a suspect. That's as far as I know,\" she said. \"See this is the problem -- we ...","date":"2013-04-15T23:57:34Z"},{"title":"Boston Marathon Bombing Trial Date Set","url":"http://www.buzzfeed.com/mikehayes/boston-marathon-bombing-trial-date-set","source":"buzzfeed.com","description":"The trial for accused Boston Marathon bomber Dzhokhar Tsarnaev is scheduled to begin Nov. 3. posted on February 12, 2014 at 10:59am EST A trial date has been set for the alleged Boston Marathon bomber. A Massachusetts judge in U.S. District Court set Nov ...","date":"2014-02-11T23:57:20Z"},{"title":"Boston Marathon bombings: Suspect captured, alive (Photos, video)","url":"http://www.scpr.org/news/2013/04/19/36885/boston-marathon-bombings-police-say-shootout-kills/","source":"89.3 KPCC","description":"Onlookers applaud first responders departing after their successful operation to capture 19-year-old bombing suspect Dzhokhar A. Tsarnaev on April 19, 2013 in Watertown, Massachusetts. A ambulance leaves the scene following the capture of the second of two ...","date":"2013-04-19T22:55:34Z"},{"title":"FBI agent cleared in fatal shooting of Ibragim Todashev","url":"http://www.clickorlando.com/news/fbi-cleared-in-fatal-shooting-of-ibragim-todashev/25152538","source":"click orlando","description":"HE THREW A COFFEE TABLE AT AN AGENT AND CHARGED AT ANOTHER LAW ... The state attorney's office said the special agent was justified in self-defense for himself and another agent after a review of the investigation. \"My finding was, under Florida ...","date":"2014-03-25T22:10:15Z"},{"title":"Boston Marathon Bomb Tragedy","url":"http://gonewengland.about.com/b/2013/04/17/boston-marathon-bomb-tragedy.htm","source":"gonewengland.about.com","description":"The Boston Marathon, a tradition since 1897 that takes place on the iconic Patriots Day holiday, was disrupted at 2:50 p.m. EDT Monday by two bomb explosions that left three dead and more than 170 injured. A third, apparently unrelated explosion ...","date":"2013-04-16T04:58:13Z"},{"title":"Boston Marathon Bomb Suspect’s Trial Date Set for Nov. 3","url":"http://www.bloomberg.com/news/2014-02-12/boston-marathon-bomb-suspect-s-trial-date-set-for-nov-3.html","source":"Bloomberg","description":"Dzhokhar Tsarnaev, the accused terrorist who faces a possible death sentence if he’s convicted of bombing last year’s Boston Marathon, will go to trial Nov. 3, almost a year earlier than his lawyers requested. U.S. District Judge George A.","date":"2014-02-12T14:30:38Z"},{"title":"Images from the Boston Marathon bombing and aftermath","url":"http://blogs.sacbee.com/photos/2013/04/images-from-the-boston-maratho.html","source":"Sacramento Bee","description":"BOSTON (AP) - By Wednesday, two days after the bombing, investigators in white jumpsuits had fanned out across the streets, rooftops and awnings around the blast site in search of clues. They combed through debris amid the toppled orange sports drink ...","date":"2013-04-16T23:56:23Z"},{"title":"Boston Marathon bombing: U.S. prosecutors to seek death penalty","url":"http://www.thestar.com/news/world/2014/01/30/boston_marathon_bombing_us_prosecutors_to_seek_death_penalty.html","source":"Toronto Star","description":"BOSTON—U.S. prosecutors on Thursday announced they will seek the death penalty against 20-year-old Dzhokhar Tsarnaev in the Boston Marathon bombing, instantly raising the stakes in what could be one of the most wrenching trials the city has ever seen.","date":"2014-01-31T00:11:34Z"},{"title":"Boston Marathon Bombing: Photos From The Scene","url":"http://www.huffingtonpost.ca/2013/04/15/boston-marathon-explosions-photos_n_3087352.html","source":"The Huffington Post","description":"At least two bombs went off at the Boston Marathon on Monday. Immediately after the explosions, photos began to spread on social media of the blasts themselves and of the horrific aftermath. You can see the best photos so far in the gallery below.","date":"2013-04-16T13:26:27Z"},{"title":"Boston Marathon Bombings: United in running","url":"http://www.sheknows.com/health-and-wellness/articles/993135/boston-marathon-bombings-united-in-running","source":"SheKnows","description":"What Megan Searfoss remembered most was how perfect the morning was. The weather, the crowd, the training. She was ready. But the avid runner and founder of the women’s only 5K Run Like a Mother had no idea that the finish line she crossed minutes before ...","date":"2013-05-07T04:26:09Z"},{"title":"Authorities Identify Potential Suspect In Boston Marathon Bombings","url":"http://newyork.cbslocal.com/2013/04/17/authorities-appeals-for-help-solving-boston-marathon-bombings/","source":"Cbslocal","description":"BOSTON (CBSNewYork/AP) – Authorities pinpointed a possible suspect Wednesday in the Boston Marathon bombings, and they said surveillance video could provide a critical clue in catching the attacker. As CBS 2’s Jessica Schneider reported, authorities ...","date":"2013-04-17T21:24:53Z"},{"title":"Why the Boston Marathon bombing could increase Sochi Olympic security","url":"http://sports.nationalpost.com/2013/04/19/boston-marathon-bombing-suspects-reignite-fears-about-sochi-olympics/","source":"Nationalpost.com","description":"MOSCOW — The naming of two Chechen brothers as the suspects in the deadly Boston Marathon bombing is adding to security fears at the 2014 Winter Games in Sochi, the resort town on the edge of Russia’s restive southern republics. But officials insist ...","date":"2013-04-19T19:20:49Z"},{"title":"President Obama Tells Boston to Keep Running After Marathon Bombings","url":"http://swampland.time.com/2013/04/18/president-obama-tells-boston-to-keep-running-after-marathon-bombings/","source":"Time","description":"Barack Obama did not come to Boston Thursday to remember, to mourn or to commemorate. He came to rally the city in an upbeat and uplifting speech about the inability of the marathon bombings to disrupt or destroy the spirit of the country.","date":"2013-04-17T23:55:12Z"},{"title":"In Boston, Mixed Reaction to Death Penalty Decision in Marathon Bombings Case","url":"http://thelede.blogs.nytimes.com/2014/01/30/in-boston-mixed-reaction-to-death-penalty-decision-in-marathon-bombings-case/","source":"New York Times Blogs","description":"Walsh, the mayor of Boston, voted against the death penalty. On Thursday, he said that he would vote the same way today. But Mr. Walsh also said ... seek the death penalty was mixed. The Boston Globe pointed to a poll’s findings last September.","date":"2014-01-31T02:27:34Z"},{"title":"Boston Marathon bombings: Updates","url":"http://livenews.thestar.com/Event/Boston_Marathon_bombings_Updates?Page=0","source":"livenews.thestar.com","description":"The patients are all Americans, surgeon Velmahos says. \"There was a lot of blood\" and the profuse bleeding caused a lot of problems in treatment, he says. All of the patients are idenfied and range in age from their 20s to their 70s.","date":"2013-04-15T23:57:34Z"},{"title":"Houstonians respond to Boston Marathon bombing","url":"http://newsfixnow.com/2013/04/16/houstonians-respond-to-boston-marathon-bombing/","source":"newsfixnow.com","description":"HOUSTON, TX – As folks around the world scoured the net for updates on the Boston bombing, here in Houston many had a more personal connection. “I know people in Boston who were in that area and they said they heard the explosions,” Rice University ...","date":"2013-04-16T10:34:40Z"},{"title":"Boston Doctors Compare Marathon Bomb Injuries To War Wounds","url":"http://www.npr.org/blogs/health/2013/04/16/177427307/Boston-Doctors-Compare-Marathon-Bomb-Injuries-To-War-Wounds","source":"NPR News","description":"Boston hospitals always staff up their emergency rooms on Marathon Day to care for runners with cramps, dehydration and the occasional heart attack. But Monday, those hospitals suddenly found themselves with more than 100 traumatized patients ...","date":"2013-04-16T09:23:05Z"},{"title":"Boston Marathon bombings: How tech is helping","url":"http://venturebeat.com/2013/04/15/boston-marathon-bombings-how-tech-is-helping/","source":"Venturebeat.com","description":"Connect with leaders from the companies in this story, in real life: Come to the fourth annual VentureBeat Mobile Summit April 14-15 in Sausalito, Calif. Request an invitation. As everyone connected to the Internet knows by now, Boston has been the scene ...","date":"2013-04-15T22:03:02Z"},{"title":"Boston Marathon Bombing Suspect Captured Alive - Celebrities React","url":"http://www.justjared.com/2013/04/19/boston-marathon-bombing-suspect-captured-alive-celebrities-react/","source":"Just Jared","description":"After a day-long manhunt, the second suspect in the Boston Marathon bombings has been captured alive. Dzhokhar A. Tsarnaev, 19, was found hiding inside a covered boat that sat in a backyard in Watertown, Mass. He is currently being transported to the ...","date":"2013-04-20T00:42:56Z"},{"title":"Boston Marathon bombing: FBI releases photos of 2 ‘suspects’","url":"http://www.politico.com/story/2013/04/boston-marathon-explosions-suspect-video-90214.html","source":"POLITICO","description":"Authorities on Thursday released images of two suspects in the Boston Marathon bombings and called for the public’s assistance in identifying them. At a press conference, FBI Special Agent Richard DesLauriers unveiled photographs and video of the two ...","date":"2013-04-19T07:39:18Z"},{"title":"FBI: No Suspect Has Been Arrested In Boston Marathon Bombing","url":"http://newsone.com/2391931/boston-marathon-explosion-suspect/","source":"News One","description":"UPDATE 4/17/13, 4:58 p.m.: The Boston Marathon press conference has been postponed due to the bomb scare that occurred at the courthouse this afternoon, according to the Huffington Post: A press briefing regarding the Boston Marathon investigation was ...","date":"2013-04-16T23:56:23Z"},{"title":"Double coverage: How The Boston Globe used its dual sites to cover the marathon bombing","url":"http://www.niemanlab.org/2013/05/double-coverage-how-the-boston-globe-used-its-dual-sites-to-cover-the-marathon-bombing/","source":"Nieman Journalism Lab","description":"April 15 was always going to be a big day for The Boston Globe. Marathon Day is traditionally one of the busiest for the newspaper, with its staff deployed around the city following the race, running the race, or on the scene at Fenway for the Red Sox game.","date":"2013-05-05T23:55:20Z"},{"title":"Boston Marathon Bombing Investigation","url":"http://www.c-span.org/video/?312389-4/boston-marathon-bombing-investigation","source":"c-span.org","description":"Representative Bobby Scott (D-VA) talked abouit FBI and Homeland Security conduct in the investigation of the Boston Marathon… read more Representative Bobby Scott (D-VA) talked abouit FBI and Homeland Security conduct in the investigation of the Boston ...","date":"2013-04-25T23:52:52Z"},{"title":"Boston Marathon Bombing: Ben Affleck, Pink, Miley Cyrus React","url":"http://www.mtv.com/news/articles/1705746/boston-marathon-ben-affleck-miley-cyrus.jhtml","source":"MTV","description":"There were still more questions than answers on Tuesday morning (April 16) about who was behind the deadly bombings at the Boston Marathon on Monday that killed three people and wounded at least 144. President Obama vowed to a grieving nation that any ...","date":"2013-04-16T12:43:30Z"},{"title":"Boston Marathon Bombings: Twitter, Vine, and a Faster Terror","url":"http://www.thewrap.com/tv/column-post/boston-marathon-bombing-faster-terror-85891","source":"TheWrap","description":"We've come to a time when terrorism can be condensed to six hellishly hypnotic seconds. It became clear Monday that whoever carried out the Boston Marathon bombings did so — like the instigators of so many past terrorist attacks — with the intention of ...","date":"2013-04-16T04:08:07Z"},{"title":"Boston Marathon bombing comment no threat to St. Patrick's Day parade, Elmhurst police say","url":"http://abclocal.go.com/wls/story?id=9459318","source":"Abc Local Web","description":"March 8, 2014 (ELMHURST, Ill.) -- Police in west suburban Elmhurst have determined that there was no threat to the city's St. Patrick's Day parade after an anonymous user posted a comment on a local news website referencing the Boston Marathon bombing.","date":"2014-03-08T21:33:09Z"},{"title":"Boston Marathon bombing victim Halloween costume makes Michigan woman target on social media","url":"http://www.mlive.com/news/saginaw/index.ssf/2013/11/boston_marathon_bombing_victim.html","source":"MLive.com","description":"SAGINAW, MI — A photograph of a woman wearing a Saginaw Valley State University race shirt with fake wounds on her legs and face, meant to appear as a Boston Marathon bombing victim, has gone viral. The photograph drew attention and criticism from ...","date":"2013-11-05T01:11:47Z"},{"title":"GOP Lawmaker Suggests the Boston Marathon Bombing Was an Inside Job","url":"http://gawker.com/gop-lawmaker-suggests-the-boston-marathon-bombing-was-a-478818340","source":"Gawker","description":"This is Rep. Stella Tremblay. She is a Republican elected to New Hampshire's House of Representatives and she believes the government planned the bombing at the Boston Marathon last week that killed three people and injured more than 150 others. Tremblay ...","date":"2013-04-24T00:38:12Z"},{"title":"Please Stop Talking About How Flinty and Resilient Boston Is","url":"http://www.slate.com/articles/life/culturebox/2013/04/boston_marathon_bombing_stop_talking_about_how_flinty_and_resilient_boston.html","source":"Slate","description":"Everyone processes tragedy in their own way. This is as it should be. Throughout much of the day on Monday, after news of the bombing at the Boston Marathon hit, I shook in fear as details emerged, suppressing the urge to break down into tears ...","date":"2013-04-15T23:57:34Z"},{"title":"Veterans psychologically impacted by Boston Marathon Bombing","url":"http://www.sciencedaily.com/releases/2013/11/131108112242.htm","source":"Science Daily","description":"According to a new study, many Boston-area military veterans diagnosed with post-traumatic stress disorder (PTSD) experienced flashbacks, unwanted memories and other psychological effects as a result of the Boston Marathon Bombing in April 2013. The study ...","date":"2013-11-07T23:56:39Z"},{"title":"U.S. prosecutors will seek death penalty against Boston Marathon bombing suspect","url":"http://www.calgaryherald.com/news/prosecutors+will+seek+death+penalty+against+Boston+Marathon+bombing+suspect/9449899/story.html","source":"Calgary Herald","description":"BOSTON — U.S. prosecutors on Thursday announced they will seek the death penalty against 20-year-old Dzhokhar Tsarnaev in the Boston Marathon bombing, instantly raising the stakes in what could be one of the most wrenching trials the city has ever seen.","date":"2014-01-30T20:08:11Z"},{"title":"U.S. House Panel Blasts Intel Agencies for Failure to Detect Boston Terror Plot","url":"http://www.nationaljournal.com/global-security-newswire/u-s-house-panel-blasts-intel-agencies-for-failure-to-detect-boston-terror-plot-20140327","source":"National Journal","description":"A congressional committee on Wednesday criticized U.S. federal agencies for failing to detect and prevent last spring's attack on the Boston Marathon. A House Homeland Security Committee report criticized the Customs and Border Protection office ...","date":"2014-03-27T18:18:49Z"},{"title":"Boston Marathon Bombing Evokes Retrospection of Past Terrorist Events","url":"http://www.indyposted.com/194857/boston-marathon-bombing-evokes-retrospection-of-past-terrorist-events/","source":"IndyPosted (blog)","description":"The bombing at the Boston Marathon has been deemed an act of “terrorism” by the White House—the worst to take place in the United States since the events of September 11 th, which occurred 12 years ago and changed the course of the nation from the ...","date":"2013-04-17T02:12:24Z"},{"title":"Boston Marathon Bombing To Be Turned Into A Movie","url":"http://www.cinemablend.com/new/Boston-Marathon-Bombing-Turned-Movie-38411.html","source":"Cinema Blend","description":"It hasn't even been four months since the Boston Marathon bombings rocked the nation on April 15th, but already a movie adaptation is in the works. But before you cry out, \"Too soon,\" consider the pair behind the proposed docudrama. Paul Tamasy and Eric ...","date":"2013-07-08T22:17:57Z"},{"title":"Boston Marathon Bombing Spiked PTSD Among Veterans","url":"http://psychcentral.com/news/2013/11/11/boston-marathon-bombing-spiked-ptsd-among-veterans/61890.html","source":"Psych Centra","description":"New research suggests traumatic events may indirectly affect individuals already diagnosed with PTSD, escalating symptoms and distress. The findings emerge from a new study which discovered many Boston-area military veterans diagnosed with post-traumatic ...","date":"2013-11-10T23:53:05Z"},{"title":"The Boston Marathon Bombing: Keep Calm and Carry On","url":"http://www.theatlantic.com/national/archive/2013/04/the-boston-marathon-bombing-keep-calm-and-carry-on/275014/","source":"Atlantic Online","description":"It is easy to feel scared and powerless in the wake of attacks like those at the Boston Marathon. But it also plays into the perpetrators' hands. As the details about the bombings in Boston unfold, it'd be easy to be scared. It'd be easy to feel powerless ...","date":"2013-04-16T03:10:51Z"},{"title":"Boston Marathon bombings unleash a new wave of Islamophobia","url":"http://mondoweiss.net/2013/04/marathon-bombings-islamophobia.html","source":"mondoweiss.net","description":"It’s happening again: another collective freakout steeped in Islamophobia. The Boston Marathon bombings have unleashed the anti-Muslim sentiment that bubbles under the surface and always shines bright in times of national hysteria. The current wave of ...","date":"2013-04-18T23:54:01Z"},{"title":"Boston Marathon 'breakthrough' with camera footage","url":"http://www.theguardian.com/world/2013/apr/17/boston-marathon-bombings-investigation-live","source":"theguardian.com","description":"Wednesday, April 17, 2013, for victims of the Boston Marathon bombing. The anticipated FBI briefing, announced for 5pm ET, has been postponed (again). A room full of media with nowhere else to go, as the #FBI briefing has been postponed...indefinitely.","date":"2013-04-16T23:56:23Z"},{"title":"Boston Marathon bombing suspect Dzhokhar Tsarnaev pleads not guilty","url":"http://dailyfreepress.com/2013/07/10/boston-marathon-bombing-suspect-dzhokhar-tsarnaev-pleads-not-guilty/","source":"Daily Free Press","description":"With his left arm in a cast, his face slightly swollen and wearing an orange prison jumpsuit, Dzhokhar Tsarnaev­ — the suspected Boston Marathon bomber — made his first public appearance at the U.S. District Court in South Boston on Wednesday and ...","date":"2013-07-11T02:04:39Z"},{"title":"Suspect ID’d in Boston Marathon bombings","url":"http://wtvr.com/2013/04/17/boston-marathon-bombing-arrest/","source":"WTVR-TV","description":"(CNN) — Investigators in Washington and Boston denied Wednesday that an arrest had been made in the bombing of the Boston Marathon. They had earlier said there was “substantial” progress in the case. There is conflicting information as to whether ...","date":"2013-04-17T21:46:21Z"},{"title":"The Boston Marathon Bombings and the Image of God","url":"http://www.charismanews.com/opinion/39133-the-boston-marathon-bombings-and-the-image-of-god","source":"charismanews.com","description":"People embrace during a candlelight service at Arlington Street Church in Boston on Tuesday that honored the victims of the Boston Marathon bombings. (Reuters/Shannon Stapleton) In light of the horrible tragedy at the Boston Marathon Monday, many pundits ...","date":"2013-04-17T19:23:11Z"},{"title":"My Experience Photographing the Boston Marathon Bombing","url":"http://petapixel.com/2013/05/13/my-experience-photographing-the-boston-marathon-bombing/","source":"petapixel.com","description":"Patriots Day. This Massachusetts holiday celebrates the battles of Lexington and Concord, which were the first battles of the American Revolutionary War in 1775. The day always begins with battle re-enactments. Then the Red Sox play an 11AM game, and ...","date":"2013-05-12T23:54:11Z"},{"title":"Fake Prince Harry dating show; MH370 movie in works; Spice Girls reunion: PM Buzz","url":"http://www.syracuse.com/entertainment/index.ssf/2014/03/prince_harry_dating_show_mh370_movie_spice_girls_reunion.html","source":"Syracuse Post-Standard","description":"Want a royal wedding? Prince William is already taken by Kate Middleton, but 12 U.S. women think they have a chance to marry Prince Harry. Fox announced a new reality TV show called \"I Wanna Marry 'Harry'\" where a dozen Americans believe they're competing ...","date":"2014-03-27T15:48:29Z"},{"title":"Tsarnaev’s Trial for Boston Marathon Bombing Begins Nov 3","url":"http://www.jewishpress.com/news/tsarnaevs-trial-for-boston-marathon-bombing-begins-nov-3/2014/02/13/","source":"Jewish Press","description":"Attorneys for Dzokhar Tsarnaev, the 20 year-old sole remaining suspect in last year’s Boston Marathon Bombing attack, met in Boston for a status conference with the prosecutors and the judge on Wednesday, Feb. 12. This is the first court appearance since ...","date":"2014-02-12T23:56:08Z"},{"title":"Explosions Reported at Boston Marathon Finish Line [Live Updates]","url":"http://nymag.com/daily/intelligencer/2013/04/bomb-reported-at-boston-marathon-finish-line.html","source":"New York Magazine","description":"Members of the bomb squad also made a 'controlled blast' of another explosive ... Police counts at least two dead and 23 people injured. Update, 3:58 p.m.: The Boston Marathon confirms in a statement, \"There were two bombs that exploded near the finish ...","date":"2013-04-16T04:08:07Z"},{"title":"FBI: Release of marathon suspect photo right call","url":"http://www.marinij.com/tablehome/ci_25405044/fbi-right-call-release-marathon-suspect-photo","source":"Marin Independent Journal","description":"... officials debated whether to release photos that led to the capture of a suspect in last year's bombing at the Boston Marathon, an FBI official has told CBS News. Stephanie Douglas, executive assistant director of the FBI's National ...","date":"2014-03-23T22:55:34Z"},{"title":"Feds to seek death penalty against Boston Marathon bombing suspect","url":"http://www.suntimes.com/news/nation/25280907-418/feds-to-seek-death-penalty-against-boston-marathon-bombing-suspect.html","source":"Chicago Sun-Times","description":"BOSTON (AP) — Federal prosecutors Thursday announced they will seek the death penalty against 20-year-old Dzhokhar Tsarnaev in the Boston Marathon bombing, accusing him of betraying his adopted country by ruthlessly carrying out a terrorist ...","date":"2014-01-30T21:34:05Z"},{"title":"Boston Marathon Bombing Suspect Killed; Manhunt Ongoing for Accomplice, City on Lockdown—Celebs React","url":"http://www.eonline.com/news/409790/boston-marathon-bombing-suspect-killed-manhunt-ongoing-for-accomplice-city-on-lockdown-celebs-react","source":"E Online","description":"Boston and several of its suburbs are on lockdown Friday morning. One of the Boston marathon bombing suspects, Tamerlan Tsarnaev, was killed early this morning after he and his accomplice—his brother, Dzhokhar Tsarnaev—robbed a 7-Eleven ...","date":"2013-04-19T13:08:35Z"},{"title":"Barack Obama praises Russian help on Boston Marathon bombing investigation","url":"http://www.ndtv.com/article/world/barack-obama-praises-russian-help-on-boston-marathon-bombing-investigation-361177","source":"NDTV","description":"Washington: President Barack Obama said Tuesday that the US and Russia are overcoming Cold War era suspicions to co-operate on the investigation of the Boston Marathon bombings as his top diplomat announced plans to travel to Russia. Obama acknowledged ...","date":"2013-05-01T03:43:10Z"},{"title":"Boston Marathon Bombings: How to Send Help (and Avoid Scams)","url":"http://business.time.com/2013/04/17/boston-marathon-bombings-how-to-help-and-avoid-scams/","source":"business.time.com","description":"It’s only human nature to want to help out victims of a disaster, but tragic events also bring scam artists out of the woodwork. In the aftermath of the Boston Marathon bombings, an outpouring of support has prompted numerous charitable ...","date":"2013-04-17T23:55:12Z"},{"title":"Boston Marathon Bombing Survivors Questioned about Death Penalty","url":"http://www.jdjournal.com/2014/01/31/boston-marathon-bombing-survivors-questioned-about-death-penalty/","source":"jdjournal.com","description":"On Thursday, prosecutors announced they will seek the death penalty against Boston Marathon bombing suspect, 19 year-old, Dzhokhar Tsarmaev. According to CNN prosecutors say he acted in “an especially heinous, cruel and depraved manner” and lacks remorse.","date":"2014-01-30T23:57:15Z"},{"title":"Boston Marathon Bombings: Twitter, Vine, and a Faster Terror","url":"http://www.thewrap.com/?p=85891","source":"TheWrap","description":"We've come to a time when terrorism can be condensed to six hellishly hypnotic seconds. It became clear Monday that whoever carried out the Boston Marathon bombings did so — like the instigators of so many past terrorist attacks — with the intention of ...","date":"2013-04-16T05:55:29Z"},{"title":"Boston Marathon 'bombing suspect' seen on video","url":"http://www.bbc.co.uk/news/world-us-canada-22190353","source":"BBC Online","description":"Officials investigating the Boston Marathon bombings say they have found images of a potential suspect from surveillance camera footage. Boston City Council President Stephen Murphy said a man was seen dropping off a bag at the scene on Monday.","date":"2013-04-17T17:14:20Z"},{"title":"Boston Marathon bombing victim finds love in hospital, to marry rehab nurse","url":"http://blog.al.com/spotnews/2013/12/boston_marathon_bombing_victim.html","source":"Everything Alabama Blog","description":"A Massachusetts man who was badly injured in the Boston Marathon bombing is engaged to a nurse he met in the rehab hospital where he underwent physical therapy. James Costello, who was so badly burned on his right leg and arm that he had to have pig skin ...","date":"2013-12-16T20:47:14Z"},{"title":"CNN, the AP, and Fox News Get Boston Marathon Bombing Arrest Story Wrong","url":"http://www.politicususa.com/2013/04/17/cnn-ap-arrest-boston-marathon-bombing-cbsnbc-arrest.html","source":"politicususa.com","description":"CNN jumped in and claimed that an arrest had been made, “An arrest has been made in the Boston bombings investigation based on two videos showing images of the suspect, a federal law enforcement source told CNN’s Fran Townsend.” NBC News came back ...","date":"2013-04-16T23:56:23Z"},{"title":"Dzhokhar Tsarnaev: Boston Marathon bombing suspect's connection to Ben Affleck and Matt Damon","url":"http://blog.zap2it.com/pop2it/2013/04/dzhokhar-tsarnaev-boston-marathon-bombing-suspects-connection-to-ben-affleck-and-matt-damon.html","source":"Zap2it.com","description":"A manhunt is on for Dzhokhar Tsarnaev, a 19-year-old Chechen immigrant suspected in the April 15 Boston Marathon bombing. The FBI released a photo of Tsarnaev, who has reportedly been in the United States for 10 years. In May 2011, the City of ...","date":"2013-04-19T15:38:54Z"},{"title":"Boston Marathon bombing story to become movie 'Boston Strong'","url":"http://blog.zap2it.com/pop2it/2013/07/boston-marathon-bombing-story-to-become-movie-boston-strong.html","source":"Zap2it.com","description":"It only took three months, but people in Hollywood have already snapped up the rights to make a film about the Boston Marathon bombings. At least the project is coming from a duo who have a soft spot for the Boston community: \"The Fighter ...","date":"2013-07-09T19:53:36Z"},{"title":"Sports Illustrated dedicates cover to Boston Marathon bombings","url":"http://popwatch.ew.com/2013/04/16/sports-illustrated-cover-boston-marathon-bombings/","source":"Entertainment Weekly Online","description":"The cover of this week’s Sports Illustrated features a powerful image of three Boston police officers and a fallen runner following the tragic bombings at the Boston Marathon on Monday. The title of the magazine’s feature is simply “Boston.”","date":"2013-04-16T20:43:07Z"},{"title":"Boston Marathon Bombing Book Optioned By 'The Fighter' Writers","url":"http://moviesblog.mtv.com/2013/07/09/boston-marathon-bombing-movie-rights/","source":"MTV.com (blog)","description":"Well, we all saw this coming, right? Deadline is reporting that Eric Johnson and Paul Tamasy, two of the writers behind David O. Russell's \"The Fighter\" with Mark Wahlberg and Christian Bale, have optioned the screen rights to \"Boston Strong,\" a ...","date":"2013-07-09T17:08:58Z"},{"title":"New Developments in the Boston Marathon Bombings Case","url":"http://legalinsurrection.com/2013/04/new-developments-in-the-boston-marathon-bombings-case/","source":"legalinsurrection.com","description":"There have been several new developments today in the Boston bombings case. Authorities are searching a landfill for a laptop believed to be tied to the Boston Marathon bombers, according to CNN. Information from Dzhokhar Tsarnaev himself, plus other leads ...","date":"2013-04-26T22:47:16Z"},{"title":"Benzino Speaks On Boston Marathon Bombing: ‘Boston People Are Strong, We’ll Get Through This’","url":"http://www.vibe.com/article/benzino-speaks-boston-marathon-bombing-%E2%80%98boston-people-are-strong-we%E2%80%99ll-get-through-this%E2%80%99","source":"Vibe","description":"Three massive explosions rocked the Boston Marathon this afternoon, leaving two dead and an estimated 100 injured, according to the Boston Globe. As updates from the tragic bombing continue to unfold, the hip-hop community has already responded. Benzino ...","date":"2013-04-15T22:24:31Z"},{"title":"8 tips for talking to kids about the Boston Marathon bombing","url":"http://www.today.com/moms/8-tips-talking-kids-about-boston-marathon-bombing-1C9361539","source":"today.com","description":"The Boston Marathon bombing will represent a tragic and terrifying childhood milestone for a generation of kids born after the Sept. 11, 2001 attacks, or too young to remember them. How can parents help kids cope -- even as we're struggling with our own fears?","date":"2013-04-16T16:03:56Z"},{"title":"Boston Marathon Bombing Victim Jeff Bauman to Publish Book","url":"http://nesn.com/2013/09/boston-marathon-bombing-victim-jeff-bauman-to-publish-book/","source":"New England Sports Network","description":"Jeff Bauman became a household name following one of the most vicious events in Boston’s history. Now, the survivor of the Boston Marathon bombings plans to publish a book in April of 2014 — right around the anniversary of the devastating attack.","date":"2013-09-03T23:55:00Z"},{"title":"Why Boston Marathon Bombing Suspect Tamerlan Tsarnaev’s Autopsy Should Include A Check For CTE","url":"http://thinkprogress.org/alyssa/2013/04/23/1902591/why-boston-marathon-bombing-suspect-tamerlan-tsarnaevs-autopsy-should-include-a-check-for-cte/","source":"Think Progress","description":"Could the amateur boxing career of Tamerlan Tsarnaev, the deceased suspect in last week’s Boston Marathon bombings, have had a role in the massacre? That’s a question leading brain researchers at Boston University’s School of Medicine hope medical ...","date":"2013-04-23T14:22:35Z"},{"title":"Boston Commish: 3 lessons learned from marathon bombing","url":"http://www.policeone.com/chiefs-sheriffs/articles/6547563-Boston-Commish-3-lessons-learned-from-marathon-bombing/","source":"Police one.com","description":"It is hard to believe more than six months have passed since the Boston Marathon bombing that killed three people and injured 264 others. It was a day that many will never forget, including Edward Davis, Commissioner of the Boston Police Department.","date":"2013-10-24T23:58:56Z"},{"title":"IRS extends tax deadline for Boston bombing victims","url":"http://money.cnn.com/2013/04/17/pf/taxes/boston-marathon-bombing/index.html","source":"CNN Money","description":"Anyone outside of Suffolk County who was impacted by the bombings, which occurred on Tax Day, can also request to be covered by the extension by calling 1-866-562-5227 beginning on April 23. Related: Beware bogus Boston Marathon charity websites ...","date":"2013-04-17T16:38:33Z"},{"title":"Full Interview: Boston Marathon Bombing Victim on Moving Forward","url":"http://www.pbs.org/newshour/rundown/boston-marathon-bombing-victim-on-moving-forward/","source":"pbs.org","description":"Boston Marathon bombing victim Roseann Sdoia talked to WGBH Greater Boston host Emily Rooney about the day of the bombings, her recovery and her plans to move forward. Roseann Sdoia was waiting for a friend at the Boston Marathon finish line when the ...","date":"2013-05-10T21:40:33Z"},{"title":"Boston Marathon Bombing Suspect Tried To Kill Himself Before Arrest?! May Never Speak Again!","url":"http://perezhilton.com/2013-04-21-boston-marathon-bombing-susect-dshokhar-tsarnaev-tried-to-kill-himself","source":"PerezHilton.com","description":"While the country sighed a collective sigh of relief after discovering that the second suspect in the Boston Marathon bombing, Dzhokhar Tsarnaev, apprehended by authorities injured, yet alive Friday night, it seems less and less hopeful now that he'll ever ...","date":"2013-04-21T23:00:21Z"},{"title":"Bomb Experts Offer Analysis Based on Details from Boston Marathon Explosions","url":"http://www.usnews.com/news/articles/2013/04/15/bomb-experts-offer-analysis-based-on-details-from-boston-marathon-explosions","source":"US News and World Report","description":"The explosions at the Boston Marathon on Monday were likely caused by high-power black powder explosives, bomb experts tell U.S. News, and at least one of them was likely shaped in a pipe bomb. [LIVE: Latest on the Boston Marathon Bombing] Footage of the ...","date":"2013-04-14T23:58:45Z"},{"title":"Rolling Stone Turns Off Readers With Boston Marathon Bombing Cover","url":"http://perezhilton.com/2013-07-17-boston-marathon-bombing-suspect-dzhokhar-tsarnaev-rolling-stone-cover","source":"PerezHilton.com","description":"We're pretty sure this isn't who Dr. Hook had in mind! The most recent cover of the Rolling Stone features a full-sized pic of Dzhokhar Tsarnaev, who recently pled Not Guilty to 30 charges in relation to the Boston Marathon Bombing. Rather than his oft ...","date":"2013-07-17T16:30:50Z"},{"title":"3 dead, more than 140 hurt from Boston Marathon bomb blasts","url":"http://www.wistv.com/story/21982414/3-dead-more-than-140-hurt-from-boston-marathon-bomb-blasts","source":"WIS-TV","description":"BOSTON (RNN) - While people fight for their lives at local hospitals, the search is on for possible motives and suspects in Monday's deadly bombing at the Boston Marathon. At least three people are dead and more than 140 are injured after back-to-back ...","date":"2013-04-15T20:01:21Z"},{"title":"Boston May Host Congressional Hearing on Boston Marathon Bombings","url":"http://bostinno.streetwise.co/2014/02/12/boston-marathon-bombing-congressional-hearing-rep-bill-keating/","source":"bostinno.streetwise.co","description":"Upon completion of a Congressional investigation into the tragic Boston Marathon bombings last year, it's being reported that Boston is slated to act as the venue for a hearing designated to give voice to the victims and first responders who witnessed, and ...","date":"2014-02-12T22:37:24Z"},{"title":"Boston Marathon Bomb Suspects Identified By FBI (PHOTOS x VIDEO)","url":"http://globalgrind.com/2013/04/18/boston-marathon-bomb-suspects-identified-fbi-photos-x-video/","source":"Global Grind","description":"While we now know both suspects in the Boston Marathon bombing are brothers, Tamerlan and Dzhokhar A. Tsarnaev, it appears a local Fox station got their wires crossed misidentifying Zooey Deschanel as one of the suspects, Friday. According to Huffington ...","date":"2013-04-18T20:33:35Z"},{"title":"Kate Gosselin Using Boston Bombing Tragedy To Gain Attention, Wants To Run A Marathon For Victims","url":"http://www.celebdirtylaundry.com/2013/kate-gosselin-boston-bombing-run-marathon-0417/","source":"Celebrity Dirty Laundry","description":"Is there anything worse than a reality television star who uses a national tragedy to try to increase her own profile? At least the Kardashians, whatever else you can say about them, have kept their mouths shut in the face of the Boston marathon bombings ...","date":"2013-04-17T12:49:29Z"},{"title":"In the Wake of the Boston Marathon Bombing, Twitter Was Full of Lies","url":"http://www.smithsonianmag.com/smart-news/in-the-wake-of-the-boston-marathon-bombing-twitter-was-full-of-lies-5294419/","source":"smithsonianmag.com","description":"From the time two bombs went off near the finish line of the Boston Marathon on April 15, until Dzhokhar Tsarnaev was pulled out of a boat, nearly 8 million relevant tweets were sent by 3.7 million people, say researchers Aditi Gupta, Hemank Lamba ...","date":"2013-10-24T18:43:58Z"},{"title":"5 triage lessons learned from the Boston Marathon Bombing","url":"http://www.ems1.com/ems-products/Bleeding-Control/articles/1649473-5-triage-lessons-learned-from-the-Boston-Marathon-Bombing/","source":"ems1.com","description":"At the 117th running of the Boston Marathon, EMS and other on-scene medical professionals were prepared to handle the usual influx of runner and bystander injuries that come from an athletic mass event. But for the physicians who were part of the medical ...","date":"2014-01-17T04:45:52Z"},{"title":"Social Media and the Boston Marathon Bombings: The Changing Face of Trust","url":"http://www.brandchannel.com/home/post/2013/04/23/Social-Media-Boston-Marathon-Bombings-042313.aspx","source":"brandchannel","description":"On Monday, April 15 at 2:50pm, Twitter user @DeLoBarstool tweeted one of the first internet records of the Boston Marathon bombings. From that point on, social media users, citizen journalists and venerable broadcasters fell down the rabbit-hole of ...","date":"2013-04-24T06:43:16Z"},{"title":"Boston bombings lead to security improvements for California International Marathon","url":"http://www.sacbee.com/2013/11/30/5959485/boston-bombings-lead-to-security.html","source":"Sacramento Bee","description":"When thousands of runners take off from Folsom Dam in the California International Marathon next Sunday, organizers hope few will notice any difference from past races through the Sacramento region. But, in the aftermath of the Boston Marathon bombings ...","date":"2013-12-01T01:31:04Z"},{"title":"Steven Seagal Supports Vladimir Putin","url":"http://www.webpronews.com/steven-seagal-supports-vladimir-putin-2014-03","source":"WebProNews","description":"musician and reserve deputy sheriff Steven Seagal did an interview with the state-run Russian newspaper Rossiskaya Gazeta, in which he’d expressed that Vladimir Putin’s actions against Crimea are “highly reasonable.” The 7th-dan black belt in ...","date":"2014-03-27T12:13:44Z"},{"title":"Breaking Boston star Caitlin Norden’s brothers both lost a leg in Boston Marathon bombings","url":"http://starcasm.net/archives/262374","source":"Starcasm.net","description":"As we mentioned last week, A&E and executive producer Mark Wahlberg are teaming up once again for a new series that promises to be more than your typical all-female catfightfest reality show. Titled Breaking Boston and premiering March 13 at 10/9c, the ...","date":"2014-02-25T05:32:40Z"},{"title":"Run the Boston Marathon in Honor of Lu Lingzi (GRS’13)","url":"http://www.bu.edu/today/2014/run-the-boston-marathon-in-honor-of-lu-lingzi/","source":"Boston University","description":"In a tribute sure to be coveted by marathon runners around the world, the Boston Athletic Association has given the family of Lu Lingzi (GRS’13), the BU student killed in the bombing at last year’s Boston Marathon, 15 spots for runners in this year’s ...","date":"2014-01-29T23:58:26Z"},{"title":"On That Iconic Photo from the Boston Marathon Bombings","url":"http://www.bagnewsnotes.com/2013/04/on-todays-iconic-photo-from-the-boston-marathon-bombings/","source":"bagnewsnotes.com","description":"Maybe the timing was botched and the aim was for something more spectacular and cataclysmic: world-class runners, politicians and city VIPs all eviscerated followed by days of televised feedback loops, like on 9/11. Instead, the two explosions on Boylston ...","date":"2013-04-15T23:57:34Z"},{"title":"Chris Matthews blames radical right for Boston Marathon bombings","url":"http://redalertpolitics.com/2013/04/16/chris-matthews-blames-radical-right-for-boston-marathon-bombings/","source":"redalertpolitics.com","description":"Leave it to MSNBC’s Chris Matthews to make the most ridiculous comments about who was behind Monday’s Boston Marathon bombings. While Boston police, city officials and the FBI were just beginning their investigation into the cause of the bombings ...","date":"2013-04-15T23:57:34Z"},{"title":"Live updates: Three killed in Boston Marathon explosions","url":"http://www.smh.com.au/world/live-updates-three-killed-in-boston-marathon-explosions-20130416-2hwmy.html","source":"Sydney Morning Herald","description":"Two explosions went off near the finish line of the Boston Marathon just before 3pm local time (5am AEST) — about four hours after the start of the men's race. • Three people died and at least 140 were injured as a result of the bomb blasts ...","date":"2013-04-15T22:10:12Z"},{"title":"Dallas St. Patrick’s Day Parade security will see two small changes after SXSW, Boston Marathon bombings","url":"http://crimeblog.dallasnews.com/2014/03/dallas-st-patricks-day-security-will-have-two-small-changes-after-sxsw-boston-marathon-bombings.html/","source":"Dallas Morning News (blog)","description":"A pair of tragedies in other cities will mean two small security changes to Saturday’s St. Patrick’s Day Parade, a Dallas deputy police chief said Friday. But Gary Tittle, who oversees the central patrol division, stressed that little is changing ...","date":"2014-03-14T22:44:46Z"},{"title":"Enda Kenny visits Boston marathon bombing site, defends Boston College visit","url":"http://www.irishcentral.com/news/-enda-kenny-visits-boston-marathon-bombing-site-defends-boston-college-visit-208109191-237590771.html","source":"Irish Central","description":"Irish Prime Minister Enda Kenny has said Cardinal Sean O’Malley is entitled to his opinion on abortion – as protesters prepare to voice their opposition to his visit to Boston College. Kenny made his comments as he laid a floral tribute on behalf of ...","date":"2013-05-20T14:40:40Z"},{"title":"Boston Marathon bombing victim running on prosthetic legs","url":"http://www.wjla.com/articles/2014/01/boston-marathon-bombing-victim-running-on-prosthetic-legs-99213.html","source":"ABC 27","description":"(CNN/WCVB) - A woman who lost both of her legs but survived last year's Boston Marathon bombings is not only back on her feet, she's running again. Thanks to new prosthetics, Celeste Corcoran is getting her life back and taking on new challenges.","date":"2014-01-13T20:06:52Z"},{"title":"The Ideology Behind the Boston Marathon Bombing","url":"http://hnn.us/article/151618","source":"History News Network","description":"Timothy R. Furnish holds a PhD in Islamic, World and African History (Ohio State), is a U.S. Army veteran and recovering college professor, and currently makes a living as an author, lecturer and consultant to the U.S. military. His website is www ...","date":"2013-04-21T23:57:37Z"},{"title":"AP: Officials Deny Arrest Made In Boston Marathon Bombings","url":"http://pittsburgh.cbslocal.com/2013/04/17/ap-arrest-imminent-in-boston-marathon-bombings/","source":"pittsburgh.cbslocal.com","description":"BOSTON (KDKA/AP) — In what could be a major break in the Boston Marathon case, investigators are on the hunt for a man seen in a department-store surveillance video dropping off a bag at the site of the bombings, a Boston politician said Wednesday.","date":"2013-04-16T23:56:23Z"},{"title":"Death threats sent to woman who dressed as Boston Marathon bombing victim for Halloween","url":"http://nakedsecurity.sophos.com/2013/11/06/death-threats-sent-to-woman-who-dressed-as-boston-marathon-bombing-victim-for-halloween/","source":"nakedsecurity.sophos.com","description":"For Halloween, Alicia Ann Lynch, a 22-year-old US woman from Michigan, went to work dressed as a victim of the Boston Marathon bombings, clad in sneakers, running shorts, and a race number, splattered with fake blood. Then, she tweeted and Instagrammed ...","date":"2013-11-05T23:59:01Z"},{"title":"Widow of Boston Marathon bombing suspect in Wrentham court on traffic charges","url":"http://www.thesunchronicle.com/news/local_news/widow-of-boston-marathon-bombing-suspect-in-wrentham-court-on/article_22c5baba-793f-11e3-9d40-001a4bcf887a.html","source":"Sun Chronicle","description":"WRENTHAM — The widow of Boston Marathon bombing suspect Tamerlan Tsarnaev appeared in Wrentham District Court Thursday morning on traffic charges. Katherine Tsarnaeva, 24, was ordered to pay $150 in court costs on a charge of driving with a suspended ...","date":"2014-01-10T14:55:27Z"},{"title":"California state senator arrested in FBI sweep","url":"http://www.edmontonsun.com/2014/03/26/california-state-senator-arrested-in-fbi-sweep","source":"Edmonton Sun","description":"California State Senator Leland Yee (D-San Francisco) poses for a portrait in his office in San Francisco, California, in this July 3, 2009, file photo. Yee was arrested ... and State Senator Rod Wright, found guilty of voter fraud, took paid ...","date":"2014-03-26T21:11:48Z"},{"title":"BREAKING: FBI Releases Photos, Video of Possible Boston Suspects","url":"http://townhall.com/social/loiso12013-587022/breaking-fbi-releases-photos-video-of-possible-boston-suspects-n1572307_cmt_6758568","source":"Townhall.com","description":"The Federal Bureau of Investigation just held a press conference at which they released a series of photos of two young men they're identifying as \"persons of interest\" in this week's deadly bombings at the Boston Marathon. The potential suspects appear to ...","date":"2014-03-26T11:46:18Z"},{"title":"Death Penalty Decision Imminent in Boston Bombing","url":"http://www.officer.com/news/11302122/death-penalty-decision-imminent-in-boston-marathon-bombing","source":"Officer.com","description":"In the next day or two, Holder will make the most high-profile death penalty decision of his career in law enforcement: whether to seek capital punishment in the case of Dzhokhar Tsarnaev, the defendant in the Boston Marathon bombings last April that ...","date":"2014-01-28T23:59:37Z"},{"title":"WSIC Foundation to Film Boston Marathon Bombing Survivor Documentary","url":"http://www.24-7pressrelease.com/press-release/wsic-foundation-to-film-boston-marathon-bombing-survivor-documentary-368821.php","source":"24-7 Press Release","description":"BOSTON, MA, November 18, 2013 /24-7PressRelease/-- The Who Says I Can't Foundation (WISCF) announced co-producers Jothy Rosenberg and Steve McCarthy will begin production on a year-long documentary following Boston Marathon bombing victim Roseann Sdoia.","date":"2013-11-18T07:58:42Z"},{"title":"Boston Marathon bomb survivor John Odom set to return home to Torrance","url":"http://www.dailybreeze.com/general-news/20130828/boston-marathon-bomb-survivor-john-odom-set-to-return-home-to-torrance","source":"Daily Breeze","description":"Nearly five months after a bomb almost took his life at the Boston Marathon, John Odom of Torrance was cleared by doctors on Wednesday to finally come home. Odom’s wife, Karen, who has never left her husband’s side, has been chronicling her husband’s ...","date":"2013-08-29T02:39:35Z"},{"title":"Boston Marathon bombing suspect seeks to have some charges dismissed","url":"http://ca.news.yahoo.com/boston-marathon-bombing-suspect-statement-detriment-during-sisters-210853193.html","source":"Yahoo!","description":"BOSTON - An FBI agent overheard Boston Marathon bombing suspect Dzhokhar Tsarnaev make a \"statement to his detriment\" when his sister visited him in prison, U.S. prosecutors said Friday. Prosecutors did not reveal what Tsarnaev said, but they objected to ...","date":"2014-02-27T23:59:50Z"},{"title":"Undeterred by bombings, local runners return to Boston Marathon","url":"http://www.wwltv.com/news/After-Bombings-Louisiana-Runners-Gear-Up-For-Boston-Marathon-231840311.html","source":"WWL-TV","description":"NEW ORLEANS -- This spring runners from across the metro area will return to Boston to conquer a 26.2 mile elite race. Marathons test a person's physical endurance, but in April, the Boston Marathon will test many athletes emotional resolve. WWL-TV's Tania ...","date":"2013-11-14T03:31:26Z"},{"title":"How News Outlets Could Have Reported on the Boston Marathon Bombing","url":"http://www.mediabistro.com/10000words/media-coverage-of-boston-marathon-bombing_b18656","source":"Media Bistro","description":"If journalism is the first draft of history, it’s starting to look a lot like a mangled Google doc with too many approved editors this week. The only thing more ‘disgusting’ — as Jimmy Kimmel so aptly put it in his monologue Monday night — than ...","date":"2013-04-17T17:14:20Z"},{"title":"False Flags, Fake Blood, and Michelle Obama: A Guide to the Boston Marathon Conspiracies","url":"http://www.wired.com/dangerroom/2013/04/boston-marathon-conspiracies/","source":"Wired News","description":"Of course all this is true, it’s on the internet. And the internet’s conspiracy theorists have been hard at work the past week revealing the hidden secrets behind the Boston Marathon bombings. The reason for all the complexity and machinations between ...","date":"2013-04-22T23:56:26Z"},{"title":"Boston Bombing Aftermath: Fear, Empathy, Anger","url":"http://www.webmd.com/mental-health/news/20130416/boston-marathon-bombing-impact","source":"WebMD","description":"April 16, 2013 -- It’s normal to feel a range of emotions the day after the terror bombing attack at the Boston Marathon, even if you were thousands of miles away. Los Angeles psychologist Emanuel Maidenberg, PhD, says that in the wake of all ...","date":"2013-04-16T21:40:23Z"},{"title":"'Mystery Man On The Roof' Conspiracy Surrounds Boston Marathon Bombing","url":"http://www.vibe.com/article/mystery-man-roof-conspiracy-surrounds-boston-marathon-bombing","source":"Vibe","description":"Two large explosions rocked the Boston Marathon yesterday, leaving over 150 people injured and three people dead. The blasts occurred nearly 15 seconds apart near the race’s finish line inside the Fairmount Copley Plaza Hotel around 3 p.m. Boston police ...","date":"2013-04-16T17:15:31Z"},{"title":"Google Activates Person Finder in Aftermath of Boston Marathon Bombings","url":"http://www.eweek.com/cloud/google-activates-person-finder-in-aftermath-of-boston-marathon-bombings/","source":"eWeek","description":"Google's Person Finder set up a method for people to check on friends and family ... By the afternoon of April 16, information about some 5,400 people had been entered into the database so that people could search for loved ones to make sure they were ...","date":"2013-04-15T23:57:34Z"},{"title":"Trial date set for Boston Marathon bombing suspect","url":"http://dailyfreepress.com/2014/02/12/trial-date-set-for-boston-marathon-bombing-suspect/","source":"Daily Free Press","description":"Dzhokhar Tsarnaev’s defense attorneys and prosecutors held a status conference in Boston on Wednesday, setting a trial date and another status conference date where they will decide the location of the trial. U.S. District Court Judge George A.","date":"2014-02-13T03:59:31Z"},{"title":"The Return of the Tourniquet","url":"http://www.newrepublic.com/article/112939/boston-marathon-bombing-return-tourniquet","source":"newrepublic.com","description":"Neither Boston Medical Center nor Boston Emergency Medical Services have responded to queries about how tourniquets were used after the marathon bombings, so we can't yet confirm their effectiveness. It wouldn't be the first time, though, that killing ...","date":"2013-04-16T23:56:23Z"},{"title":"Boston Marathon bombs: al-Qaeda's Inspire magazine taught pressure cooker bomb-making techniques","url":"http://www.telegraph.co.uk/news/worldnews/al-qaeda/9998886/Boston-Marathon-bombs-al-Qaedas-Inspire-magazine-taught-pressure-cooker-bomb-making-techniques.html","source":"Daily Telegraph","description":"The recipe – along with a rationale for post-9/11 terror – was printed three years ago in al-Qaeda’s English-language promotional online magazine, Inspire. In an article, it instructed readers on how, as its headline writers put it, to ...","date":"2013-04-16T18:34:16Z"},{"title":"Boston Marathon Innovation: New P.A. System At Water Stops","url":"http://www.xtri.com/features/detail/284-itemId.511716872.html","source":"Xtri","description":"Given the nasty weather of recent Boston Marathons — a major nor’easter in 2007, high heat in 2012 — race officials spent a good deal of time discussing the use of a public-address system on the 26.2 mile course. After last year’s bombings, the ...","date":"2014-03-27T14:29:45Z"},{"title":"The Boston Marathon Bombing, Drones and the Meaning of Cowardice","url":"http://www.counterpunch.org/2013/04/16/the-boston-marathon-bombing-drones-and-the-meaning-of-cowardice/","source":"Counter Punch","description":"But, if that be the definition of cowardice, what could be more cowardly ... has been able to identify by name only a few hundred of the actual victims. Who knows what their political affiliations really were? Or even less, what considerations—legal ...","date":"2013-04-16T20:35:57Z"},{"title":"Judge sets Nov. trial in Boston marathon bombing","url":"http://www.komonews.com/news/national/Judge-sets-Nov-trial-in-Boston-marathon-bombing-245227361.html","source":"KOMO News","description":"BOSTON (AP) - Boston Marathon bombing suspect Dzhokhar Tsarnaev was given a November trial date over the strenuous objections of his attorneys, who said Wednesday that they won't have enough time to mount a defense in a terrorism case that carries a ...","date":"2014-02-12T18:12:33Z"},{"title":"A Video of Two Suspects — First Solid Lead on Boston Marathon Bombing","url":"http://www.jdjournal.com/2013/04/18/a-video-of-man-with-backpack-first-solid-lead-on-boston-marathon-bombing/","source":"jdjournal.com","description":"Investigators may have made a break with the Boston Marathon case. After twin explosions detonated near the finish line of the Boston Marathon this Monday, killing 3 and injuring countless more, investigators have been focusing incredible attention over ...","date":"2013-04-18T20:40:44Z"},{"title":"Trial date set for Boston Marathon bombings suspect","url":"http://www.thejournal.ie/boston-bombings-trial-date-1312640-Feb2014/","source":"thejournal.ie","description":"A JUDGE HAS set a November trial date for Boston Marathon bombings suspect Dzhokhar Tsarnaev. Judge George O’Toole Junior said today in a U.S. District Court that he has set the trial for 3 November. Several of the 260 people injured in the terrorist ...","date":"2014-02-12T18:48:20Z"},{"title":"Boston Marathon Bombing Obvious False Flag","url":"http://mwcnews.net/focus/politics/33334-boston-marathon-bombing.html","source":"MWC News","description":"The Boston Marathon bombing of April 15th is \"the most obvious 'false flag' attack in U.S. history,\" Dr. Jim Fetzer, a distinguished university professor and author of 20 books on artificial intelligence and cognitive science, says. The attacks, near the ...","date":"2013-11-11T23:59:04Z"},{"title":"Rising emergency department visits driving demand for nurses","url":"http://abcnewspapers.com/2014/03/27/rising-emergency-department-visits-driving-demand-for-nurses/","source":"ABC Newspapers","description":"While disasters such as these are rare, emergency medicine plays a pivotal role in our nation’s health care system every day. Emergency nurses, in particular ... according to a study published in-”Annals of Emergency Medicine.”","date":"2014-03-27T09:36:16Z"},{"title":"Bruins express sympathy for fallen Boston firefighters","url":"http://bigbadblog.weei.com/sports/boston/hockey/bruins/2014/03/27/bruins-express-sympathy-for-fallen-boston-firefighters/","source":"Big Bad Blog","description":"For the second consecutive year, the Bruins have had to play while their city has watched with heavy hearts. Multiple Bruins expressed their grief over the losses of Lt. Ed Walsh and firefighter Mike Kennedy in Wednesday’s nine-alarm fire in ...","date":"2014-03-27T17:57:20Z"},{"title":"Secret Service failures put Obama supporters on edge","url":"http://thegrio.com/2014/03/27/secret-service-failures-put-obama-supporters-on-edge/","source":"The Grio","description":"It is incomprehensible to them. Hence, the disgusting monkey photo a Belgian newspaper posted of President Obama and first lady Michelle Obama. Such ignorance could be taken as merely the unenlightened, but harmless opinion of a few people.","date":"2014-03-27T09:21:57Z"},{"title":"Dancer Who Lost Foot in Boston Marathon Bombing Vows to Take to the Floor Again","url":"http://gma.yahoo.com/blogs/abc-blogs/dancer-lost-foot-boston-marathon-bombing-vows-floor-021109058--abc-news-topstories.html","source":"gma.yahoo.com","description":"A week ago, Adrianne Haslet and her husband, Adam Davis, were watching the Boston Marathon from the sidelines. Then the bombs went off. Davis, a U.S. airman, had just returned from Afghanistan. \"We sat up and I said, 'Wait, my foot hurts.' And then he held ...","date":"2013-04-23T11:16:28Z"},{"title":"Judge Gives Anchin a Retrial in Patricia Cornwell Lawsuit","url":"http://www.accountingtoday.com/news/judge-gives-anchin-a-retrial-in-patricia-cornwell-lawsuit-70154-1.html","source":"Accounting Today","description":"A federal judge has dismissed several of the claims by best-selling crime novelist Patricia Cornwell and set aside a jury verdict last year that awarded her $50.9 million in a lawsuit against her former accounting firm, Anchin Block & Anchin LLP ...","date":"2014-03-27T09:36:16Z"},{"title":"Oops! Zooey Deschanel Captioned as Boston Marathon Bombing Suspect","url":"http://tv.yahoo.com/news/oops-zooey-deschanel-captioned-boston-marathon-bombing-suspect-150300754.html","source":"YAHOO!","description":"Who's that girl? It's ... the Boston Marathon bomber? During the intense lockdown and manhunt for the Boston Marathon bombing suspects Friday, a local Fox affiliate in Dallas, Texas misidentified one of the suspects as none other than New Girl ...","date":"2013-04-21T15:15:04Z"},{"title":"Judge sets November trial in marathon bombing","url":"http://www.pressherald.com/news/Trial_date_to_be_decided_in_Boston_Marathon_bombing_case_.html","source":"Press Herald","description":"BOSTON – Boston Marathon bombing suspect Dzhokhar Tsarnaev was given a November trial date over the strenuous objections of his attorneys, who said Wednesday that they won’t have enough time to mount a defense in a terrorism case that carries a ...","date":"2014-02-12T15:13:35Z"},{"title":"Boston Marathon bombing kills 3, injures over 140","url":"http://www.wkrn.com/story/21982498/2-explosions-at-boston-marathon-finish-line","source":"WKRN","description":"BOSTON (AP) - Two bombs exploded in the crowded streets near the finish line of the Boston Marathon on Monday, killing at least three people and injuring more than 140 in a bloody scene of shattered glass and severed limbs that raised alarms that ...","date":"2013-05-15T20:01:34Z"},{"title":"Adidas Unveils ‘Boston Stands as One’ T-Shirt to Benefit Marathon Bombing Victims","url":"http://fashionista.com/2013/04/adidas-unveils-boston-stands-as-one-t-shirt-to-benefit-marathon-bombing-victims/","source":"Fashionista","description":"All eyes are on Boston this morning. While we wait for the news to unfold, our hearts and prayers with the Boston people, one retailer is doing its part to help the victims from Monday’s blast. Adidas yesterday unveiled a limited edition t-shirt in ...","date":"2013-04-19T20:32:24Z"},{"title":"Couple Injured By Boston Marathon Bombing To Have Dream Wedding","url":"http://www.myfoxphilly.com/story/24480294/couple-injured-by-boston-marathon-bombing-to-have-dream-wedding","source":"MyFox Philadelphia","description":"A young couple still recovering from injuries that they suffered in the Boston Marathon Bombings is getting married. Better yet, a popular wedding planning website is paying for the whole celebration. The couple, Rebekah Gregory and Pete DiMartino, was at ...","date":"2014-01-31T13:26:08Z"},{"title":"House Appropriations Subcommittee on Homeland Security Hearing","url":"http://insurancenewsnet.com/oarticle/2014/03/27/house-appropriations-subcommittee-on-homeland-security-hearing-a-480708.html","source":"Insurance News Net","description":"Examples include: * Funds used to purchase Forward Looking Infrared Imaging for Massachusetts State Police that assisted in the capture of the Boston Marathon bombing suspect, as well as FEMA preparedness funding for full-scale, regional ...","date":"2014-03-27T17:43:01Z"},{"title":"How Reddit Became A Hub Of The Crowdsourced Boston Marathon Bombing Investigation","url":"http://www.fastcompany.com/3008466/tech-forecast/how-reddit-became-hub-crowdsourced-boston-marathon-bombing-investigation","source":"Fast Company","description":"Reddit's users launched a new subreddit, Findbostonbombers, where hundreds of amateur sleuths are crowdsourcing clues and suspects in the Boston terrorist attack. In the meantime, even the FBI is embracing crowdsourcing of sorts: The law enforcement agency ...","date":"2013-04-17T17:00:01Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"Explosions at Boston Marathon","url":"http://stream.marketwatch.com/story/explosions-at-boston-marathon/SS-4-27786/","source":"stream.marketwatch.com","description":"Tamerlan Tsarnaev, 26, and brother Dzhokhar A. Tsarnaev, 19, are the prime suspects in the Boston Marathon bombings that resulted in the death of three people and injuries to more than 200 people in April. Tamerlan (left) was killed in a confrontation ...","date":"2013-05-28T23:56:41Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"A Military Plot to Take Over America: Fifty Years Later, Was the Mission Accomplished?","url":"http://www.gilmermirror.com/view/full_story/24831343/article-A-Military-Plot-to-Take-Over-America--Fifty-Years-Later--Was-the-Mission-Accomplished-","source":"Gilmer Mirror","description":"Curiously enough, as the Boston Globe reported, the exercise, planned months in advance and dubbed “Operation Urban Shield” “has eerie similarities to the police investigation that led to the capture of the alleged Boston Marathon bombers.”","date":"2014-03-27T17:07:14Z"},{"title":"Adidas Unveils ‘Boston Stands as One’ T-Shirt to Benefit Marathon Bombing Victims","url":"http://fashionista.com/2013/04/adidas-unveils-boston-stands-as-one-t-shirt-to-benefit-marathon-bombing-victims/","source":"Fashionista","description":"All eyes are on Boston this morning. While we wait for the news to unfold, our hearts and prayers with the Boston people, one retailer is doing its part to help the victims from Monday’s blast. Adidas yesterday unveiled a limited edition t-shirt in ...","date":"2013-04-19T20:32:24Z"},{"title":"Couple Injured By Boston Marathon Bombing To Have Dream Wedding","url":"http://www.myfoxphilly.com/story/24480294/couple-injured-by-boston-marathon-bombing-to-have-dream-wedding","source":"MyFox Philadelphia","description":"A young couple still recovering from injuries that they suffered in the Boston Marathon Bombings is getting married. Better yet, a popular wedding planning website is paying for the whole celebration. The couple, Rebekah Gregory and Pete DiMartino, was at ...","date":"2014-01-31T13:26:08Z"},{"title":"House Appropriations Subcommittee on Homeland Security Hearing","url":"http://insurancenewsnet.com/oarticle/2014/03/27/house-appropriations-subcommittee-on-homeland-security-hearing-a-480708.html","source":"Insurance News Net","description":"Examples include: * Funds used to purchase Forward Looking Infrared Imaging for Massachusetts State Police that assisted in the capture of the Boston Marathon bombing suspect, as well as FEMA preparedness funding for full-scale, regional ...","date":"2014-03-27T17:43:01Z"},{"title":"How Reddit Became A Hub Of The Crowdsourced Boston Marathon Bombing Investigation","url":"http://www.fastcompany.com/3008466/tech-forecast/how-reddit-became-hub-crowdsourced-boston-marathon-bombing-investigation","source":"Fast Company","description":"Reddit's users launched a new subreddit, Findbostonbombers, where hundreds of amateur sleuths are crowdsourcing clues and suspects in the Boston terrorist attack. In the meantime, even the FBI is embracing crowdsourcing of sorts: The law enforcement agency ...","date":"2013-04-17T17:00:01Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"Explosions at Boston Marathon","url":"http://stream.marketwatch.com/story/explosions-at-boston-marathon/SS-4-27786/","source":"stream.marketwatch.com","description":"Tamerlan Tsarnaev, 26, and brother Dzhokhar A. Tsarnaev, 19, are the prime suspects in the Boston Marathon bombings that resulted in the death of three people and injuries to more than 200 people in April. Tamerlan (left) was killed in a confrontation ...","date":"2013-05-28T23:56:41Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"A Military Plot to Take Over America: Fifty Years Later, Was the Mission Accomplished?","url":"http://www.gilmermirror.com/view/full_story/24831343/article-A-Military-Plot-to-Take-Over-America--Fifty-Years-Later--Was-the-Mission-Accomplished-","source":"Gilmer Mirror","description":"Curiously enough, as the Boston Globe reported, the exercise, planned months in advance and dubbed “Operation Urban Shield” “has eerie similarities to the police investigation that led to the capture of the alleged Boston Marathon bombers.”","date":"2014-03-27T17:07:14Z"},{"title":"Crimea: World’s crisis, Obama’s nightmare","url":"http://indepthafrica.com/crimea-worlds-crisis-obamas-nightmare/","source":"Indepth Africa","description":"Similarly, the president drew wide support for the death of Osama bin Laden and the clear lack of any substantive terror attacks in the US during the Obama presidency, save for that fatal incident at the Boston Marathon ... U.S. began a bombing campaign ...","date":"2014-03-27T22:43:40Z"},{"title":"Bombings in Boston: What Did the Cameras See?","url":"http://www.popularmechanics.com/how-to/blog/bombings-in-boston-what-did-the-cameras-see-15352764","source":"Popular Mechanics","description":"Photo by Mario Tama/Getty Images. Security cameras will likely hold the key to unraveling the bomb attacks in Boston, experts say. Often lambasted as failing to deter crime, security cameras certainly come in handy during the investigation.","date":"2013-04-15T23:00:18Z"},{"title":"Terror in Boston: Boston Marathon Explosions","url":"http://www.nbcbayarea.com/news/national-international/Boston-Marathon-Explosions-203079401.html","source":"NBC Bay Area","description":"Boston prosecutors plan to tell Attorney General Eric Holder this week whether they want him to seek the death penalty for the 20-year-old when he goes on trial next year, they said at a status hearing Tuesday.","date":"2013-07-23T23:54:42Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"Explosions at Boston Marathon","url":"http://stream.marketwatch.com/story/explosions-at-boston-marathon/SS-4-27786/","source":"stream.marketwatch.com","description":"Tamerlan Tsarnaev, 26, and brother Dzhokhar A. Tsarnaev, 19, are the prime suspects in the Boston Marathon bombings that resulted in the death of three people and injuries to more than 200 people in April. Tamerlan (left) was killed in a confrontation ...","date":"2013-05-28T23:56:41Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"A Military Plot to Take Over America: Fifty Years Later, Was the Mission Accomplished?","url":"http://www.gilmermirror.com/view/full_story/24831343/article-A-Military-Plot-to-Take-Over-America--Fifty-Years-Later--Was-the-Mission-Accomplished-","source":"Gilmer Mirror","description":"“I’m suggesting Mr. President, there’s a military plot to take over the Government of these ... Kennedy, Martin Luther King Jr. and John Lennon come about, who not only dare to challenge you by championing peace over war, but actually ...","date":"2014-03-27T17:07:14Z"},{"title":"Crimea: World’s crisis, Obama’s nightmare","url":"http://indepthafrica.com/crimea-worlds-crisis-obamas-nightmare/","source":"Indepth Africa","description":"There is the story of the French general sitting at a sidewalk café with some friends, quaffing a glass of Pernod, an absinthe maybe, or perhaps a snifter of cognac. He looks across the street and he sees a large crowd rushing past, waving banners and ...","date":"2014-03-27T22:43:40Z"},{"title":"Bombings in Boston: What Did the Cameras See?","url":"http://www.popularmechanics.com/how-to/blog/bombings-in-boston-what-did-the-cameras-see-15352764","source":"Popular Mechanics","description":"Photo by Mario Tama/Getty Images. Security cameras will likely hold the key to unraveling the bomb attacks in Boston, experts say. Often lambasted as failing to deter crime, security cameras certainly come in handy during the investigation.","date":"2013-04-15T23:00:18Z"},{"title":"Terror in Boston: Boston Marathon Explosions","url":"http://www.nbcbayarea.com/news/national-international/Boston-Marathon-Explosions-203079401.html","source":"NBC Bay Area","description":"Boston prosecutors plan to tell Attorney General Eric Holder this week whether they want him to seek the death penalty for the 20-year-old when he goes on trial next year, they said at a status hearing Tuesday.","date":"2013-07-23T23:54:42Z"},{"title":"Judge sets November trial in marathon bombing","url":"http://www.pressherald.com/news/Trial_date_to_be_decided_in_Boston_Marathon_bombing_case_.html","source":"Press Herald","description":"BOSTON – Boston Marathon bombing suspect Dzhokhar Tsarnaev was given a November trial date over the strenuous objections of his attorneys, who said Wednesday that they won’t have enough time to mount a defense in a terrorism case that carries a ...","date":"2014-02-12T15:13:35Z"},{"title":"Boston Marathon bombing kills 3, injures over 140","url":"http://www.wkrn.com/story/21982498/2-explosions-at-boston-marathon-finish-line","source":"WKRN","description":"BOSTON (AP) - Two bombs exploded in the crowded streets near the finish line of the Boston Marathon on Monday, killing at least three people and injuring more than 140 in a bloody scene of shattered glass and severed limbs that raised alarms that ...","date":"2013-05-15T20:01:34Z"},{"title":"Adidas Unveils ‘Boston Stands as One’ T-Shirt to Benefit Marathon Bombing Victims","url":"http://fashionista.com/2013/04/adidas-unveils-boston-stands-as-one-t-shirt-to-benefit-marathon-bombing-victims/","source":"Fashionista","description":"All eyes are on Boston this morning. While we wait for the news to unfold, our hearts and prayers with the Boston people, one retailer is doing its part to help the victims from Monday’s blast. Adidas yesterday unveiled a limited edition t-shirt in ...","date":"2013-04-19T20:32:24Z"},{"title":"Couple Injured By Boston Marathon Bombing To Have Dream Wedding","url":"http://www.myfoxphilly.com/story/24480294/couple-injured-by-boston-marathon-bombing-to-have-dream-wedding","source":"MyFox Philadelphia","description":"A young couple still recovering from injuries that they suffered in the Boston Marathon Bombings is getting married. Better yet, a popular wedding planning website is paying for the whole celebration. The couple, Rebekah Gregory and Pete DiMartino, was at ...","date":"2014-01-31T13:26:08Z"},{"title":"House Appropriations Subcommittee on Homeland Security Hearing","url":"http://insurancenewsnet.com/oarticle/2014/03/27/house-appropriations-subcommittee-on-homeland-security-hearing-a-480708.html","source":"Insurance News Net","description":"The law requires changes to all of the major components of the ... States and the international community - from government partners to non-profits, businesses and individuals - to build an emergency management community that is coalesced ...","date":"2014-03-27T17:43:01Z"},{"title":"How Reddit Became A Hub Of The Crowdsourced Boston Marathon Bombing Investigation","url":"http://www.fastcompany.com/3008466/tech-forecast/how-reddit-became-hub-crowdsourced-boston-marathon-bombing-investigation","source":"Fast Company","description":"Reddit's users launched a new subreddit, Findbostonbombers, where hundreds of amateur sleuths are crowdsourcing clues and suspects in the Boston terrorist attack. In the meantime, even the FBI is embracing crowdsourcing of sorts: The law enforcement agency ...","date":"2013-04-17T17:00:01Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"Explosions at Boston Marathon","url":"http://stream.marketwatch.com/story/explosions-at-boston-marathon/SS-4-27786/","source":"stream.marketwatch.com","description":"Tamerlan Tsarnaev, 26, and brother Dzhokhar A. Tsarnaev, 19, are the prime suspects in the Boston Marathon bombings that resulted in the death of three people and injuries to more than 200 people in April. Tamerlan (left) was killed in a confrontation ...","date":"2013-05-28T23:56:41Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"A Military Plot to Take Over America: Fifty Years Later, Was the Mission Accomplished?","url":"http://www.gilmermirror.com/view/full_story/24831343/article-A-Military-Plot-to-Take-Over-America--Fifty-Years-Later--Was-the-Mission-Accomplished-","source":"Gilmer Mirror","description":"“I’m suggesting Mr. President, there’s a military plot to take over the Government of these ... Kennedy, Martin Luther King Jr. and John Lennon come about, who not only dare to challenge you by championing peace over war, but actually ...","date":"2014-03-27T17:07:14Z"},{"title":"Crimea: World’s crisis, Obama’s nightmare","url":"http://indepthafrica.com/crimea-worlds-crisis-obamas-nightmare/","source":"Indepth Africa","description":"There is the story of the French general sitting at a sidewalk café with some friends, quaffing a glass of Pernod, an absinthe maybe, or perhaps a snifter of cognac. He looks across the street and he sees a large crowd rushing past, waving banners and ...","date":"2014-03-27T22:43:40Z"},{"title":"Bombings in Boston: What Did the Cameras See?","url":"http://www.popularmechanics.com/how-to/blog/bombings-in-boston-what-did-the-cameras-see-15352764","source":"Popular Mechanics","description":"Photo by Mario Tama/Getty Images. Security cameras will likely hold the key to unraveling the bomb attacks in Boston, experts say. Often lambasted as failing to deter crime, security cameras certainly come in handy during the investigation.","date":"2013-04-15T23:00:18Z"},{"title":"Terror in Boston: Boston Marathon Explosions","url":"http://www.nbcbayarea.com/news/national-international/Boston-Marathon-Explosions-203079401.html","source":"NBC Bay Area","description":"Boston prosecutors plan to tell Attorney General Eric Holder this week whether they want him to seek the death penalty for the 20-year-old when he goes on trial next year, they said at a status hearing Tuesday.","date":"2013-07-23T23:54:42Z"},{"title":"Judge sets November trial in marathon bombing","url":"http://www.pressherald.com/news/Trial_date_to_be_decided_in_Boston_Marathon_bombing_case_.html","source":"Press Herald","description":"BOSTON – Boston Marathon bombing suspect Dzhokhar Tsarnaev was given a November trial date over the strenuous objections of his attorneys, who said Wednesday that they won’t have enough time to mount a defense in a terrorism case that carries a ...","date":"2014-02-12T15:13:35Z"},{"title":"Boston Marathon bombing kills 3, injures over 140","url":"http://www.wkrn.com/story/21982498/2-explosions-at-boston-marathon-finish-line","source":"WKRN","description":"BOSTON (AP) - Two bombs exploded in the crowded streets near the finish line of the Boston Marathon on Monday, killing at least three people and injuring more than 140 in a bloody scene of shattered glass and severed limbs that raised alarms that ...","date":"2013-05-15T20:01:34Z"},{"title":"Adidas Unveils ‘Boston Stands as One’ T-Shirt to Benefit Marathon Bombing Victims","url":"http://fashionista.com/2013/04/adidas-unveils-boston-stands-as-one-t-shirt-to-benefit-marathon-bombing-victims/","source":"Fashionista","description":"All eyes are on Boston this morning. While we wait for the news to unfold, our hearts and prayers with the Boston people, one retailer is doing its part to help the victims from Monday’s blast. Adidas yesterday unveiled a limited edition t-shirt in ...","date":"2013-04-19T20:32:24Z"},{"title":"Couple Injured By Boston Marathon Bombing To Have Dream Wedding","url":"http://www.myfoxphilly.com/story/24480294/couple-injured-by-boston-marathon-bombing-to-have-dream-wedding","source":"MyFox Philadelphia","description":"A young couple still recovering from injuries that they suffered in the Boston Marathon Bombings is getting married. Better yet, a popular wedding planning website is paying for the whole celebration. The couple, Rebekah Gregory and Pete DiMartino, was at ...","date":"2014-01-31T13:26:08Z"},{"title":"House Appropriations Subcommittee on Homeland Security Hearing","url":"http://insurancenewsnet.com/oarticle/2014/03/27/house-appropriations-subcommittee-on-homeland-security-hearing-a-480708.html","source":"Insurance News Net","description":"The law requires changes to all of the major components of the ... States and the international community - from government partners to non-profits, businesses and individuals - to build an emergency management community that is coalesced ...","date":"2014-03-27T17:43:01Z"},{"title":"How Reddit Became A Hub Of The Crowdsourced Boston Marathon Bombing Investigation","url":"http://www.fastcompany.com/3008466/tech-forecast/how-reddit-became-hub-crowdsourced-boston-marathon-bombing-investigation","source":"Fast Company","description":"Reddit's users launched a new subreddit, Findbostonbombers, where hundreds of amateur sleuths are crowdsourcing clues and suspects in the Boston terrorist attack. In the meantime, even the FBI is embracing crowdsourcing of sorts: The law enforcement agency ...","date":"2013-04-17T17:00:01Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"Explosions at Boston Marathon","url":"http://stream.marketwatch.com/story/explosions-at-boston-marathon/SS-4-27786/","source":"stream.marketwatch.com","description":"Tamerlan Tsarnaev, 26, and brother Dzhokhar A. Tsarnaev, 19, are the prime suspects in the Boston Marathon bombings that resulted in the death of three people and injuries to more than 200 people in April. Tamerlan (left) was killed in a confrontation ...","date":"2013-05-28T23:56:41Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"A Military Plot to Take Over America: Fifty Years Later, Was the Mission Accomplished?","url":"http://www.gilmermirror.com/view/full_story/24831343/article-A-Military-Plot-to-Take-Over-America--Fifty-Years-Later--Was-the-Mission-Accomplished-","source":"Gilmer Mirror","description":"“I’m suggesting Mr. President, there’s a military plot to take over the Government of these ... Kennedy, Martin Luther King Jr. and John Lennon come about, who not only dare to challenge you by championing peace over war, but actually ...","date":"2014-03-27T17:07:14Z"},{"title":"Crimea: World’s crisis, Obama’s nightmare","url":"http://indepthafrica.com/crimea-worlds-crisis-obamas-nightmare/","source":"Indepth Africa","description":"There is the story of the French general sitting at a sidewalk café with some friends, quaffing a glass of Pernod, an absinthe maybe, or perhaps a snifter of cognac. He looks across the street and he sees a large crowd rushing past, waving banners and ...","date":"2014-03-27T22:43:40Z"},{"title":"Bombings in Boston: What Did the Cameras See?","url":"http://www.popularmechanics.com/how-to/blog/bombings-in-boston-what-did-the-cameras-see-15352764","source":"Popular Mechanics","description":"Photo by Mario Tama/Getty Images. Security cameras will likely hold the key to unraveling the bomb attacks in Boston, experts say. Often lambasted as failing to deter crime, security cameras certainly come in handy during the investigation.","date":"2013-04-15T23:00:18Z"},{"title":"Terror in Boston: Boston Marathon Explosions","url":"http://www.nbcbayarea.com/news/national-international/Boston-Marathon-Explosions-203079401.html","source":"NBC Bay Area","description":"Boston prosecutors plan to tell Attorney General Eric Holder this week whether they want him to seek the death penalty for the 20-year-old when he goes on trial next year, they said at a status hearing Tuesday.","date":"2013-07-23T23:54:42Z"},{"title":"House Appropriations Subcommittee on Homeland Security Hearing","url":"http://insurancenewsnet.com/oarticle/2014/03/27/house-appropriations-subcommittee-on-homeland-security-hearing-a-480708.html","source":"Insurance News Net","description":"The law requires changes to all of the major components of the ... States and the international community - from government partners to non-profits, businesses and individuals - to build an emergency management community that is coalesced ...","date":"2014-03-27T17:43:01Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"Explosions at Boston Marathon","url":"http://stream.marketwatch.com/story/explosions-at-boston-marathon/SS-4-27786/","source":"stream.marketwatch.com","description":"Tamerlan Tsarnaev, 26, and brother Dzhokhar A. Tsarnaev, 19, are the prime suspects in the Boston Marathon bombings that resulted in the death of three people and injuries to more than 200 people in April. Tamerlan (left) was killed in a confrontation ...","date":"2013-05-28T23:56:41Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"A Military Plot to Take Over America: Fifty Years Later, Was the Mission Accomplished?","url":"http://www.gilmermirror.com/view/full_story/24831343/article-A-Military-Plot-to-Take-Over-America--Fifty-Years-Later--Was-the-Mission-Accomplished-","source":"Gilmer Mirror","description":"“I’m suggesting Mr. President, there’s a military plot to take over the Government of these ... Kennedy, Martin Luther King Jr. and John Lennon come about, who not only dare to challenge you by championing peace over war, but actually ...","date":"2014-03-27T17:07:14Z"},{"title":"Crimea: World’s crisis, Obama’s nightmare","url":"http://indepthafrica.com/crimea-worlds-crisis-obamas-nightmare/","source":"Indepth Africa","description":"There is the story of the French general sitting at a sidewalk café with some friends, quaffing a glass of Pernod, an absinthe maybe, or perhaps a snifter of cognac. He looks across the street and he sees a large crowd rushing past, waving banners and ...","date":"2014-03-27T22:43:40Z"},{"title":"Bombings in Boston: What Did the Cameras See?","url":"http://www.popularmechanics.com/how-to/blog/bombings-in-boston-what-did-the-cameras-see-15352764","source":"Popular Mechanics","description":"Photo by Mario Tama/Getty Images. Security cameras will likely hold the key to unraveling the bomb attacks in Boston, experts say. Often lambasted as failing to deter crime, security cameras certainly come in handy during the investigation.","date":"2013-04-15T23:00:18Z"},{"title":"Terror in Boston: Boston Marathon Explosions","url":"http://www.nbcbayarea.com/news/national-international/Boston-Marathon-Explosions-203079401.html","source":"NBC Bay Area","description":"Boston prosecutors plan to tell Attorney General Eric Holder this week whether they want him to seek the death penalty for the 20-year-old when he goes on trial next year, they said at a status hearing Tuesday.","date":"2013-07-23T23:54:42Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"Explosions at Boston Marathon","url":"http://stream.marketwatch.com/story/explosions-at-boston-marathon/SS-4-27786/","source":"stream.marketwatch.com","description":"Tamerlan Tsarnaev, 26, and brother Dzhokhar A. Tsarnaev, 19, are the prime suspects in the Boston Marathon bombings that resulted in the death of three people and injuries to more than 200 people in April. Tamerlan (left) was killed in a confrontation ...","date":"2013-05-28T23:56:41Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"A Military Plot to Take Over America: Fifty Years Later, Was the Mission Accomplished?","url":"http://www.gilmermirror.com/view/full_story/24831343/article-A-Military-Plot-to-Take-Over-America--Fifty-Years-Later--Was-the-Mission-Accomplished-","source":"Gilmer Mirror","description":"“I’m suggesting Mr. President, there’s a military plot to take over the Government of these ... Kennedy, Martin Luther King Jr. and John Lennon come about, who not only dare to challenge you by championing peace over war, but actually ...","date":"2014-03-27T17:07:14Z"},{"title":"Crimea: World’s crisis, Obama’s nightmare","url":"http://indepthafrica.com/crimea-worlds-crisis-obamas-nightmare/","source":"Indepth Africa","description":"There is the story of the French general sitting at a sidewalk café with some friends, quaffing a glass of Pernod, an absinthe maybe, or perhaps a snifter of cognac. He looks across the street and he sees a large crowd rushing past, waving banners and ...","date":"2014-03-27T22:43:40Z"},{"title":"Bombings in Boston: What Did the Cameras See?","url":"http://www.popularmechanics.com/how-to/blog/bombings-in-boston-what-did-the-cameras-see-15352764","source":"Popular Mechanics","description":"Photo by Mario Tama/Getty Images. Security cameras will likely hold the key to unraveling the bomb attacks in Boston, experts say. Often lambasted as failing to deter crime, security cameras certainly come in handy during the investigation.","date":"2013-04-15T23:00:18Z"},{"title":"Terror in Boston: Boston Marathon Explosions","url":"http://www.nbcbayarea.com/news/national-international/Boston-Marathon-Explosions-203079401.html","source":"NBC Bay Area","description":"Boston prosecutors plan to tell Attorney General Eric Holder this week whether they want him to seek the death penalty for the 20-year-old when he goes on trial next year, they said at a status hearing Tuesday.","date":"2013-07-23T23:54:42Z"},{"title":"Judge sets November trial in marathon bombing","url":"http://www.pressherald.com/news/Trial_date_to_be_decided_in_Boston_Marathon_bombing_case_.html","source":"Press Herald","description":"BOSTON – Boston Marathon bombing suspect Dzhokhar Tsarnaev was given a November trial date over the strenuous objections of his attorneys, who said Wednesday that they won’t have enough time to mount a defense in a terrorism case that carries a ...","date":"2014-02-12T15:13:35Z"},{"title":"Boston Marathon bombing kills 3, injures over 140","url":"http://www.wkrn.com/story/21982498/2-explosions-at-boston-marathon-finish-line","source":"WKRN","description":"BOSTON (AP) - Two bombs exploded in the crowded streets near the finish line of the Boston Marathon on Monday, killing at least three people and injuring more than 140 in a bloody scene of shattered glass and severed limbs that raised alarms that ...","date":"2013-05-15T20:01:34Z"},{"title":"Adidas Unveils ‘Boston Stands as One’ T-Shirt to Benefit Marathon Bombing Victims","url":"http://fashionista.com/2013/04/adidas-unveils-boston-stands-as-one-t-shirt-to-benefit-marathon-bombing-victims/","source":"Fashionista","description":"All eyes are on Boston this morning. While we wait for the news to unfold, our hearts and prayers with the Boston people, one retailer is doing its part to help the victims from Monday’s blast. Adidas yesterday unveiled a limited edition t-shirt in ...","date":"2013-04-19T20:32:24Z"},{"title":"Couple Injured By Boston Marathon Bombing To Have Dream Wedding","url":"http://www.myfoxphilly.com/story/24480294/couple-injured-by-boston-marathon-bombing-to-have-dream-wedding","source":"MyFox Philadelphia","description":"A young couple still recovering from injuries that they suffered in the Boston Marathon Bombings is getting married. Better yet, a popular wedding planning website is paying for the whole celebration. The couple, Rebekah Gregory and Pete DiMartino, was at ...","date":"2014-01-31T13:26:08Z"},{"title":"House Appropriations Subcommittee on Homeland Security Hearing","url":"http://insurancenewsnet.com/oarticle/2014/03/27/house-appropriations-subcommittee-on-homeland-security-hearing-a-480708.html","source":"Insurance News Net","description":"The law requires changes to all of the major components of the ... States and the international community - from government partners to non-profits, businesses and individuals - to build an emergency management community that is coalesced ...","date":"2014-03-27T17:43:01Z"},{"title":"How Reddit Became A Hub Of The Crowdsourced Boston Marathon Bombing Investigation","url":"http://www.fastcompany.com/3008466/tech-forecast/how-reddit-became-hub-crowdsourced-boston-marathon-bombing-investigation","source":"Fast Company","description":"Reddit's users launched a new subreddit, Findbostonbombers, where hundreds of amateur sleuths are crowdsourcing clues and suspects in the Boston terrorist attack. In the meantime, even the FBI is embracing crowdsourcing of sorts: The law enforcement agency ...","date":"2013-04-17T17:00:01Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"Explosions at Boston Marathon","url":"http://stream.marketwatch.com/story/explosions-at-boston-marathon/SS-4-27786/","source":"stream.marketwatch.com","description":"Tamerlan Tsarnaev, 26, and brother Dzhokhar A. Tsarnaev, 19, are the prime suspects in the Boston Marathon bombings that resulted in the death of three people and injuries to more than 200 people in April. Tamerlan (left) was killed in a confrontation ...","date":"2013-05-28T23:56:41Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"A Military Plot to Take Over America: Fifty Years Later, Was the Mission Accomplished?","url":"http://www.gilmermirror.com/view/full_story/24831343/article-A-Military-Plot-to-Take-Over-America--Fifty-Years-Later--Was-the-Mission-Accomplished-","source":"Gilmer Mirror","description":"“I’m suggesting Mr. President, there’s a military plot to take over the Government of these ... Kennedy, Martin Luther King Jr. and John Lennon come about, who not only dare to challenge you by championing peace over war, but actually ...","date":"2014-03-27T17:07:14Z"},{"title":"Crimea: World’s crisis, Obama’s nightmare","url":"http://indepthafrica.com/crimea-worlds-crisis-obamas-nightmare/","source":"Indepth Africa","description":"There is the story of the French general sitting at a sidewalk café with some friends, quaffing a glass of Pernod, an absinthe maybe, or perhaps a snifter of cognac. He looks across the street and he sees a large crowd rushing past, waving banners and ...","date":"2014-03-27T22:43:40Z"},{"title":"Bombings in Boston: What Did the Cameras See?","url":"http://www.popularmechanics.com/how-to/blog/bombings-in-boston-what-did-the-cameras-see-15352764","source":"Popular Mechanics","description":"Photo by Mario Tama/Getty Images. Security cameras will likely hold the key to unraveling the bomb attacks in Boston, experts say. Often lambasted as failing to deter crime, security cameras certainly come in handy during the investigation.","date":"2013-04-15T23:00:18Z"},{"title":"Terror in Boston: Boston Marathon Explosions","url":"http://www.nbcbayarea.com/news/national-international/Boston-Marathon-Explosions-203079401.html","source":"NBC Bay Area","description":"Boston prosecutors plan to tell Attorney General Eric Holder this week whether they want him to seek the death penalty for the 20-year-old when he goes on trial next year, they said at a status hearing Tuesday.","date":"2013-07-23T23:54:42Z"},{"title":"Adidas Unveils ‘Boston Stands as One’ T-Shirt to Benefit Marathon Bombing Victims","url":"http://fashionista.com/2013/04/adidas-unveils-boston-stands-as-one-t-shirt-to-benefit-marathon-bombing-victims/","source":"Fashionista","description":"All eyes are on Boston this morning. While we wait for the news to unfold, our hearts and prayers with the Boston people, one retailer is doing its part to help the victims from Monday’s blast. Adidas yesterday unveiled a limited edition t-shirt in ...","date":"2013-04-19T20:32:24Z"},{"title":"Couple Injured By Boston Marathon Bombing To Have Dream Wedding","url":"http://www.myfoxphilly.com/story/24480294/couple-injured-by-boston-marathon-bombing-to-have-dream-wedding","source":"MyFox Philadelphia","description":"A young couple still recovering from injuries that they suffered in the Boston Marathon Bombings is getting married. Better yet, a popular wedding planning website is paying for the whole celebration. The couple, Rebekah Gregory and Pete DiMartino, was at ...","date":"2014-01-31T13:26:08Z"},{"title":"House Appropriations Subcommittee on Homeland Security Hearing","url":"http://insurancenewsnet.com/oarticle/2014/03/27/house-appropriations-subcommittee-on-homeland-security-hearing-a-480708.html","source":"Insurance News Net","description":"Examples include: * Funds used to purchase Forward Looking Infrared Imaging for Massachusetts State Police that assisted in the capture of the Boston Marathon bombing suspect, as well as FEMA preparedness funding for full-scale, regional ...","date":"2014-03-27T17:43:01Z"},{"title":"How Reddit Became A Hub Of The Crowdsourced Boston Marathon Bombing Investigation","url":"http://www.fastcompany.com/3008466/tech-forecast/how-reddit-became-hub-crowdsourced-boston-marathon-bombing-investigation","source":"Fast Company","description":"Reddit's users launched a new subreddit, Findbostonbombers, where hundreds of amateur sleuths are crowdsourcing clues and suspects in the Boston terrorist attack. In the meantime, even the FBI is embracing crowdsourcing of sorts: The law enforcement agency ...","date":"2013-04-17T17:00:01Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"Explosions at Boston Marathon","url":"http://stream.marketwatch.com/story/explosions-at-boston-marathon/SS-4-27786/","source":"stream.marketwatch.com","description":"Tamerlan Tsarnaev, 26, and brother Dzhokhar A. Tsarnaev, 19, are the prime suspects in the Boston Marathon bombings that resulted in the death of three people and injuries to more than 200 people in April. Tamerlan (left) was killed in a confrontation ...","date":"2013-05-28T23:56:41Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"A Military Plot to Take Over America: Fifty Years Later, Was the Mission Accomplished?","url":"http://www.gilmermirror.com/view/full_story/24831343/article-A-Military-Plot-to-Take-Over-America--Fifty-Years-Later--Was-the-Mission-Accomplished-","source":"Gilmer Mirror","description":"Curiously enough, as the Boston Globe reported, the exercise, planned months in advance and dubbed “Operation Urban Shield” “has eerie similarities to the police investigation that led to the capture of the alleged Boston Marathon bombers.”","date":"2014-03-27T17:07:14Z"},{"title":"Crimea: World’s crisis, Obama’s nightmare","url":"http://indepthafrica.com/crimea-worlds-crisis-obamas-nightmare/","source":"Indepth Africa","description":"Similarly, the president drew wide support for the death of Osama bin Laden and the clear lack of any substantive terror attacks in the US during the Obama presidency, save for that fatal incident at the Boston Marathon ... U.S. began a bombing campaign ...","date":"2014-03-27T22:43:40Z"},{"title":"Bombings in Boston: What Did the Cameras See?","url":"http://www.popularmechanics.com/how-to/blog/bombings-in-boston-what-did-the-cameras-see-15352764","source":"Popular Mechanics","description":"Photo by Mario Tama/Getty Images. Security cameras will likely hold the key to unraveling the bomb attacks in Boston, experts say. Often lambasted as failing to deter crime, security cameras certainly come in handy during the investigation.","date":"2013-04-15T23:00:18Z"},{"title":"Terror in Boston: Boston Marathon Explosions","url":"http://www.nbcbayarea.com/news/national-international/Boston-Marathon-Explosions-203079401.html","source":"NBC Bay Area","description":"Boston prosecutors plan to tell Attorney General Eric Holder this week whether they want him to seek the death penalty for the 20-year-old when he goes on trial next year, they said at a status hearing Tuesday.","date":"2013-07-23T23:54:42Z"},{"title":"House Appropriations Subcommittee on Homeland Security Hearing","url":"http://insurancenewsnet.com/oarticle/2014/03/27/house-appropriations-subcommittee-on-homeland-security-hearing-a-480708.html","source":"Insurance News Net","description":"The law requires changes to all of the major components of the ... States and the international community - from government partners to non-profits, businesses and individuals - to build an emergency management community that is coalesced ...","date":"2014-03-27T17:43:01Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"Explosions at Boston Marathon","url":"http://stream.marketwatch.com/story/explosions-at-boston-marathon/SS-4-27786/","source":"stream.marketwatch.com","description":"Tamerlan Tsarnaev, 26, and brother Dzhokhar A. Tsarnaev, 19, are the prime suspects in the Boston Marathon bombings that resulted in the death of three people and injuries to more than 200 people in April. Tamerlan (left) was killed in a confrontation ...","date":"2013-05-28T23:56:41Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"A Military Plot to Take Over America: Fifty Years Later, Was the Mission Accomplished?","url":"http://www.gilmermirror.com/view/full_story/24831343/article-A-Military-Plot-to-Take-Over-America--Fifty-Years-Later--Was-the-Mission-Accomplished-","source":"Gilmer Mirror","description":"“I’m suggesting Mr. President, there’s a military plot to take over the Government of these ... Kennedy, Martin Luther King Jr. and John Lennon come about, who not only dare to challenge you by championing peace over war, but actually ...","date":"2014-03-27T17:07:14Z"},{"title":"Crimea: World’s crisis, Obama’s nightmare","url":"http://indepthafrica.com/crimea-worlds-crisis-obamas-nightmare/","source":"Indepth Africa","description":"There is the story of the French general sitting at a sidewalk café with some friends, quaffing a glass of Pernod, an absinthe maybe, or perhaps a snifter of cognac. He looks across the street and he sees a large crowd rushing past, waving banners and ...","date":"2014-03-27T22:43:40Z"},{"title":"Bombings in Boston: What Did the Cameras See?","url":"http://www.popularmechanics.com/how-to/blog/bombings-in-boston-what-did-the-cameras-see-15352764","source":"Popular Mechanics","description":"Photo by Mario Tama/Getty Images. Security cameras will likely hold the key to unraveling the bomb attacks in Boston, experts say. Often lambasted as failing to deter crime, security cameras certainly come in handy during the investigation.","date":"2013-04-15T23:00:18Z"},{"title":"Terror in Boston: Boston Marathon Explosions","url":"http://www.nbcbayarea.com/news/national-international/Boston-Marathon-Explosions-203079401.html","source":"NBC Bay Area","description":"Boston prosecutors plan to tell Attorney General Eric Holder this week whether they want him to seek the death penalty for the 20-year-old when he goes on trial next year, they said at a status hearing Tuesday.","date":"2013-07-23T23:54:42Z"}]