{"boston marathon explosions":[{"title":"Boston Marathon bombing: Celebs react","url":"http://www.sheknows.com/entertainment/articles/991293/boston-marathon-bombing-celebs-react","source":"SheKnows","description":"Ellen DeGeneres: \"Let's all send our thoughts, our prayers and our energy to the people injured in Boston. My heart is with you.\" Chloë Grace Moretz: \"Horrific things happening in the world today. God bless those who have died and are injured.\" Patton ...","date":"2013-04-16T08:04:20Z"},{"title":"Pictures from the Boston Marathon Bombing","url":"http://www.newyorker.com/online/blogs/newsdesk/2013/04/slide-show-the-boston-marathon-bombing.html","source":"The New Yorker","description":"“This was a heinous and cowardly act, and given what we now know about what took place, the F.B.I. is investigating it as an act of terrorism,” President Obama said the morning after the Boston Marathon explosions. He also spoke of what the horror of ...","date":"2013-04-16T15:35:18Z"},{"title":"Boston Marathon Bomb Tragedy","url":"http://gonewengland.about.com/b/2013/04/17/boston-marathon-bomb-tragedy.htm","source":"gonewengland.about.com","description":"The Boston Marathon, a tradition since 1897 that takes place on the iconic Patriots Day holiday, was disrupted at 2:50 p.m. EDT Monday by two bomb explosions that left three dead and more than 170 injured. A third, apparently unrelated explosion ...","date":"2013-04-16T04:58:13Z"},{"title":"Images from the Boston Marathon bombing and aftermath","url":"http://blogs.sacbee.com/photos/2013/04/images-from-the-boston-maratho.html","source":"Sacramento Bee","description":"BOSTON (AP) - By Wednesday, two days after the bombing, investigators in white jumpsuits had fanned out across the streets, rooftops and awnings around the blast site in search of clues. They combed through debris amid the toppled orange sports drink ...","date":"2013-04-16T23:56:23Z"},{"title":"Boston Marathon bombings: How tech is helping","url":"http://venturebeat.com/2013/04/15/boston-marathon-bombings-how-tech-is-helping/","source":"Venturebeat.com","description":"Connect with leaders from the companies in this story, in real life: Come to the fourth annual VentureBeat Mobile Summit April 14-15 in Sausalito, Calif. Request an invitation. As everyone connected to the Internet knows by now, Boston has been the scene ...","date":"2013-04-15T22:03:02Z"}],"tsarnaev":[{"title":"Russia warned U.S. about Boston Marathon bomb suspect Tsarnaev - report","url":"http://in.reuters.com/article/2014/03/26/usa-explosions-boston-congress-idINDEEA2P02X20140326","source":"Reuters Group PLC","description":"Citing a congressional report it said could be released by the House of Representatives Homeland Security Committee as soon as Thursday, NBC News said the Russian intelligence agency FSB cabled the FBI about its concerns in March 2011, warning ...","date":"2014-03-26T03:32:22Z"},{"title":"Russia Warned US About Boston Marathon bombing suspect Tamerlan Tsarnaev Years Before Attack","url":"http://aol.com/article/2014/03/26/russia-warned-u-s-about-boston-bomber-years-before-attack/20857080/","source":"AOL","description":"WASHINGTON, March 25 (Reuters) - Russian authorities warned the FBI in 2011 about Tamerlan Tsarnaev, one of two Chechen brothers accused of carrying out last year's Boston Marathon bombings, but U.S. authorities missed chances to detain him, NBC ...","date":"2014-03-26T09:51:46Z"},{"title":"Boston Marathon bombing suspect Dzhokhar Tsarnaev arrested","url":"http://rt.com/usa/dzhokhar-tsarnaev-boston-apprehended-126/","source":"RT","description":"Boston Marathon bombing suspect Dzhokhar Tsarnaev has been arrested following an extensive manhunt that ended in the Boston suburb of Watertown. Law enforcement units from around the country were involved in the search. The crowd around the standoff scene ...","date":"2013-04-21T07:36:56Z"},{"title":"Boston Marathon Bomb Suspect’s Trial Date Set for Nov. 3","url":"http://www.bloomberg.com/news/2014-02-12/boston-marathon-bomb-suspect-s-trial-date-set-for-nov-3.html","source":"Bloomberg","description":"Dzhokhar Tsarnaev, the accused terrorist who faces a possible death sentence if he’s convicted of bombing last year’s Boston Marathon, will go to trial Nov. 3, almost a year earlier than his lawyers requested. U.S. District Judge George A.","date":"2014-02-12T14:30:38Z"},{"title":"Boston Marathon bombing suspect Dzhokhar Tsarnaev pleads not guilty","url":"http://dailyfreepress.com/2013/07/10/boston-marathon-bombing-suspect-dzhokhar-tsarnaev-pleads-not-guilty/","source":"Daily Free Press","description":"With his left arm in a cast, his face slightly swollen and wearing an orange prison jumpsuit, Dzhokhar Tsarnaev­ — the suspected Boston Marathon bomber — made his first public appearance at the U.S. District Court in South Boston on Wednesday and ...","date":"2013-07-11T02:04:39Z"}],"boston marathon bombings":[{"title":"Russia warned U.S. about Boston Marathon bomb suspect Tsarnaev - report","url":"http://in.reuters.com/article/2014/03/26/usa-explosions-boston-congress-idINDEEA2P02X20140326","source":"Reuters Group PLC","description":"Citing a congressional report it said could be released by the House of Representatives Homeland Security Committee as soon as Thursday, NBC News said the Russian intelligence agency FSB cabled the FBI about its concerns in March 2011, warning ...","date":"2014-03-26T03:32:22Z"},{"title":"Russia Warned US About Boston Marathon bombing suspect Tamerlan Tsarnaev Years Before Attack","url":"http://aol.com/article/2014/03/26/russia-warned-u-s-about-boston-bomber-years-before-attack/20857080/","source":"AOL","description":"WASHINGTON, March 25 (Reuters) - Russian authorities warned the FBI in 2011 about Tamerlan Tsarnaev, one of two Chechen brothers accused of carrying out last year's Boston Marathon bombings, but U.S. authorities missed chances to detain him, NBC ...","date":"2014-03-26T09:51:46Z"},{"title":"Victims killed in Boston Marathon bombings identified","url":"http://www.cbsnews.com/news/victims-killed-in-boston-marathon-bombings-identified/","source":"CBS News","description":"Krystle Campbell of Arlington, Mass., was among the three people killed in the Boston Marathon bombings, CBS News confirmed Tuesday afternoon. Campbell, 29, was a restaurant manager who was at the race with her best friend, her father William Campbell told ...","date":"2013-04-17T08:17:28Z"},{"title":"‘Boston Strong’ T-shirts raise nearly $1M","url":"http://bostonherald.com/business/business_markets/2014/03/boston_strong_t_shirts_raise_nearly_1m","source":"Boston Herald","description":"... Strong” are approaching $1 million in donations to The One Fund Boston. Senior Nick Reynolds and sophomore Chris Dobens have sold 65,111 blue and gold “Boston Strong” shirts, with $983,243 in net proceeds going to the nonprofit that aids victims ...","date":"2014-03-27T19:30:24Z"},{"title":"Death penalty sought for bombings","url":"http://espn.go.com/boston/story/_/id/10377199/federal-prosecutors-seek-death-penalty-boston-marathon-bombing","source":"ESPN","description":"... Thursday announced they will seek the death penalty against 20-year-old Dzhokhar Tsarnaev in the Boston Marathon bombing, accusing him of betraying his adopted country by ruthlessly carrying out a terrorist attack calculated to cause maximum ...","date":"2014-01-30T22:24:11Z"},{"title":"Boston Marathon Bombing: Congress reacts, Dems talk sequester","url":"http://www.politico.com/story/2013/04/boston-marathon-bombing-congress-reacts-90136.html","source":"POLITICO","description":"With the Boston Marathon bombings less than 24 hours old, some on Capitol Hill are beginning to say the attack shows why Congress should’ve stopped automatic spending cuts from taking hold in March. House Minority Whip Steny Hoyer (D-Md.), responding to ...","date":"2013-04-17T09:29:03Z"},{"title":"Boston Marathon bombings Rumor Control: Man on the roof, 'false flag,' American Airlines, Family Guy, JFK Library, more (Updated)","url":"http://www.scpr.org/blogs/news/2013/04/16/13322/boston-marathon-bombings-rumor-control-man-on-the/","source":"89.3 KPCC","description":"Medical responders run an injured man past the finish line the 2013 Boston Marathon following an explosion in Boston, Monday, April 15, 2013. Conspiracy theorists spread rumors that the man was an \"actor.\" In reality, the father of the man in the ...","date":"2013-04-16T23:56:23Z"},{"title":"President Obama Tells Boston to Keep Running After Marathon Bombings","url":"http://swampland.time.com/2013/04/18/president-obama-tells-boston-to-keep-running-after-marathon-bombings/","source":"Time","description":"Barack Obama did not come to Boston Thursday to remember, to mourn or to commemorate. He came to rally the city in an upbeat and uplifting speech about the inability of the marathon bombings to disrupt or destroy the spirit of the country.","date":"2013-04-17T23:55:12Z"},{"title":"FBI: No Suspect Has Been Arrested In Boston Marathon Bombing","url":"http://newsone.com/2391931/boston-marathon-explosion-suspect/","source":"News One","description":"UPDATE 4/17/13, 4:58 p.m.: The Boston Marathon press conference has been postponed due to the bomb scare that occurred at the courthouse this afternoon, according to the Huffington Post: A press briefing regarding the Boston Marathon investigation was ...","date":"2013-04-16T23:56:23Z"},{"title":"Boston Marathon Bombings: Twitter, Vine, and a Faster Terror","url":"http://www.thewrap.com/tv/column-post/boston-marathon-bombing-faster-terror-85891","source":"TheWrap","description":"We've come to a time when terrorism can be condensed to six hellishly hypnotic seconds. It became clear Monday that whoever carried out the Boston Marathon bombings did so — like the instigators of so many past terrorist attacks — with the intention of ...","date":"2013-04-16T04:08:07Z"},{"title":"Please Stop Talking About How Flinty and Resilient Boston Is","url":"http://www.slate.com/articles/life/culturebox/2013/04/boston_marathon_bombing_stop_talking_about_how_flinty_and_resilient_boston.html","source":"Slate","description":"Everyone processes tragedy in their own way. This is as it should be. Throughout much of the day on Monday, after news of the bombing at the Boston Marathon hit, I shook in fear as details emerged, suppressing the urge to break down into tears ...","date":"2013-04-15T23:57:34Z"},{"title":"Boston Marathon Bombing To Be Turned Into A Movie","url":"http://www.cinemablend.com/new/Boston-Marathon-Bombing-Turned-Movie-38411.html","source":"Cinema Blend","description":"It hasn't even been four months since the Boston Marathon bombings rocked the nation on April 15th, but already a movie adaptation is in the works. But before you cry out, \"Too soon,\" consider the pair behind the proposed docudrama. Paul Tamasy and Eric ...","date":"2013-07-08T22:17:57Z"},{"title":"The Boston Marathon Bombings and the Image of God","url":"http://www.charismanews.com/opinion/39133-the-boston-marathon-bombings-and-the-image-of-god","source":"charismanews.com","description":"People embrace during a candlelight service at Arlington Street Church in Boston on Tuesday that honored the victims of the Boston Marathon bombings. (Reuters/Shannon Stapleton) In light of the horrible tragedy at the Boston Marathon Monday, many pundits ...","date":"2013-04-17T19:23:11Z"},{"title":"Barack Obama praises Russian help on Boston Marathon bombing investigation","url":"http://www.ndtv.com/article/world/barack-obama-praises-russian-help-on-boston-marathon-bombing-investigation-361177","source":"NDTV","description":"Washington: President Barack Obama said Tuesday that the US and Russia are overcoming Cold War era suspicions to co-operate on the investigation of the Boston Marathon bombings as his top diplomat announced plans to travel to Russia. Obama acknowledged ...","date":"2013-05-01T03:43:10Z"},{"title":"Boston Marathon Bombings: How to Send Help (and Avoid Scams)","url":"http://business.time.com/2013/04/17/boston-marathon-bombings-how-to-help-and-avoid-scams/","source":"business.time.com","description":"It’s only human nature to want to help out victims of a disaster, but tragic events also bring scam artists out of the woodwork. In the aftermath of the Boston Marathon bombings, an outpouring of support has prompted numerous charitable ...","date":"2013-04-17T23:55:12Z"}],"boston marathon bombing":[{"title":"Friend of Boston Marathon bombing suspect threatened FBI agent, prosecutor says","url":"http://www.foxnews.com/us/2014/03/25/friend-boston-marathon-bombing-suspect-threatened-fbi-agent-prosecutor-says/","source":"FOX News","description":"A friend of one of the Boston marathon bombing suspects threatened ... State Attorney Jeff Ashton said in a report the agent was justified in shooting Ibragim Todashev, 27, last May. The officers were questioning Todashev about the 2011 slaying ...","date":"2014-03-25T14:46:26Z"},{"title":"FBI agent cleared in killing of friend of Boston bombing suspect","url":"http://www.latimes.com/nation/la-na-boston-marathon-todashev-20140326,0,2476666.story","source":"Los Angeles Times","description":"ORLANDO, Fla. — One of the lingering mysteries of the Boston Marathon bombing involves the grisly triple slaying that preceded it. On the night of Sept. 11, 2011, three men had their throats slashed in the quiet suburb of Waltham, Mass.","date":"2014-03-26T04:29:38Z"},{"title":"Boston Marathon bombing findings by House committee are boycotted by top Democrats","url":"http://www.boston.com/news/nation/2014/03/26/boston-marathon-bombing-findings-house-committee-are-boycotted-top-democrats/VWtdHR1iifg7lUst5YGEKJ/story.html","source":"Boston","description":"WASHINGTON — A bipartisan spirit of cooperation in Congress following last year’s Boston Marathon bombing dissolved into partisan rancor Wednesday, with all but one Democrat refusing to sign off on a House report documenting intelligence ...","date":"2014-03-27T02:26:46Z"},{"title":"Boston Marathon Bombing Double Amputee Expecting Child","url":"http://newsok.com/boston-marathon-bombing-double-amputee-expecting-child/article/3946853","source":"Oklahoma News","description":"Photo via Mashable.com Mashable reports Bauman, 28, and Erin Hurley, 27, told the Associated Press the baby is due July 18. The couple, who got engaged in February, have opted not to learn the baby's gender. Bauman was standing at the marathon's ...","date":"2014-03-26T11:39:08Z"},{"title":"Reports detail killing of bombing suspect's friend","url":"http://www.ajc.com/ap/ap/top-news/fla-prosecutor-releases-report-on-fbi-shooting/nfKrs/","source":"Atlanta Journal Constitution","description":"\"Abdul-Baki Todashev told The Associated Press in Russia. \"Who could believe this?\" Tsarnaev and his brother, Dzhokhar, have roots in the turbulent Russian regions of Dagestan and Chechnya, which have become recruiting grounds for Islamic extremists.","date":"2014-03-24T23:58:49Z"},{"title":"FBI Agents Cleared in Shooting Tied to Boston Marathon Probe","url":"http://online.wsj.com/news/articles/SB10001424052702304679404579461321388046830","source":"The Wall Street Journal","description":"A Florida man shot dead by a Federal Bureau of Investigation agent during the probe of last year's Boston Marathon bombing had written nearly a full page of a confession of his involvement in a triple murder when he suddenly attacked the agent ...","date":"2014-03-25T12:16:07Z"},{"title":"Boston Marathon bombing suspect remains hospitalized in 'serious condition,' unable to be questioned about motives","url":"http://www.nydailynews.com/news/national/boston-marathon-bombing-suspect-dzhokhar-tsarnaev-serious-condition-hospital-article-1.1322801","source":"New York Daily News","description":"The only who knows the motive in the Boston Marathon bombing still wasn’t speaking Saturday as federal authorities re-arrested two of his associates. Accused teen terrorist Dzhokhar Tsarnaev remained hospitalized and silent Saturday with a ...","date":"2013-04-20T16:34:59Z"},{"title":"Bombs at Boston Marathon fashioned out of pressure cookers","url":"http://sportsillustrated.cnn.com/more/news/20130416/boston-marathon-bombings-fbi-investigation.ap/","source":"CNN Sports Illustrated","description":"BOSTON (AP) Federal agents zeroed in Tuesday on how the Boston Marathon bombing was carried out - with kitchen pressure cookers packed with explosives, nails and other lethal shrapnel - but said they still didn't know who did it and why.","date":"2013-04-16T16:11:06Z"},{"title":"Boston Marathon bombing: Celebs react","url":"http://www.sheknows.com/entertainment/articles/991293/boston-marathon-bombing-celebs-react","source":"SheKnows","description":"Ellen DeGeneres: \"Let's all send our thoughts, our prayers and our energy to the people injured in Boston. My heart is with you.\" Chloë Grace Moretz: \"Horrific things happening in the world today. God bless those who have died and are injured.\" Patton ...","date":"2013-04-16T08:04:20Z"},{"title":"Developments in the Boston Marathon bombings probe","url":"http://www.newsday.com/news/nation/developments-in-the-boston-marathon-bombings-probe-1.5109774","source":"Newsday","description":"WILMINGTON, Mass. — A vigil has been held in Massachusetts for an MIT police officer authorities say was shot and killed by the alleged Boston Marathon bombers. Hundreds turned out Saturday night in Wilmington to honor 26-year-old Sean Collier ...","date":"2013-04-20T17:25:06Z"},{"title":"Russia Warned U.S. on Tsarnaev","url":"http://www.thedailybeast.com/cheats/2014/03/26/russian-warned-u-s-on-tsarnaev.html","source":"Daily Beast","description":"A soon-to-be-released congressional report says the Russian government had warned the U.S. that Tamerlan Tsarnaev was a radical Islamist a year and a half before the Boston Marathon bombing. However, Tsarnaev slipped through authorities’ hands ...","date":"2014-03-25T23:57:37Z"},{"title":"Your Guide To The Boston Marathon Bombing Amateur Internet Crowd-Sleuthing","url":"http://gawker.com/5994892/your-guide-to-the-boston-marathon-bombing-amateur-internet-crowd-sleuthing","source":"Gawker","description":"In the wake of the Boston Marathon bombing, people on the internet have taken to groundlessly speculating on the identity of the attacker or attackers based on photos and videos from the scene, a process known as \"procrastinating at work,\" or \"crowdsourcing.","date":"2013-04-17T17:28:39Z"},{"title":"The Boston Marathon Bombings","url":"http://onpoint.wbur.org/2013/04/16/the-boston-marathon-bombing","source":"onpoint.wbur.org","description":"The annual Boston Marathon is a day for joy. Yesterday began that way. 23,000 runners from around the world. Maybe half a million spectators, families, lining the 26-mile course in the spring sunshine, celebrating, cheering strangers on. And then, just ...","date":"2013-04-16T12:14:52Z"},{"title":"Boston Marathon bombings: Timeline of events","url":"http://www.wjla.com/articles/2013/04/boston-marathon-bombings-timeline-of-events-87715.html","source":"ABC 27","description":"BOSTON (AP) - Key moments related to the search for the Boston Marathon bombing suspects, based on reports from the Middlesex County district attorney, Massachusetts State Police and Boston police. April 18, 5:10 p.m. Investigators of the bombings release ...","date":"2013-04-19T18:09:14Z"},{"title":"FBI agent cleared in fatal shooting of Ibragim Todashev","url":"http://www.clickorlando.com/news/fbi-cleared-in-fatal-shooting-of-ibragim-todashev/25152538","source":"click orlando","description":"HE THREW A COFFEE TABLE AT AN AGENT AND CHARGED AT ANOTHER LAW ... The state attorney's office said the special agent was justified in self-defense for himself and another agent after a review of the investigation. \"My finding was, under Florida ...","date":"2014-03-25T22:10:15Z"},{"title":"Images from the Boston Marathon bombing and aftermath","url":"http://blogs.sacbee.com/photos/2013/04/images-from-the-boston-maratho.html","source":"Sacramento Bee","description":"BOSTON (AP) - By Wednesday, two days after the bombing, investigators in white jumpsuits had fanned out across the streets, rooftops and awnings around the blast site in search of clues. They combed through debris amid the toppled orange sports drink ...","date":"2013-04-16T23:56:23Z"},{"title":"Boston Marathon bombing: U.S. prosecutors to seek death penalty","url":"http://www.thestar.com/news/world/2014/01/30/boston_marathon_bombing_us_prosecutors_to_seek_death_penalty.html","source":"Toronto Star","description":"BOSTON—U.S. prosecutors on Thursday announced they will seek the death penalty against 20-year-old Dzhokhar Tsarnaev in the Boston Marathon bombing, instantly raising the stakes in what could be one of the most wrenching trials the city has ever seen.","date":"2014-01-31T00:11:34Z"},{"title":"Why the Boston Marathon bombing could increase Sochi Olympic security","url":"http://sports.nationalpost.com/2013/04/19/boston-marathon-bombing-suspects-reignite-fears-about-sochi-olympics/","source":"Nationalpost.com","description":"MOSCOW — The naming of two Chechen brothers as the suspects in the deadly Boston Marathon bombing is adding to security fears at the 2014 Winter Games in Sochi, the resort town on the edge of Russia’s restive southern republics. But officials insist ...","date":"2013-04-19T19:20:49Z"},{"title":"FBI: No Suspect Has Been Arrested In Boston Marathon Bombing","url":"http://newsone.com/2391931/boston-marathon-explosion-suspect/","source":"News One","description":"UPDATE 4/17/13, 4:58 p.m.: The Boston Marathon press conference has been postponed due to the bomb scare that occurred at the courthouse this afternoon, according to the Huffington Post: A press briefing regarding the Boston Marathon investigation was ...","date":"2013-04-16T23:56:23Z"},{"title":"Boston Marathon Bombing Investigation","url":"http://www.c-span.org/video/?312389-4/boston-marathon-bombing-investigation","source":"c-span.org","description":"Representative Bobby Scott (D-VA) talked abouit FBI and Homeland Security conduct in the investigation of the Boston Marathon… read more Representative Bobby Scott (D-VA) talked abouit FBI and Homeland Security conduct in the investigation of the Boston ...","date":"2013-04-25T23:52:52Z"},{"title":"Boston Marathon bombing comment no threat to St. Patrick's Day parade, Elmhurst police say","url":"http://abclocal.go.com/wls/story?id=9459318","source":"Abc Local Web","description":"March 8, 2014 (ELMHURST, Ill.) -- Police in west suburban Elmhurst have determined that there was no threat to the city's St. Patrick's Day parade after an anonymous user posted a comment on a local news website referencing the Boston Marathon bombing.","date":"2014-03-08T21:33:09Z"},{"title":"Boston Marathon bombing victim Halloween costume makes Michigan woman target on social media","url":"http://www.mlive.com/news/saginaw/index.ssf/2013/11/boston_marathon_bombing_victim.html","source":"MLive.com","description":"SAGINAW, MI — A photograph of a woman wearing a Saginaw Valley State University race shirt with fake wounds on her legs and face, meant to appear as a Boston Marathon bombing victim, has gone viral. The photograph drew attention and criticism from ...","date":"2013-11-05T01:11:47Z"},{"title":"Veterans psychologically impacted by Boston Marathon Bombing","url":"http://www.sciencedaily.com/releases/2013/11/131108112242.htm","source":"Science Daily","description":"According to a new study, many Boston-area military veterans diagnosed with post-traumatic stress disorder (PTSD) experienced flashbacks, unwanted memories and other psychological effects as a result of the Boston Marathon Bombing in April 2013. The study ...","date":"2013-11-07T23:56:39Z"},{"title":"Boston Marathon Bombing Evokes Retrospection of Past Terrorist Events","url":"http://www.indyposted.com/194857/boston-marathon-bombing-evokes-retrospection-of-past-terrorist-events/","source":"IndyPosted (blog)","description":"The bombing at the Boston Marathon has been deemed an act of “terrorism” by the White House—the worst to take place in the United States since the events of September 11 th, which occurred 12 years ago and changed the course of the nation from the ...","date":"2013-04-17T02:12:24Z"},{"title":"Boston Marathon Bombing Spiked PTSD Among Veterans","url":"http://psychcentral.com/news/2013/11/11/boston-marathon-bombing-spiked-ptsd-among-veterans/61890.html","source":"Psych Centra","description":"New research suggests traumatic events may indirectly affect individuals already diagnosed with PTSD, escalating symptoms and distress. The findings emerge from a new study which discovered many Boston-area military veterans diagnosed with post-traumatic ...","date":"2013-11-10T23:53:05Z"},{"title":"Boston Marathon Bombing Suspect Killed; Manhunt Ongoing for Accomplice, City on Lockdown—Celebs React","url":"http://www.eonline.com/news/409790/boston-marathon-bombing-suspect-killed-manhunt-ongoing-for-accomplice-city-on-lockdown-celebs-react","source":"E Online","description":"Boston and several of its suburbs are on lockdown Friday morning. One of the Boston marathon bombing suspects, Tamerlan Tsarnaev, was killed early this morning after he and his accomplice—his brother, Dzhokhar Tsarnaev—robbed a 7-Eleven ...","date":"2013-04-19T13:08:35Z"}],"death penalty":[{"title":"Boston Marathon bombing: US seeks death penalty for Dzhokhar Tsarnaev (+video)","url":"http://www.csmonitor.com/USA/Justice/2014/0130/Boston-Marathon-bombing-US-seeks-death-penalty-for-Dzhokhar-Tsarnaev-video","source":"The Christian Science Monitor","description":"US Attorney General Eric Holder Thursday authorized federal prosecutors to seek the death penalty in the trial of Dzhokhar Tsarnaev, who is accused of killing three and wounding hundreds in a bombing near the finish line of the Boston Marathon ...","date":"2014-01-31T01:51:46Z"},{"title":"Death penalty sought for bombings","url":"http://espn.go.com/boston/story/_/id/10377199/federal-prosecutors-seek-death-penalty-boston-marathon-bombing","source":"ESPN","description":"... Thursday announced they will seek the death penalty against 20-year-old Dzhokhar Tsarnaev in the Boston Marathon bombing, accusing him of betraying his adopted country by ruthlessly carrying out a terrorist attack calculated to cause maximum ...","date":"2014-01-30T22:24:11Z"},{"title":"Boston Marathon bombing: U.S. prosecutors to seek death penalty","url":"http://www.thestar.com/news/world/2014/01/30/boston_marathon_bombing_us_prosecutors_to_seek_death_penalty.html","source":"Toronto Star","description":"BOSTON—U.S. prosecutors on Thursday announced they will seek the death penalty against 20-year-old Dzhokhar Tsarnaev in the Boston Marathon bombing, instantly raising the stakes in what could be one of the most wrenching trials the city has ever seen.","date":"2014-01-31T00:11:34Z"},{"title":"In Boston, Mixed Reaction to Death Penalty Decision in Marathon Bombings Case","url":"http://thelede.blogs.nytimes.com/2014/01/30/in-boston-mixed-reaction-to-death-penalty-decision-in-marathon-bombings-case/","source":"New York Times Blogs","description":"Walsh, the mayor of Boston, voted against the death penalty. On Thursday, he said that he would vote the same way today. But Mr. Walsh also said ... seek the death penalty was mixed. The Boston Globe pointed to a poll’s findings last September.","date":"2014-01-31T02:27:34Z"},{"title":"U.S. prosecutors will seek death penalty against Boston Marathon bombing suspect","url":"http://www.calgaryherald.com/news/prosecutors+will+seek+death+penalty+against+Boston+Marathon+bombing+suspect/9449899/story.html","source":"Calgary Herald","description":"BOSTON — U.S. prosecutors on Thursday announced they will seek the death penalty against 20-year-old Dzhokhar Tsarnaev in the Boston Marathon bombing, instantly raising the stakes in what could be one of the most wrenching trials the city has ever seen.","date":"2014-01-30T20:08:11Z"},{"title":"Boston Marathon bombing suspect Dzhokhar Tsarnaev pleads not guilty","url":"http://dailyfreepress.com/2013/07/10/boston-marathon-bombing-suspect-dzhokhar-tsarnaev-pleads-not-guilty/","source":"Daily Free Press","description":"With his left arm in a cast, his face slightly swollen and wearing an orange prison jumpsuit, Dzhokhar Tsarnaev­ — the suspected Boston Marathon bomber — made his first public appearance at the U.S. District Court in South Boston on Wednesday and ...","date":"2013-07-11T02:04:39Z"},{"title":"Feds to seek death penalty against Boston Marathon bombing suspect","url":"http://www.suntimes.com/news/nation/25280907-418/feds-to-seek-death-penalty-against-boston-marathon-bombing-suspect.html","source":"Chicago Sun-Times","description":"BOSTON (AP) — Federal prosecutors Thursday announced they will seek the death penalty against 20-year-old Dzhokhar Tsarnaev in the Boston Marathon bombing, accusing him of betraying his adopted country by ruthlessly carrying out a terrorist ...","date":"2014-01-30T21:34:05Z"}],"boston":[{"title":"Michael Kennedy honored as hero of marathon bombing, Big Brother","url":"http://www.wsvn.com/story/25089043/michael-kennedy-honored-as-hero-of-marathon-bombing-big-brother","source":"WSVN-TV","description":"BOSTON (WHDH) - Many of the firefighters from the Boylston Street station were first responders to the Boston Marathon bombings and Michael Kennedy, who died battling the Back Bay fire on Wednesday, was one of them. Last month he was reunited with many of ...","date":"2014-03-27T10:04:54Z"},{"title":"Boston Marathon bombing investigated as world shows support (LIVE BLOG)","url":"http://www.globalpost.com/dispatch/news/regions/americas/united-states/130415/boston-marathon-explosion-reported","source":"GlobalPost","description":"As the second day after the bombings at the Boston Marathon draws to a close, the death toll still stands at 3, with more than 180 people having received treatment at area hospitals for injuries. At least 17 people remain in critical condition. The ...","date":"2013-04-17T18:47:24Z"},{"title":"Boston Marathon bombings: Updates","url":"http://livenews.thestar.com/Event/Boston_Marathon_bombings_Updates?Page=0","source":"livenews.thestar.com","description":"The patients are all Americans, surgeon Velmahos says. \"There was a lot of blood\" and the profuse bleeding caused a lot of problems in treatment, he says. All of the patients are idenfied and range in age from their 20s to their 70s.","date":"2013-04-15T23:57:34Z"},{"title":"Boston Marathon Bombing: Ben Affleck, Pink, Miley Cyrus React","url":"http://www.mtv.com/news/articles/1705746/boston-marathon-ben-affleck-miley-cyrus.jhtml","source":"MTV","description":"There were still more questions than answers on Tuesday morning (April 16) about who was behind the deadly bombings at the Boston Marathon on Monday that killed three people and wounded at least 144. President Obama vowed to a grieving nation that any ...","date":"2013-04-16T12:43:30Z"},{"title":"Please Stop Talking About How Flinty and Resilient Boston Is","url":"http://www.slate.com/articles/life/culturebox/2013/04/boston_marathon_bombing_stop_talking_about_how_flinty_and_resilient_boston.html","source":"Slate","description":"Everyone processes tragedy in their own way. This is as it should be. Throughout much of the day on Monday, after news of the bombing at the Boston Marathon hit, I shook in fear as details emerged, suppressing the urge to break down into tears ...","date":"2013-04-15T23:57:34Z"},{"title":"Boston Marathon 'breakthrough' with camera footage","url":"http://www.theguardian.com/world/2013/apr/17/boston-marathon-bombings-investigation-live","source":"theguardian.com","description":"Wednesday, April 17, 2013, for victims of the Boston Marathon bombing. The anticipated FBI briefing, announced for 5pm ET, has been postponed (again). A room full of media with nowhere else to go, as the #FBI briefing has been postponed...indefinitely.","date":"2013-04-16T23:56:23Z"},{"title":"Explosions Reported at Boston Marathon Finish Line [Live Updates]","url":"http://nymag.com/daily/intelligencer/2013/04/bomb-reported-at-boston-marathon-finish-line.html","source":"New York Magazine","description":"Members of the bomb squad also made a 'controlled blast' of another explosive ... Police counts at least two dead and 23 people injured. Update, 3:58 p.m.: The Boston Marathon confirms in a statement, \"There were two bombs that exploded near the finish ...","date":"2013-04-16T04:08:07Z"}],"finish line":[{"title":"3 killed, more than 140 hurt in Boston Marathon bombing","url":"http://news.blogs.cnn.com/2013/04/15/explosions-near-finish-of-boston-marathon/","source":"CNN (blog)","description":"Three killed – including 8-year-old boy – in bomb blasts near finish line of Boston Marathon, officials say. Area hospitals say at least 144 are injured, including eight children. Two explosions happened at about 2:50 p.m., more than two ...","date":"2013-04-16T01:37:47Z"},{"title":"Boston Marathon 2013 bombing: Two dead, 100 hurt in twin blasts","url":"http://news.nationalpost.com/2013/04/15/two-explosions-at-boston-marathon-finish-line-injure-dozens-reports/","source":"National Post","description":"The fiery twin blasts took place about 10 seconds ... hit 'Bomb makers all have unique signatures': Explosive devices may lead investigators to culprits ‘There was blood everywhere': Canadians recount the horror of witnessing the Boston Marathon blasts ...","date":"2013-04-14T23:58:45Z"},{"title":"Latest News On Boston Marathon Bombings","url":"http://hereandnow.wbur.org/2013/04/16/boston-marathon-bombing","source":"hereandnow.wbur.org","description":"Note: Our whole show today is dedicated to the bombings at the Boston Marathon. We’ll have a series of live guests, starting at 12 p.m. Eastern time, to get the latest updates on the investigation and the victims. The attack hit extremely close to home ...","date":"2013-04-14T23:58:45Z"},{"title":"The Boston Marathon Bombings","url":"http://onpoint.wbur.org/2013/04/16/the-boston-marathon-bombing","source":"onpoint.wbur.org","description":"The annual Boston Marathon is a day for joy. Yesterday began that way. 23,000 runners from around the world. Maybe half a million spectators, families, lining the 26-mile course in the spring sunshine, celebrating, cheering strangers on. And then, just ...","date":"2013-04-16T12:14:52Z"},{"title":"What We Know About The Boston Marathon Explosions","url":"http://www.motherjones.com/politics/2013/04/boston-marathon-explosions","source":"Mother Jones","description":"Today is a holiday in Massachusetts ... Here are two photos of Martin Richard, the 8-year-old boy who was killed in Monday's attack. A vigil was held for the family on Tuesday night in Dorchester, Mass. UPDATE 26, Wednesday, April 17, 1:54 p.m. EDT ...","date":"2013-04-15T12:44:42Z"},{"title":"Pictures from the Boston Marathon Bombing","url":"http://www.newyorker.com/online/blogs/newsdesk/2013/04/slide-show-the-boston-marathon-bombing.html","source":"The New Yorker","description":"“This was a heinous and cowardly act, and given what we now know about what took place, the F.B.I. is investigating it as an act of terrorism,” President Obama said the morning after the Boston Marathon explosions. He also spoke of what the horror of ...","date":"2013-04-16T15:35:18Z"},{"title":"Boston Marathon bombings Rumor Control: Man on the roof, 'false flag,' American Airlines, Family Guy, JFK Library, more (Updated)","url":"http://www.scpr.org/blogs/news/2013/04/16/13322/boston-marathon-bombings-rumor-control-man-on-the/","source":"89.3 KPCC","description":"Medical responders run an injured man past the finish line the 2013 Boston Marathon following an explosion in Boston, Monday, April 15, 2013. Conspiracy theorists spread rumors that the man was an \"actor.\" In reality, the father of the man in the ...","date":"2013-04-16T23:56:23Z"},{"title":"Images from the Boston Marathon bombing and aftermath","url":"http://blogs.sacbee.com/photos/2013/04/images-from-the-boston-maratho.html","source":"Sacramento Bee","description":"BOSTON (AP) - By Wednesday, two days after the bombing, investigators in white jumpsuits had fanned out across the streets, rooftops and awnings around the blast site in search of clues. They combed through debris amid the toppled orange sports drink ...","date":"2013-04-16T23:56:23Z"},{"title":"Boston Marathon Bombing: Photos From The Scene","url":"http://www.huffingtonpost.ca/2013/04/15/boston-marathon-explosions-photos_n_3087352.html","source":"The Huffington Post","description":"At least two bombs went off at the Boston Marathon on Monday. Immediately after the explosions, photos began to spread on social media of the blasts themselves and of the horrific aftermath. You can see the best photos so far in the gallery below.","date":"2013-04-16T13:26:27Z"},{"title":"Boston Marathon Bombings: United in running","url":"http://www.sheknows.com/health-and-wellness/articles/993135/boston-marathon-bombings-united-in-running","source":"SheKnows","description":"What Megan Searfoss remembered most was how perfect the morning was. The weather, the crowd, the training. She was ready. But the avid runner and founder of the women’s only 5K Run Like a Mother had no idea that the finish line she crossed minutes before ...","date":"2013-05-07T04:26:09Z"},{"title":"Boston Doctors Compare Marathon Bomb Injuries To War Wounds","url":"http://www.npr.org/blogs/health/2013/04/16/177427307/Boston-Doctors-Compare-Marathon-Bomb-Injuries-To-War-Wounds","source":"NPR News","description":"Boston hospitals always staff up their emergency rooms on Marathon Day to care for runners with cramps, dehydration and the occasional heart attack. But Monday, those hospitals suddenly found themselves with more than 100 traumatized patients ...","date":"2013-04-16T09:23:05Z"},{"title":"My Experience Photographing the Boston Marathon Bombing","url":"http://petapixel.com/2013/05/13/my-experience-photographing-the-boston-marathon-bombing/","source":"petapixel.com","description":"Patriots Day. This Massachusetts holiday celebrates the battles of Lexington and Concord, which were the first battles of the American Revolutionary War in 1775. The day always begins with battle re-enactments. Then the Red Sox play an 11AM game, and ...","date":"2013-05-12T23:54:11Z"},{"title":"Explosions Reported at Boston Marathon Finish Line [Live Updates]","url":"http://nymag.com/daily/intelligencer/2013/04/bomb-reported-at-boston-marathon-finish-line.html","source":"New York Magazine","description":"Members of the bomb squad also made a 'controlled blast' of another explosive ... Police counts at least two dead and 23 people injured. Update, 3:58 p.m.: The Boston Marathon confirms in a statement, \"There were two bombs that exploded near the finish ...","date":"2013-04-16T04:08:07Z"}],"president barack obama":[{"title":"Boston Marathon bombing investigated as world shows support (LIVE BLOG)","url":"http://www.globalpost.com/dispatch/news/regions/americas/united-states/130415/boston-marathon-explosion-reported","source":"GlobalPost","description":"As the second day after the bombings at the Boston Marathon draws to a close, the death toll still stands at 3, with more than 180 people having received treatment at area hospitals for injuries. At least 17 people remain in critical condition. The ...","date":"2013-04-17T18:47:24Z"},{"title":"President Obama Tells Boston to Keep Running After Marathon Bombings","url":"http://swampland.time.com/2013/04/18/president-obama-tells-boston-to-keep-running-after-marathon-bombings/","source":"Time","description":"Barack Obama did not come to Boston Thursday to remember, to mourn or to commemorate. He came to rally the city in an upbeat and uplifting speech about the inability of the marathon bombings to disrupt or destroy the spirit of the country.","date":"2013-04-17T23:55:12Z"},{"title":"Boston Marathon bombing: FBI releases photos of 2 ‘suspects’","url":"http://www.politico.com/story/2013/04/boston-marathon-explosions-suspect-video-90214.html","source":"POLITICO","description":"Authorities on Thursday released images of two suspects in the Boston Marathon bombings and called for the public’s assistance in identifying them. At a press conference, FBI Special Agent Richard DesLauriers unveiled photographs and video of the two ...","date":"2013-04-19T07:39:18Z"},{"title":"Barack Obama praises Russian help on Boston Marathon bombing investigation","url":"http://www.ndtv.com/article/world/barack-obama-praises-russian-help-on-boston-marathon-bombing-investigation-361177","source":"NDTV","description":"Washington: President Barack Obama said Tuesday that the US and Russia are overcoming Cold War era suspicions to co-operate on the investigation of the Boston Marathon bombings as his top diplomat announced plans to travel to Russia. Obama acknowledged ...","date":"2013-05-01T03:43:10Z"}],"boston marathon":[{"title":"Boston Marathon bombings victim to return to 2014 race","url":"http://www.necn.com/03/26/14/Boston-Marathon-bombings-victim-to-retur/landing.html?blockID=864290","source":"NECN","description":"MIDDLETOWN, R.I. (AP) - A Rhode Island woman is planning to return to the Boston Marathon, a year after losing her lower left leg in the bombing at the race. Heather Abbott talked about her plans Tuesday during a visit to Olympic Physical Therapy in ...","date":"2014-03-26T09:08:49Z"},{"title":"Boston Marathon bombing suspect remains hospitalized in 'serious condition,' unable to be questioned about motives","url":"http://www.nydailynews.com/news/national/boston-marathon-bombing-suspect-dzhokhar-tsarnaev-serious-condition-hospital-article-1.1322801","source":"New York Daily News","description":"The only who knows the motive in the Boston Marathon bombing still wasn’t speaking Saturday as federal authorities re-arrested two of his associates. Accused teen terrorist Dzhokhar Tsarnaev remained hospitalized and silent Saturday with a ...","date":"2013-04-20T16:34:59Z"},{"title":"Victims killed in Boston Marathon bombings identified","url":"http://www.cbsnews.com/news/victims-killed-in-boston-marathon-bombings-identified/","source":"CBS News","description":"Krystle Campbell of Arlington, Mass., was among the three people killed in the Boston Marathon bombings, CBS News confirmed Tuesday afternoon. Campbell, 29, was a restaurant manager who was at the race with her best friend, her father William Campbell told ...","date":"2013-04-17T08:17:28Z"},{"title":"Boston Marathon bombing: US seeks death penalty for Dzhokhar Tsarnaev (+video)","url":"http://www.csmonitor.com/USA/Justice/2014/0130/Boston-Marathon-bombing-US-seeks-death-penalty-for-Dzhokhar-Tsarnaev-video","source":"The Christian Science Monitor","description":"US Attorney General Eric Holder Thursday authorized federal prosecutors to seek the death penalty in the trial of Dzhokhar Tsarnaev, who is accused of killing three and wounding hundreds in a bombing near the finish line of the Boston Marathon ...","date":"2014-01-31T01:51:46Z"},{"title":"Investigators claim major progress in Boston bombings","url":"http://www.usatoday.com/story/news/nation/2013/04/17/boston-marathon-pressure-cooker-bomb/2089963/","source":"USA Today","description":"Investigators are exploring a number of promising leads in the Boston Marathon bombing case, including an image of a man believed possibly involved in one of Monday's twin explosions that killed three people and injured 176. A federal law ...","date":"2013-04-18T02:11:12Z"},{"title":"Boston Marathon 2013 bombing: Two dead, 100 hurt in twin blasts","url":"http://news.nationalpost.com/2013/04/15/two-explosions-at-boston-marathon-finish-line-injure-dozens-reports/","source":"National Post","description":"The fiery twin blasts took place about 10 seconds ... hit 'Bomb makers all have unique signatures': Explosive devices may lead investigators to culprits ‘There was blood everywhere': Canadians recount the horror of witnessing the Boston Marathon blasts ...","date":"2013-04-14T23:58:45Z"},{"title":"Canton Runners Spotlight: Boston Marathon Edition","url":"http://www.thecantoncitizen.com/2014/03/27/marathon-runners/","source":"Canton Citizen","description":"To make a donation to MR8, go to www.firstgiving.com/fundraiser/JoLysko/team-mr8-boston-marathon-2014. Are you a Canton resident running in the upcoming Boston Marathon? If so and you would like to be highlighted in the Canton Citizen ...","date":"2014-03-28T01:42:38Z"},{"title":"Boston Marathon bombing investigated as world shows support (LIVE BLOG)","url":"http://www.globalpost.com/dispatch/news/regions/americas/united-states/130415/boston-marathon-explosion-reported","source":"GlobalPost","description":"As the second day after the bombings at the Boston Marathon draws to a close, the death toll still stands at 3, with more than 180 people having received treatment at area hospitals for injuries. At least 17 people remain in critical condition. The ...","date":"2013-04-17T18:47:24Z"},{"title":"Latest News On Boston Marathon Bombings","url":"http://hereandnow.wbur.org/2013/04/16/boston-marathon-bombing","source":"hereandnow.wbur.org","description":"Note: Our whole show today is dedicated to the bombings at the Boston Marathon. We’ll have a series of live guests, starting at 12 p.m. Eastern time, to get the latest updates on the investigation and the victims. The attack hit extremely close to home ...","date":"2013-04-14T23:58:45Z"},{"title":"Death penalty sought for bombings","url":"http://espn.go.com/boston/story/_/id/10377199/federal-prosecutors-seek-death-penalty-boston-marathon-bombing","source":"ESPN","description":"... Thursday announced they will seek the death penalty against 20-year-old Dzhokhar Tsarnaev in the Boston Marathon bombing, accusing him of betraying his adopted country by ruthlessly carrying out a terrorist attack calculated to cause maximum ...","date":"2014-01-30T22:24:11Z"},{"title":"Boston Marathon bombing: Celebs react","url":"http://www.sheknows.com/entertainment/articles/991293/boston-marathon-bombing-celebs-react","source":"SheKnows","description":"Ellen DeGeneres: \"Let's all send our thoughts, our prayers and our energy to the people injured in Boston. My heart is with you.\" Chloë Grace Moretz: \"Horrific things happening in the world today. God bless those who have died and are injured.\" Patton ...","date":"2013-04-16T08:04:20Z"},{"title":"Developments in the Boston Marathon bombings probe","url":"http://www.newsday.com/news/nation/developments-in-the-boston-marathon-bombings-probe-1.5109774","source":"Newsday","description":"WILMINGTON, Mass. — A vigil has been held in Massachusetts for an MIT police officer authorities say was shot and killed by the alleged Boston Marathon bombers. Hundreds turned out Saturday night in Wilmington to honor 26-year-old Sean Collier ...","date":"2013-04-20T17:25:06Z"},{"title":"BREAKING: Boston Marathon bombing is “terrorist attack,” federal officials say","url":"http://americablog.com/2013/04/breaking-multiple-explosions-boston-marathon.html","source":"americablog.com","description":"Photos from the scene – one is graphic, and fortunately is protected behind a wall, it’s seriously graphic, not sure I’m glad I clicked. Boston Police Commissioner: If anyone saw anything, call 1-800-494-TIPS. — John Dickerson (@jdickerson) April ...","date":"2013-04-15T19:47:02Z"},{"title":"The Boston Marathon Bombings","url":"http://onpoint.wbur.org/2013/04/16/the-boston-marathon-bombing","source":"onpoint.wbur.org","description":"The annual Boston Marathon is a day for joy. Yesterday began that way. 23,000 runners from around the world. Maybe half a million spectators, families, lining the 26-mile course in the spring sunshine, celebrating, cheering strangers on. And then, just ...","date":"2013-04-16T12:14:52Z"},{"title":"Boston Marathon bombings Rumor Control: Man on the roof, 'false flag,' American Airlines, Family Guy, JFK Library, more (Updated)","url":"http://www.scpr.org/blogs/news/2013/04/16/13322/boston-marathon-bombings-rumor-control-man-on-the/","source":"89.3 KPCC","description":"Medical responders run an injured man past the finish line the 2013 Boston Marathon following an explosion in Boston, Monday, April 15, 2013. Conspiracy theorists spread rumors that the man was an \"actor.\" In reality, the father of the man in the ...","date":"2013-04-16T23:56:23Z"},{"title":"Boston Marathon Bomb Tragedy","url":"http://gonewengland.about.com/b/2013/04/17/boston-marathon-bomb-tragedy.htm","source":"gonewengland.about.com","description":"The Boston Marathon, a tradition since 1897 that takes place on the iconic Patriots Day holiday, was disrupted at 2:50 p.m. EDT Monday by two bomb explosions that left three dead and more than 170 injured. A third, apparently unrelated explosion ...","date":"2013-04-16T04:58:13Z"},{"title":"Images from the Boston Marathon bombing and aftermath","url":"http://blogs.sacbee.com/photos/2013/04/images-from-the-boston-maratho.html","source":"Sacramento Bee","description":"BOSTON (AP) - By Wednesday, two days after the bombing, investigators in white jumpsuits had fanned out across the streets, rooftops and awnings around the blast site in search of clues. They combed through debris amid the toppled orange sports drink ...","date":"2013-04-16T23:56:23Z"},{"title":"Boston Marathon Bombing: Photos From The Scene","url":"http://www.huffingtonpost.ca/2013/04/15/boston-marathon-explosions-photos_n_3087352.html","source":"The Huffington Post","description":"At least two bombs went off at the Boston Marathon on Monday. Immediately after the explosions, photos began to spread on social media of the blasts themselves and of the horrific aftermath. You can see the best photos so far in the gallery below.","date":"2013-04-16T13:26:27Z"},{"title":"Boston Marathon Bombings: United in running","url":"http://www.sheknows.com/health-and-wellness/articles/993135/boston-marathon-bombings-united-in-running","source":"SheKnows","description":"What Megan Searfoss remembered most was how perfect the morning was. The weather, the crowd, the training. She was ready. But the avid runner and founder of the women’s only 5K Run Like a Mother had no idea that the finish line she crossed minutes before ...","date":"2013-05-07T04:26:09Z"},{"title":"In Boston, Mixed Reaction to Death Penalty Decision in Marathon Bombings Case","url":"http://thelede.blogs.nytimes.com/2014/01/30/in-boston-mixed-reaction-to-death-penalty-decision-in-marathon-bombings-case/","source":"New York Times Blogs","description":"Walsh, the mayor of Boston, voted against the death penalty. On Thursday, he said that he would vote the same way today. But Mr. Walsh also said ... seek the death penalty was mixed. The Boston Globe pointed to a poll’s findings last September.","date":"2014-01-31T02:27:34Z"},{"title":"Houstonians respond to Boston Marathon bombing","url":"http://newsfixnow.com/2013/04/16/houstonians-respond-to-boston-marathon-bombing/","source":"newsfixnow.com","description":"HOUSTON, TX – As folks around the world scoured the net for updates on the Boston bombing, here in Houston many had a more personal connection. “I know people in Boston who were in that area and they said they heard the explosions,” Rice University ...","date":"2013-04-16T10:34:40Z"},{"title":"Boston Doctors Compare Marathon Bomb Injuries To War Wounds","url":"http://www.npr.org/blogs/health/2013/04/16/177427307/Boston-Doctors-Compare-Marathon-Bomb-Injuries-To-War-Wounds","source":"NPR News","description":"Boston hospitals always staff up their emergency rooms on Marathon Day to care for runners with cramps, dehydration and the occasional heart attack. But Monday, those hospitals suddenly found themselves with more than 100 traumatized patients ...","date":"2013-04-16T09:23:05Z"},{"title":"Boston Marathon bombings: How tech is helping","url":"http://venturebeat.com/2013/04/15/boston-marathon-bombings-how-tech-is-helping/","source":"Venturebeat.com","description":"Connect with leaders from the companies in this story, in real life: Come to the fourth annual VentureBeat Mobile Summit April 14-15 in Sausalito, Calif. Request an invitation. As everyone connected to the Internet knows by now, Boston has been the scene ...","date":"2013-04-15T22:03:02Z"},{"title":"FBI: No Suspect Has Been Arrested In Boston Marathon Bombing","url":"http://newsone.com/2391931/boston-marathon-explosion-suspect/","source":"News One","description":"UPDATE 4/17/13, 4:58 p.m.: The Boston Marathon press conference has been postponed due to the bomb scare that occurred at the courthouse this afternoon, according to the Huffington Post: A press briefing regarding the Boston Marathon investigation was ...","date":"2013-04-16T23:56:23Z"},{"title":"Boston Marathon Bombing: Ben Affleck, Pink, Miley Cyrus React","url":"http://www.mtv.com/news/articles/1705746/boston-marathon-ben-affleck-miley-cyrus.jhtml","source":"MTV","description":"There were still more questions than answers on Tuesday morning (April 16) about who was behind the deadly bombings at the Boston Marathon on Monday that killed three people and wounded at least 144. President Obama vowed to a grieving nation that any ...","date":"2013-04-16T12:43:30Z"},{"title":"GOP Lawmaker Suggests the Boston Marathon Bombing Was an Inside Job","url":"http://gawker.com/gop-lawmaker-suggests-the-boston-marathon-bombing-was-a-478818340","source":"Gawker","description":"This is Rep. Stella Tremblay. She is a Republican elected to New Hampshire's House of Representatives and she believes the government planned the bombing at the Boston Marathon last week that killed three people and injured more than 150 others. Tremblay ...","date":"2013-04-24T00:38:12Z"},{"title":"Please Stop Talking About How Flinty and Resilient Boston Is","url":"http://www.slate.com/articles/life/culturebox/2013/04/boston_marathon_bombing_stop_talking_about_how_flinty_and_resilient_boston.html","source":"Slate","description":"Everyone processes tragedy in their own way. This is as it should be. Throughout much of the day on Monday, after news of the bombing at the Boston Marathon hit, I shook in fear as details emerged, suppressing the urge to break down into tears ...","date":"2013-04-15T23:57:34Z"},{"title":"Boston Marathon Bombing Evokes Retrospection of Past Terrorist Events","url":"http://www.indyposted.com/194857/boston-marathon-bombing-evokes-retrospection-of-past-terrorist-events/","source":"IndyPosted (blog)","description":"The bombing at the Boston Marathon has been deemed an act of “terrorism” by the White House—the worst to take place in the United States since the events of September 11 th, which occurred 12 years ago and changed the course of the nation from the ...","date":"2013-04-17T02:12:24Z"},{"title":"The Boston Marathon Bombing: Keep Calm and Carry On","url":"http://www.theatlantic.com/national/archive/2013/04/the-boston-marathon-bombing-keep-calm-and-carry-on/275014/","source":"Atlantic Online","description":"It is easy to feel scared and powerless in the wake of attacks like those at the Boston Marathon. But it also plays into the perpetrators' hands. As the details about the bombings in Boston unfold, it'd be easy to be scared. It'd be easy to feel powerless ...","date":"2013-04-16T03:10:51Z"},{"title":"Boston Marathon 'breakthrough' with camera footage","url":"http://www.theguardian.com/world/2013/apr/17/boston-marathon-bombings-investigation-live","source":"theguardian.com","description":"Wednesday, April 17, 2013, for victims of the Boston Marathon bombing. The anticipated FBI briefing, announced for 5pm ET, has been postponed (again). A room full of media with nowhere else to go, as the #FBI briefing has been postponed...indefinitely.","date":"2013-04-16T23:56:23Z"},{"title":"Boston Marathon bombing suspect Dzhokhar Tsarnaev pleads not guilty","url":"http://dailyfreepress.com/2013/07/10/boston-marathon-bombing-suspect-dzhokhar-tsarnaev-pleads-not-guilty/","source":"Daily Free Press","description":"With his left arm in a cast, his face slightly swollen and wearing an orange prison jumpsuit, Dzhokhar Tsarnaev­ — the suspected Boston Marathon bomber — made his first public appearance at the U.S. District Court in South Boston on Wednesday and ...","date":"2013-07-11T02:04:39Z"},{"title":"Suspect ID’d in Boston Marathon bombings","url":"http://wtvr.com/2013/04/17/boston-marathon-bombing-arrest/","source":"WTVR-TV","description":"(CNN) — Investigators in Washington and Boston denied Wednesday that an arrest had been made in the bombing of the Boston Marathon. They had earlier said there was “substantial” progress in the case. There is conflicting information as to whether ...","date":"2013-04-17T21:46:21Z"},{"title":"My Experience Photographing the Boston Marathon Bombing","url":"http://petapixel.com/2013/05/13/my-experience-photographing-the-boston-marathon-bombing/","source":"petapixel.com","description":"Patriots Day. This Massachusetts holiday celebrates the battles of Lexington and Concord, which were the first battles of the American Revolutionary War in 1775. The day always begins with battle re-enactments. Then the Red Sox play an 11AM game, and ...","date":"2013-05-12T23:54:11Z"},{"title":"Explosions Reported at Boston Marathon Finish Line [Live Updates]","url":"http://nymag.com/daily/intelligencer/2013/04/bomb-reported-at-boston-marathon-finish-line.html","source":"New York Magazine","description":"Members of the bomb squad also made a 'controlled blast' of another explosive ... Police counts at least two dead and 23 people injured. Update, 3:58 p.m.: The Boston Marathon confirms in a statement, \"There were two bombs that exploded near the finish ...","date":"2013-04-16T04:08:07Z"}],"boston police commissioner":[{"title":"TERROR BOMBING at Boston Marathon — 3 Dead, 130-Plus Wounded","url":"http://www.heavy.com/news/2013/04/boston-marathon-bomb-explosion/","source":"heavy.com","description":"UPDATE ... the bombing. Photo: Unclaimed bags at finish line of Boston Marathon following explosion (Mary Pilon/NY Times) - twitter.com/TheMatthewKeys… — Matthew Keys (@TheMatthewKeys) April 16, 2013 UPDATE 8:13 p.m. — CNN reports at least 10 ...","date":"2013-04-15T20:58:37Z"},{"title":"Latest News On Boston Marathon Bombings","url":"http://hereandnow.wbur.org/2013/04/16/boston-marathon-bombing","source":"hereandnow.wbur.org","description":"Note: Our whole show today is dedicated to the bombings at the Boston Marathon. We’ll have a series of live guests, starting at 12 p.m. Eastern time, to get the latest updates on the investigation and the victims. The attack hit extremely close to home ...","date":"2013-04-14T23:58:45Z"},{"title":"Marathon bombing suspect dead, another on run","url":"http://sportsillustrated.cnn.com/more/news/20130419/boston-marathon-bombing-suspects.ap/","source":"CNN Sports Illustrated","description":"WATERTOWN, Mass. (AP) -- All residents of Boston were ordered to stay in their homes Friday morning as the search for the surviving suspect in the marathon bombings continued after a long night of violence that left another suspect dead.","date":"2013-04-20T04:39:10Z"},{"title":"BREAKING: Boston Marathon bombing is “terrorist attack,” federal officials say","url":"http://americablog.com/2013/04/breaking-multiple-explosions-boston-marathon.html","source":"americablog.com","description":"Photos from the scene – one is graphic, and fortunately is protected behind a wall, it’s seriously graphic, not sure I’m glad I clicked. Boston Police Commissioner: If anyone saw anything, call 1-800-494-TIPS. — John Dickerson (@jdickerson) April ...","date":"2013-04-15T19:47:02Z"}],"fbi agent":[{"title":"Friend of Boston Marathon bombing suspect threatened FBI agent, prosecutor says","url":"http://www.foxnews.com/us/2014/03/25/friend-boston-marathon-bombing-suspect-threatened-fbi-agent-prosecutor-says/","source":"FOX News","description":"A friend of one of the Boston marathon bombing suspects threatened ... State Attorney Jeff Ashton said in a report the agent was justified in shooting Ibragim Todashev, 27, last May. The officers were questioning Todashev about the 2011 slaying ...","date":"2014-03-25T14:46:26Z"},{"title":"FBI agent cleared in killing of friend of Boston bombing suspect","url":"http://www.latimes.com/nation/la-na-boston-marathon-todashev-20140326,0,2476666.story","source":"Los Angeles Times","description":"ORLANDO, Fla. — One of the lingering mysteries of the Boston Marathon bombing involves the grisly triple slaying that preceded it. On the night of Sept. 11, 2011, three men had their throats slashed in the quiet suburb of Waltham, Mass.","date":"2014-03-26T04:29:38Z"},{"title":"Reports detail killing of bombing suspect's friend","url":"http://www.ajc.com/ap/ap/top-news/fla-prosecutor-releases-report-on-fbi-shooting/nfKrs/","source":"Atlanta Journal Constitution","description":"\"Abdul-Baki Todashev told The Associated Press in Russia. \"Who could believe this?\" Tsarnaev and his brother, Dzhokhar, have roots in the turbulent Russian regions of Dagestan and Chechnya, which have become recruiting grounds for Islamic extremists.","date":"2014-03-24T23:58:49Z"},{"title":"FBI agent cleared in shooting tied to Boston bombings probe","url":"http://sg.news.yahoo.com/florida-prosecutor-findings-marathon-related-shooting-124335173--spt.html","source":"Yahoo News Singapore","description":"After a long interview with law enforcement officers, Ashton said Todashev was writing a statement about his involvement in the triple murder when he suddenly threw a coffee table, striking the agent in the head ... seconds he pulled the trigger,\" said ...","date":"2014-03-25T12:37:35Z"},{"title":"FBI agent cleared in fatal shooting of Ibragim Todashev","url":"http://www.clickorlando.com/news/fbi-cleared-in-fatal-shooting-of-ibragim-todashev/25152538","source":"click orlando","description":"HE THREW A COFFEE TABLE AT AN AGENT AND CHARGED AT ANOTHER LAW ... The state attorney's office said the special agent was justified in self-defense for himself and another agent after a review of the investigation. \"My finding was, under Florida ...","date":"2014-03-25T22:10:15Z"}]}