[{"title":"Russia omitted details on Boston Marathon bombing suspect","url":"http://www.aol.com/article/2014/04/10/russia-omitted-details-on-boston-marathon-bombing-suspect/20866702/?a_dgi=aolshare_facebook","source":"AOL","description":"BOSTON - APRIL 15: Police walk through the evacuated scene at Exeter and Boylston Streets after two explosions went off near the finish line of the 117th Boston Marathon on April 15, 2013. This image was taken at 3:05:12 p.m. (Aaron Tang for The ...","date":"2014-04-10T06:20:42Z"},{"title":"Boston Marathon Bombing: Homeland Security’s ‘Lessons Learned’","url":"http://abcnews.go.com/blogs/headlines/2014/04/boston-marathon-bombing-homeland-securitys-lessons-learned/","source":"ABC News","description":"The Department of Homeland Security today revealed what it has learned in the wake of the Boston Marathon bombing, just a week shy of the deadly attack’s first anniversary. In a 19-page report, written in response to a “hot wash” review ...","date":"2014-04-10T12:32:56Z"},{"title":"Five myths about the Boston Marathon bombing (Commentary)","url":"http://www.syracuse.com/opinion/index.ssf/2014/04/five_myths_about_the_boston_marathon_bombing_commentary.html","source":"Syracuse Post-Standard","description":"At the Boston Marathon this month, its host city will mark one year since Tamerlan and Dzhokhar Tsarnaev allegedly planted two bombs at the finish line, killing three and injuring hundreds more. As the nation commemorates the resilience of runners, victims ...","date":"2014-04-10T12:54:24Z"},{"title":"Russia omitted details on Boston Marathon bombing suspect: NYT","url":"http://news.yahoo.com/russia-omitted-details-boston-marathon-bombing-suspect-nyt-044157297--sector.html?pt=BureoF3GVB","source":"Yahoo News","description":"(Reuters) - Russia declined several FBI requests for more information on Boston Marathon bombing suspect Tamerlan Tsarnaev two years before the deadly 2013 attack, the New York Times reported on Wednesday, citing an unpublished U.S. government review.","date":"2014-04-10T04:40:29Z"},{"title":"Faced with health challenges, a mayor rises in face of Boston Marathon terror","url":"http://msn.foxsports.com/other/story/faced-with-health-challenges-a-mayor-rises-in-face-of-boston-marathon-terror-041014","source":"FOX Sports","description":"(In the coming weeks, you'll see in our series at FOXSports.com what the Boston bombing means to more than two dozen people directly affected at last year's marathon. So 2014 is the comeback, because 2013 was the knockdown. This is our latest ...","date":"2014-04-10T12:54:24Z"},{"title":"Russia Failed to Share Data on Boston Bombing Suspect, U.S. Says","url":"http://www.nytimes.com/2014/04/10/us/russia-withheld-details-on-tamerlan-tsarnaev-us-report-says.html","source":"New York Times","description":"WASHINGTON — The Russian government declined to provide the F.B.I. with information about one of the Boston Marathon bombing suspects two years before the attack that would most likely have prompted more extensive scrutiny of the suspect ...","date":"2014-04-09T23:11:12Z"},{"title":"Russia Didn’t Share All Details on Boston Bombing Suspect, Report Says","url":"http://www.nytimes.com/2014/04/10/us/russia-failed-to-share-details-on-boston-marathon-bombing-suspect.html","source":"New York Times","description":"WASHINGTON — The Russian government declined to provide the F.B.I. with information about one of the Boston Marathon bombing suspects that would most likely have led to more extensive scrutiny of him at least two years before the attack ...","date":"2014-04-10T17:04:57Z"},{"title":"Russia hid information from FBI on Boston Marathon bomber: report","url":"http://www.nydailynews.com/news/national/russia-hid-info-fbi-boston-marathon-bombers-article-1.1751611","source":"New York Daily News","description":"Two years before the Boston Marathon bombing, the Russian government concealed key information on one of the killers that might have thwarted the attack, a new report charges. Kremlin officials intercepted a phone conversation in which Tamerlan Tsarnaev ...","date":"2014-04-10T16:50:38Z"},{"title":"Russian authorities withheld information on Boston attack, report says","url":"http://www.foxnews.com/us/2014/04/10/russian-authorities-withheld-information-on-boston-attack-report-says/","source":"FOX News","description":"The Russian government declined to provide American authorities with information about one of the Boston Marathon bombing suspects two years before the attack, which likely would have led to more extensive scrutiny of the suspect, according to a ...","date":"2014-04-10T17:04:57Z"},{"title":"Books About the Boston Marathon and 2013 Bombings","url":"http://www.bostonmagazine.com/arts-entertainment/blog/2014/04/09/books-boston-marathon-bombings/","source":"Boston Magazine","description":"With the one-year anniversary of the Boston Marathon bombings upon us, several new books join a collection of published works that offer special insight into last year’s events, as well as a hopeful outlook for the 2014 race. Here, 13 books ...","date":"2014-04-09T12:48:26Z"},{"title":"My Fiancé Almost Died in the Boston Marathon Bombings","url":"http://www.cosmopolitan.com/sex-love/relationship-advice/jennifer-regan-marc-fucarile-boston-marathon-bombings","source":"Cosmopolitan Magazine","description":"Last April, Marc Fucarile was watching the Boston Marathon with friends when two bombs exploded near the finish line. He was gravely injured: The second blast blew off Fucarile’s right leg, broke his spine, and riddled his body with BBs and shrapnel.","date":"2014-04-10T10:16:55Z"},{"title":"Chief Describes Boston Marathon Lessons Learned","url":"http://abcnews.go.com/Sports/wireStory/communication-urged-terrorism-task-forces-23260134","source":"ABC News","description":"It's been almost a year since police in the Boston suburb of Watertown were at the center of the hunt for the Boston Marathon bombing suspects. Police found themselves in a late-night shootout with the suspects — one was killed, the other was ...","date":"2014-04-09T18:32:02Z"},{"title":"Incredible Portraits Of Boston Marathon Survivors With Messages Of Healing And Hope To The World","url":"http://www.buzzfeed.com/tasneemnashrulla/xx-inspiring-messages-from-the-boston-marathon-survivors-to","source":"BuzzFeed","description":"As the one-year anniversary of the bombing at the Boston Marathon approaches, photographer Robert X. Fogarty, known for his message-on-skin portrait project called “Dear World,” asked marathon survivors, first responders and supporters to ...","date":"2014-04-10T14:41:47Z"},{"title":"Congress to be briefed on review of Boston bombing","url":"http://thecourier.com/national-news/2014/04/10/congress-to-be-briefed-on-review-of-boston-bombing/","source":"Courier","description":"Michael McCaul, R-Texas, asks a questions on Capitol Hill in Washington, Wednesday, April 9, 2014, during the committee’s hearing about the Boston Marathon Bombings leading up to the year anniversary of the attack. (AP Photo/Jacquelyn Martin ...","date":"2014-04-10T16:14:50Z"},{"title":"Behind The Mic With Joe Mathieu: Poll Finds Marathon Bombings Changed Boston","url":"http://boston.cbslocal.com/2014/04/10/behind-the-mic-with-joe-mathieu-poll-finds-marathon-bombings-changed-boston/","source":"boston.cbslocal.com","description":"BOSTON (CBS) – I suppose we shouldn’t be surprised by the headline – after all, our city has changed in many ways since last year’s Boston Marathon, some more literal than others. We’ll certainly see some of those changes at the ...","date":"2014-04-10T06:56:29Z"}]