{"pete dimartino":[{"title":"Boston Marathon bombings survivors tie the knot in North Carolina ceremony","url":"http://www.nydailynews.com/news/national/boston-marathon-bombing-victims-tie-knot-article-1.1746556","source":"New York Daily News","description":"The deadly Boston Marathon bombings brought Rebekah Gregory and Pete DiMartino closer together in love and now marriage as the couple tied the knot Friday at a 19th-century estate in North Carolina. The 26-year-old bride wore a Sophia Moncelli ...","date":"2014-04-05T17:25:11Z"}],"boston public library":[{"title":"New exhibit features mementos from Boston Marathon bombing memorial","url":"http://www.foxnews.com/us/2014/04/07/new-exhibit-features-mementos-from-boston-marathon-bombing-memorial/","source":"FOX News","description":"From the survivors, to Bostonians, to those who watched the carnage of the Boston Marathon bombing on televisions around the world, people sought a way to show their support for the victims and the city of Boston. Mail poured in from across the ...","date":"2014-04-07T19:17:21Z"},{"title":"In New Exhibit, Running Shoes Are Potent Symbol Of Boston Bombing","url":"http://www.npr.org/2014/04/07/300234751/in-new-exhibit-running-shoes-are-potent-symbol-of-boston-bombing","source":"NPR News","description":"In the wake of most tragedies, makeshift memorials fill up with flowers and teddy bears. After the Boston Marathon bombings last April, running shoes became potent symbols in the vast memorial there. Now, after months in storage at the cavernous ...","date":"2014-04-07T15:56:55Z"},{"title":"BPL opens ‘Dear Boston’ memorial exhibit today","url":"http://bostonherald.com/news_opinion/local_coverage/2014/04/bpl_opens_dear_boston_memorial_exhibit_today","source":"Boston Herald","description":"Poignant objects and messages from the makeshift memorial that developed in Copley Square after the Boston Marathon bombings will go on display today at the Boston Public Library in what promises to be an emotional exhibit just steps from where the bombs ...","date":"2014-04-07T02:28:02Z"}],"fbi agent":[{"title":"Five myths about the Boston Marathon bombing","url":"http://www.washingtonpost.com/opinions/five-myths-about-the-boston-marathon-bombing/2014/04/04/0d0c8470-b9b2-11e3-9a05-c739f29ccb08_story.html","source":"Washington Post","description":"At the Boston Marathon this month, its host city will mark one year since Tamerlan and Dzhokhar Tsarnaev allegedly planted two bombs at the finish line , killing three and injuring hundreds more. As the nation commemorates the resilience of runners ...","date":"2014-04-03T23:54:07Z"},{"title":"Boston Marathon bombing suspect seeks to have some charges dismissed","url":"http://ca.news.yahoo.com/boston-marathon-bombing-suspect-statement-detriment-during-sisters-210853193.html","source":"Yahoo!","description":"BOSTON - An FBI agent overheard Boston Marathon bombing suspect Dzhokhar Tsarnaev make a \"statement to his detriment\" when his sister visited him in prison, U.S. prosecutors said Friday. Prosecutors did not reveal what Tsarnaev said, but they objected to ...","date":"2014-02-27T23:59:50Z"}],"bauman":[{"title":"A year after the Boston Marathon bombings, new legs are just the start","url":"http://www.cbsnews.com/news/a-year-after-the-boston-marathon-bombings-new-legs-are-just-the-start/","source":"CBS News","description":"CARLISLE, Mass. - The year since Jeff Bauman was rushed in a wheelchair from the Boston Marathon, his legs ravaged, has been marked by pain but also by triumph: He's learned to walk on new prosthetic legs, he's gotten engaged and he's an expectant father.","date":"2014-04-05T21:21:25Z"},{"title":"Boston Marathon Bombing Survivor Prepares Memoir","url":"http://www.people.com/people/article/0,,20731697,00.html","source":"People","description":"April 15, 2014, will bring the one-year anniversary of the Boston Marathon bombing, as well as the book Stronger by one of those who greatly suffered in the explosion, Jeff Bauman. Bauman, a 27-year-old who was waiting at the finish line to ...","date":"2013-09-04T23:53:48Z"}],"anderson cooper":[{"title":"Dancer returns to stage after losing leg in Boston bombings","url":"http://www.cnn.com/2014/04/07/us/boston-bombing-survivor-a-year-later/index.html","source":"CNN","description":"New York (CNN)-- Adrianne Haslet-Davis' life as a dancer was shattered last year at the Boston Marathon bombings. She and her husband Adam, who had just returned from a tour in Afghanistan with the Air Force, were steps away from the second blast.","date":"2014-04-07T15:35:27Z"}],"boston marathon bombing":[{"title":"Couple Injured in Boston Marathon Bombing Weds","url":"http://www.people.com/people/article/0,,20803009,00.html","source":"People","description":"It may have been pouring rain in Asheville, N.C., on Friday, but underneath a tent filled with flowers it felt like the sun was shining. That's because Rebekah Gregory and Pete DiMartino, who were gravely injured in last April's Boston Marathon ...","date":"2014-04-03T14:57:14Z"},{"title":"Boston Marathon Survivors Tie The Knot In Dream Wedding","url":"http://www.huffingtonpost.com/2014/04/07/boston-bombing-couple_n_5107498.html","source":"The Huffington Post","description":"Almost one year ago exactly, Rebekah Gregory and Pete DiMartino were in the hospital, just beginning the long and difficult recovery process after sustaining serious injuries in the Boston Marathon bombing. But on Friday, it was evident just how ...","date":"2014-04-07T18:41:34Z"},{"title":"Couple injured in the Boston Marathon bombings marry","url":"http://thecelebritycafe.com/feature/2014/04/couple-injured-boston-marathon-bombings-marry","source":"The Celebrity Cafe.com","description":"On Friday, just a little over a week before the anniversary of the Boston Marathon bombing, a couple who was injured in the blast exchanged vows in Asheville, N.C. Rebekah Gregory and Pete DiMartino had attended the marathon in order to watch DiMartino’s ...","date":"2014-04-04T22:41:20Z"},{"title":"Marathon Medical Tent Volunteers Reflect On Bombing","url":"https://screen.yahoo.com/marathon-medical-tent-volunteers-reflect-104300035.html","source":"Yahoo Screen","description":"Only U.S. numbers are accepted. Text messaging rates may apply. Ken MacLeod speaks with the medical personnel who were there during the April 15, 2013 Boston Marathon bombing. Find more CBS Local videos on Yahoo Screen. More Ken MacLeod speaks with the ...","date":"2014-04-07T10:56:16Z"},{"title":"Fort Hood shooting, Boston bombing anniversary spark emergency prep actions","url":"http://www.fiercehealthcare.com/story/fort-hood-shooting-boston-bombing-anniversary-spark-emergency-preparedness/2014-04-04","source":"Fierce Health Care","description":"In the aftermath of incidents like this week's Ft. Hood shooting and last year's Boston Marathon bombing, hospitals around the country have stepped up preparation for mass casualty and emergency scenarios. One issue that came to light after the ...","date":"2014-04-04T15:10:22Z"},{"title":"Boston Marathon Bombing Survivor Gets Engaged To His Nurse [Video]","url":"http://www.inquisitr.com/1068917/boston-marathon-bombing-victim-engaged-to-nurse/","source":"The Inquisitr","description":"Boston Marathon bombing survivor, James Costello, took the worst moment of his life and turned it into the best. Costello, 31, recently got engaged to a nurse who cared for him while he was recovering from the injuries he suffered while watching the April ...","date":"2013-12-19T23:56:57Z"},{"title":"Boston Hospitals Share Lessons From Marathon Bombing","url":"http://www.npr.org/blogs/health/2013/09/19/224049730/boston-hospitals-share-lessons-from-marathon-bombing","source":"NPR News","description":"Boston hospitals say that overall they did well in their response to the bombings because, as crazy as it sounds, they got lucky on April 15. Dr. Richard Wolfe, chief of emergency medicine at Beth Israel Deaconess Medical Center, says hospitals ...","date":"2013-09-19T21:20:01Z"},{"title":"Boston Marathon bombings: Timeline of events","url":"http://www.wjla.com/articles/2013/04/boston-marathon-bombings-timeline-of-events-87715.html","source":"ABC 7 News","description":"BOSTON (AP) - Key moments related to the search for the Boston Marathon bombing suspects, based on reports from the Middlesex County district attorney, Massachusetts State Police and Boston police. April 18, 5:10 p.m. Investigators of the bombings release ...","date":"2013-04-19T18:09:14Z"},{"title":"Your Guide To The Boston Marathon Bombing Amateur Internet Crowd-Sleuthing","url":"http://gawker.com/5994892/your-guide-to-the-boston-marathon-bombing-amateur-internet-crowd-sleuthing/all","source":"Gawker","description":"In the wake of the Boston Marathon bombing, people on the internet have taken to groundlessly speculating on the identity of the attacker or attackers based on photos and videos from the scene, a process known as \"procrastinating at work,\" or \"crowdsourcing.","date":"2013-04-17T17:00:01Z"},{"title":"Boston Marathon Bombing Investigators Using Crowdsourced Photographs","url":"http://petapixel.com/2013/04/17/boston-marathon-bombing-investigators-using-crowdsourced-photographs/","source":"petapixel.com","description":"In the aftermath of the tragic Boston Marathon bombing on Monday, investigators are turning to crowdsourced photographs and videos in order to hunt down the perpetrator(s). Authorities are calling for anyone at the marathon that day to send in photographs ...","date":"2013-04-16T23:56:23Z"},{"title":"Boston Marathon Bombing Spiked PTSD Among Veterans","url":"http://psychcentral.com/news/2013/11/11/boston-marathon-bombing-spiked-ptsd-among-veterans/61890.html","source":"Psych Centra","description":"New research suggests traumatic events may indirectly affect individuals already diagnosed with PTSD, escalating symptoms and distress. The findings emerge from a new study which discovered many Boston-area military veterans diagnosed with post-traumatic ...","date":"2013-11-10T23:53:05Z"},{"title":"Boston Marathon Bombing Suspect Killed; Manhunt Ongoing for Accomplice, City on Lockdown—Celebs React","url":"http://www.eonline.com/news/409790/boston-marathon-bombing-suspect-killed-manhunt-ongoing-for-accomplice-city-on-lockdown-celebs-react","source":"E Online","description":"Boston and several of its suburbs are on lockdown Friday morning. One of the Boston marathon bombing suspects, Tamerlan Tsarnaev, was killed early this morning after he and his accomplice—his brother, Dzhokhar Tsarnaev—robbed a 7-Eleven ...","date":"2013-04-19T13:08:35Z"},{"title":"Hospital 'Buzzing' Over Engagement of Boston Marathon Bombing Survivor to Nurse","url":"http://gma.yahoo.com/blogs/abc-blogs/hospital-39-buzzing-39-over-engagement-boston-marathon-180707421--abc-news-topstories.html","source":"gma.yahoo.com","description":"The upcoming marriage between a Boston Marathon bombing survivor and the nurse who helped him recover has the hospital where the pair met \"buzzing.\" \"Everyone who works on the floor here, who knew him, everyone is buzzing about it,\" Spaulding ...","date":"2013-12-18T18:28:51Z"},{"title":"Boston Bombing Suspect PARTIED At College After Marathon Monday Attack!","url":"http://perezhilton.com/2013-04-20-dzhokhar-tsarnaev-partied-at-college-after-boston-marathon-bombing","source":"PerezHilton.com","description":"It's difficult and disturbing enough to believe that brothers Dzhokhar and Tamerlan Tsarnaev were behind the devastating Boston Marathon bombing that took the lives of three people and severely injured hundreds of others Monday afternoon, let alone ...","date":"2013-04-20T19:19:38Z"},{"title":"Michelle Obama invites Jason Collins, Boston Marathon bombing survivors to SOTU box","url":"http://www.philly.com/philly/sports/sbnation/SBNation_20140127_Michelle_Obama_invites_Jason_Collins__Boston_Marathon_bombing_survivors_to_SOTU_box.html","source":"Philly.com","description":"The first openly gay active NBA player and two of the faces of the Boston Marathon bombing will be guests of honor during the State of the Union Address on Tuesday night. First Lady Michelle Obama's guest list for her husband's State of the Union Address ...","date":"2014-01-27T16:44:09Z"},{"title":"How News Outlets Could Have Reported on the Boston Marathon Bombing","url":"http://www.mediabistro.com/10000words/media-coverage-of-boston-marathon-bombing_b18656","source":"Media Bistro","description":"If journalism is the first draft of history, it’s starting to look a lot like a mangled Google doc with too many approved editors this week. The only thing more ‘disgusting’ — as Jimmy Kimmel so aptly put it in his monologue Monday night — than ...","date":"2013-04-17T17:14:20Z"}],"closure":[{"title":"The Myth of 'Closure' -- One Year After the Boston Marathon Bombings","url":"http://www.huffingtonpost.com/john-tsilimparis/boston-bombing-anniversary_b_5094061.html","source":"The Huffington Post","description":"A few weeks ago, CNN's Anderson Cooper was interviewing a psychologist in Kuala Lumpur who was grief counseling some of the families of the victims of the Malaysia Airlines flight that vanished. Despite the fact that there was still no confirmation that ...","date":"2014-04-07T17:37:08Z"}],"friday afternoon":[{"title":"Susan Zalkind: 5 myths about the Boston Marathon bombing","url":"http://azstarnet.com/ap/commentary/susan-zalkind-myths-about-the-boston-marathon-bombing/article_68b1a19e-a88a-5068-a3a3-9a1d5ded7b6d.html","source":"The Arizona Daily Star","description":"At the Boston Marathon on April 21, the city will mark one year since Tamerlan and Dzhokhar Tsarnaev allegedly planted two bombs at the finish line, killing three and injuring hundreds more. As the nation commemorates the resilience of runners, victims ...","date":"2014-04-08T06:30:14Z"}],"boston marathon":[{"title":"Boston Marathon Bombing Wedding","url":"http://www.popsugar.com/Boston-Marathon-Bombing-Wedding-34515095","source":"PopSugar Celebrity","description":"Today's a happy day for Rebekah Gregory and Pete DiMartino, who said \"I do\" almost a year after tragedy struck their lives at the 2013 Boston Marathon. The couple, who was dating at the time of the race, both suffered injuries, but after working together ...","date":"2014-04-03T23:54:07Z"},{"title":"New book on Boston Marathon benefits families of victims","url":"http://www.hollandsentinel.com/article/20140408/News/140409109","source":"Holland Sentinel","description":"... spoke about a collection of writings to benefit the family members of those killed in last year’s Boston Marathon bombings. The new book, \"The 27th Mile: Going the Extra Mile to Support the Victims of the Boston Marathon Bombing,\" is an ...","date":"2014-04-08T21:03:32Z"},{"title":"Dzhokhar Tsarnaev: Boston Marathon Bombing Suspect","url":"http://www.huffingtonpost.co.uk/2013/04/19/dzhokhar-tsarnaev-boston-bombing-suspect_n_3114920.html","source":"Huffington Post UK","description":"The surviving Boston bomb suspect has been named as Dzhokhar Tsarnaev, 19, of Cambridge, Massachusetts. His 26-year-old brother, Tamerlan Tsarnaev, was named as the second suspect who died following a police shootout earlier this morning. Dzhokhar was ...","date":"2013-04-20T07:38:07Z"},{"title":"Boston Marathon bombing leaves 3 dead, 120 injured (PHOTOS, VIDEO)","url":"http://www.baltimorenewsjournal.com/2013/04/15/boston-marathon-bombing-leaves-dozens-injured-photos/","source":"baltimorenewsjournal.com","description":"5/1/13 UPDATE: Three more individuals have been arrested in connection with this incident. Click here for details. UPDATE 13: The second suspect has been captured. UPDATE 12: One suspect is dead and the other has been identified and is on the run.","date":"2013-04-14T23:58:45Z"},{"title":"Biggest myths from the Boston Marathon bombing","url":"http://www.salon.com/2013/04/22/biggest_myths_from_the_boston_marathon_bombing/","source":"Salon","description":"The still-emerging facts of the Boston Marathon bombing case are harrowing enough, but that didn’t stop conspiracy theorists, detective-wannabes on the Internet and too-quick-to-the-draw cable news outlets from circulating paranoid ...","date":"2013-04-22T22:01:54Z"},{"title":"Who's behind the Boston Marathon bombings? 4 theories","url":"http://theweek.com/article/index/242773/whos-behind-the-boston-marathon-bombings-4-theories","source":"The Week Magazine","description":"aw enforcement officials don't have any official suspects in Monday's twin bombings at the finish line of the Boston marathon. And President Obama specifically urged people not to speculate on who's behind the attack, which killed at least three people ...","date":"2013-04-16T08:54:27Z"},{"title":"The Boston Marathon Bombings","url":"http://onpoint.wbur.org/2013/04/16/the-boston-marathon-bombing","source":"On Point","description":"The annual Boston Marathon is a day for joy. Yesterday began that way. 23,000 runners from around the world. Maybe half a million spectators, families, lining the 26-mile course in the spring sunshine, celebrating, cheering strangers on. And then, just ...","date":"2013-04-16T12:14:52Z"},{"title":"Sick malware authors exploit Boston Marathon bombing with Trojan attack","url":"http://nakedsecurity.sophos.com/2013/04/17/malware-boston-marathon-bombing/","source":"nakedsecurity.sophos.com","description":"With sick inevitability, cybercriminals have exploited interest in the breaking news story of the explosions at the Boston Marathon by spreading malware. Messages spammed out by attackers claim to contain a link to video footage of Monday's terrorist ...","date":"2013-04-16T23:56:23Z"},{"title":"Boston Natives Ben Affleck & Mark Wahlberg Among Hollywood Stars Tweeting About ‘Senseless And Tragic’ Marathon Bombings","url":"http://radaronline.com/exclusives/2013/04/boston-marathon-bombings-hollywood-stars-react-twitter/","source":"Radar Online","description":"Ben Affleck and Mark Wahlberg – both of whom grew up in Beantown — are among many stars expressing their shock and horror at the bombings at the Boston Marathon Monday afternoon. Affleck — who was raised in Cambridge, Greater Boston and ...","date":"2013-04-16T21:18:54Z"},{"title":"Boston Marathon bombing suspect in custody","url":"http://tracking.si.com/2013/04/19/boston-marathon-bombing-suspect-in-custody/","source":"SI Tracking Blog","description":"The Boston Marathon bombing suspect is now in custody following a standoff with law enforcement in Watertown, Massachusetts on Friday night.The suspect, Dzhokhar Tsarnaev, survived a late-night firefight with police that resulted in the death of his ...","date":"2013-04-20T01:04:25Z"},{"title":"Boston Marathon Terrorist Bombing – Celebrities Respond On Twitter","url":"http://www.celebdirtylaundry.com/2013/boston-marathon-terrorist-bombing-celebrities-respond-joey-mcintyre-anderson-cooper-twitter-0415/","source":"Celebrity Dirty Laundry","description":"We all received the devastating of the bombs going off at the finish line of the Boston Marathon, and the entire city seems to be in high alert after the police issued a lockdown. Right now, the whole country’s thoughts and prayers are with the people ...","date":"2013-04-15T20:37:08Z"},{"title":"How Not To Respond to the Boston Marathon Bombings","url":"http://inthesetimes.com/duly-noted/entry/14882/how_not_to_respond_to_the_boston_marathon_bombings","source":"In These Times","description":"When I heard that explosions had torn through the finish line at the Boston Marathon, my first thought was, “Is Dr. Cullen OK?” Dr. Cullen is my family doctor, a brilliant and compassionate physician who has cared for my family for three generations.","date":"2013-04-14T23:58:45Z"},{"title":"Pastors Respond to Boston Marathon Bombings, Some Pray for Suspect","url":"http://www.christianitytoday.com/gleanings/2013/april/pastors-respond-to-boston-marathon-bombings-some-pray-for.html","source":"christianitytoday","description":"Update (April 22): The police shootout that killed one of the suspected marathon bombers, Tamerlan Tsarnaev, took place outside the Watertown home of a Southern Baptist church planter. The pastor, who shared his story with Baptist Press, is part of the ...","date":"2013-04-15T23:57:34Z"},{"title":"Boston Marathon Bombing - WMBFNews.com, Myrtle Beach/Florence SC, Weather","url":"http://www.wmbfnews.com/category/262377/boston-marathon-bombing","source":"WMBF NEWS","description":"ASHEVILLE, NC (WAVE) - A Louisville native and her fiance, both of whom were severely injured in the Boston Marathon bombing, will be married Friday in a dream ceremony they won, and it will be streamedMore >> No matter your fitness level, or whether you ...","date":"2014-04-05T17:46:40Z"},{"title":"3 dead, more than 140 hurt from Boston Marathon bomb blasts","url":"http://www.wistv.com/story/21982414/3-dead-more-than-140-hurt-from-boston-marathon-bomb-blasts","source":"WIS-TV","description":"BOSTON (RNN) - While people fight for their lives at local hospitals, the search is on for possible motives and suspects in Monday's deadly bombing at the Boston Marathon. At least three people are dead and more than 140 are injured after back-to-back ...","date":"2013-04-15T20:01:21Z"},{"title":"Undeterred by bombings, local runners return to Boston Marathon","url":"http://www.wwltv.com/news/After-Bombings-Louisiana-Runners-Gear-Up-For-Boston-Marathon-231840311.html","source":"WWL-TV","description":"NEW ORLEANS -- This spring runners from across the metro area will return to Boston to conquer a 26.2 mile elite race. Marathons test a person's physical endurance, but in April, the Boston Marathon will test many athletes emotional resolve. WWL-TV's Tania ...","date":"2013-11-14T04:35:52Z"},{"title":"Boston Marathon Bombings - NewsChannel5.com | Nashville News, Weather & Sports","url":"http://www.newschannel5.com/category/262442/boston-marathon-bombings","source":"WTVF","description":"A 29-year-old preschool teacher who lost most of her left leg in the Boston Marathon bombing left the hospital Monday.more>> A 29-year-old preschool teacher who lost most of her left leg in the Boston Marathon bombing left the hospital Monday, saying she ...","date":"2013-06-04T12:49:49Z"},{"title":"Boston Marathon Bombing - WSMV Channel 4","url":"http://www.wsmv.com/category/262377/boston-marathon-bombing","source":"WSMV","description":"From inside the cinder block walls of the emergency department at Massachusetts Eye and Ear Infirmary, with just 10 rooms total, it was hard to tell that April 15 had gone from simply a normal day to a moment that...More >> From inside the cinder block ...","date":"2014-03-22T02:11:13Z"},{"title":"Boston Marathon Bombing - WAFB 9 News Baton Rouge, Louisiana News, Weather, Sports","url":"http://www.wafb.com/category/262377/boston-marathon-bombing","source":"WAFB 9 Baton Rouge","description":"The defense team for Boston Marathon bombing suspect Dzhokhar Tsarnaev is looking for ways to show his deceased older brother was mostly responsible for the tragedy - a move that, if successful, could save their...More >>","date":"2013-05-16T17:15:44Z"},{"title":"3 dead, more than 140 hurt from Boston Marathon bomb blasts","url":"http://www.nbc12.com/story/21982414/3-dead-more-than-140-hurt-from-boston-marathon-bomb-blasts","source":"NBC 12","description":"BOSTON (RNN) - While people fight for their lives at local hospitals, the search is on for possible motives and suspects in Monday's deadly bombing at the Boston Marathon. At least three people are dead and more than 140 are injured after back-to-back ...","date":"2013-07-14T19:54:50Z"},{"title":"Boston Marathon Bombing - WAFB 9 News Baton Rouge, Louisiana News, Weather, Sports","url":"http://www.wafb.com/category/262377/boston-marathon-bombing","source":"WAFB 9 Baton Rouge","description":"The defense team for Boston Marathon bombing suspect Dzhokhar Tsarnaev is looking for ways to show his deceased older brother was mostly responsible for the tragedy - a move that, if successful, could save their...More >>","date":"2013-05-16T17:15:44Z"},{"title":"3 dead, more than 140 hurt from Boston Marathon bomb blasts","url":"http://www.nbc12.com/story/21982414/3-dead-more-than-140-hurt-from-boston-marathon-bomb-blasts","source":"NBC 12","description":"BOSTON (RNN) - While people fight for their lives at local hospitals, the search is on for possible motives and suspects in Monday's deadly bombing at the Boston Marathon. At least three people are dead and more than 140 are injured after back-to-back ...","date":"2013-07-14T19:54:50Z"},{"title":"Boston Marathon Bombing - WAFB 9 News Baton Rouge, Louisiana News, Weather, Sports","url":"http://www.wafb.com/category/262377/boston-marathon-bombing","source":"WAFB 9 Baton Rouge","description":"The defense team for Boston Marathon bombing suspect Dzhokhar Tsarnaev is looking for ways to show his deceased older brother was mostly responsible for the tragedy - a move that, if successful, could save their...More >>","date":"2013-05-16T17:15:44Z"},{"title":"3 dead, more than 140 hurt from Boston Marathon bomb blasts","url":"http://www.nbc12.com/story/21982414/3-dead-more-than-140-hurt-from-boston-marathon-bomb-blasts","source":"NBC 12","description":"BOSTON (RNN) - While people fight for their lives at local hospitals, the search is on for possible motives and suspects in Monday's deadly bombing at the Boston Marathon. At least three people are dead and more than 140 are injured after back-to-back ...","date":"2013-07-14T19:54:50Z"},{"title":"Boston Marathon Bombing - WAFB 9 News Baton Rouge, Louisiana News, Weather, Sports","url":"http://www.wafb.com/category/262377/boston-marathon-bombing","source":"WAFB 9 Baton Rouge","description":"The defense team for Boston Marathon bombing suspect Dzhokhar Tsarnaev is looking for ways to show his deceased older brother was mostly responsible for the tragedy - a move that, if successful, could save their...More >>","date":"2013-05-16T17:15:44Z"},{"title":"3 dead, more than 140 hurt from Boston Marathon bomb blasts","url":"http://www.nbc12.com/story/21982414/3-dead-more-than-140-hurt-from-boston-marathon-bomb-blasts","source":"NBC 12","description":"BOSTON (RNN) - While people fight for their lives at local hospitals, the search is on for possible motives and suspects in Monday's deadly bombing at the Boston Marathon. At least three people are dead and more than 140 are injured after back-to-back ...","date":"2013-07-14T19:54:50Z"},{"title":"Boston Marathon Bombing - WAFB 9 News Baton Rouge, Louisiana News, Weather, Sports","url":"http://www.wafb.com/category/262377/boston-marathon-bombing","source":"WAFB 9 Baton Rouge","description":"The defense team for Boston Marathon bombing suspect Dzhokhar Tsarnaev is looking for ways to show his deceased older brother was mostly responsible for the tragedy - a move that, if successful, could save their...More >>","date":"2013-05-16T17:15:44Z"},{"title":"3 dead, more than 140 hurt from Boston Marathon bomb blasts","url":"http://www.nbc12.com/story/21982414/3-dead-more-than-140-hurt-from-boston-marathon-bomb-blasts","source":"NBC 12","description":"BOSTON (RNN) - While people fight for their lives at local hospitals, the search is on for possible motives and suspects in Monday's deadly bombing at the Boston Marathon. At least three people are dead and more than 140 are injured after back-to-back ...","date":"2013-07-14T19:54:50Z"},{"title":"Boston Marathon Bombing - WAFB 9 News Baton Rouge, Louisiana News, Weather, Sports","url":"http://www.wafb.com/category/262377/boston-marathon-bombing","source":"WAFB 9 Baton Rouge","description":"The defense team for Boston Marathon bombing suspect Dzhokhar Tsarnaev is looking for ways to show his deceased older brother was mostly responsible for the tragedy - a move that, if successful, could save their...More >>","date":"2013-05-16T17:15:44Z"},{"title":"3 dead, more than 140 hurt from Boston Marathon bomb blasts","url":"http://www.nbc12.com/story/21982414/3-dead-more-than-140-hurt-from-boston-marathon-bomb-blasts","source":"NBC 12","description":"BOSTON (RNN) - While people fight for their lives at local hospitals, the search is on for possible motives and suspects in Monday's deadly bombing at the Boston Marathon. At least three people are dead and more than 140 are injured after back-to-back ...","date":"2013-07-14T19:54:50Z"},{"title":"Boston Marathon Bombing - WAFB 9 News Baton Rouge, Louisiana News, Weather, Sports","url":"http://www.wafb.com/category/262377/boston-marathon-bombing","source":"WAFB 9 Baton Rouge","description":"The defense team for Boston Marathon bombing suspect Dzhokhar Tsarnaev is looking for ways to show his deceased older brother was mostly responsible for the tragedy - a move that, if successful, could save their...More >>","date":"2013-05-16T17:15:44Z"},{"title":"3 dead, more than 140 hurt from Boston Marathon bomb blasts","url":"http://www.nbc12.com/story/21982414/3-dead-more-than-140-hurt-from-boston-marathon-bomb-blasts","source":"NBC 12","description":"BOSTON (RNN) - While people fight for their lives at local hospitals, the search is on for possible motives and suspects in Monday's deadly bombing at the Boston Marathon. At least three people are dead and more than 140 are injured after back-to-back ...","date":"2013-07-14T19:54:50Z"},{"title":"Boston Marathon Bombing - WAFB 9 News Baton Rouge, Louisiana News, Weather, Sports","url":"http://www.wafb.com/category/262377/boston-marathon-bombing","source":"WAFB 9 Baton Rouge","description":"The defense team for Boston Marathon bombing suspect Dzhokhar Tsarnaev is looking for ways to show his deceased older brother was mostly responsible for the tragedy - a move that, if successful, could save their...More >>","date":"2013-05-16T17:15:44Z"},{"title":"3 dead, more than 140 hurt from Boston Marathon bomb blasts","url":"http://www.nbc12.com/story/21982414/3-dead-more-than-140-hurt-from-boston-marathon-bomb-blasts","source":"NBC 12","description":"BOSTON (RNN) - While people fight for their lives at local hospitals, the search is on for possible motives and suspects in Monday's deadly bombing at the Boston Marathon. At least three people are dead and more than 140 are injured after back-to-back ...","date":"2013-07-14T19:54:50Z"},{"title":"Boston Marathon Bombing - WAFB 9 News Baton Rouge, Louisiana News, Weather, Sports","url":"http://www.wafb.com/category/262377/boston-marathon-bombing","source":"WAFB 9 Baton Rouge","description":"The defense team for Boston Marathon bombing suspect Dzhokhar Tsarnaev is looking for ways to show his deceased older brother was mostly responsible for the tragedy - a move that, if successful, could save their...More >>","date":"2013-05-16T17:15:44Z"},{"title":"3 dead, more than 140 hurt from Boston Marathon bomb blasts","url":"http://www.nbc12.com/story/21982414/3-dead-more-than-140-hurt-from-boston-marathon-bomb-blasts","source":"NBC 12","description":"BOSTON (RNN) - While people fight for their lives at local hospitals, the search is on for possible motives and suspects in Monday's deadly bombing at the Boston Marathon. At least three people are dead and more than 140 are injured after back-to-back ...","date":"2013-07-14T19:54:50Z"}],"rebekah":[{"title":"One Year After the Boston Marathon Bombing, This Couple Has a Happy Ending","url":"https://shine.yahoo.com/ellen-good-news/one-boston-marathon-bombing-couple-happy-ending-215200834.html","source":"Shine Yahoo","description":"Pete DiMartino and Rebekah Gregory are one of Ellen's favorite couples who have appeared on the show. The pair spoke with the host last October after getting engaged six months after surviving the Boston Marathon bombing. On April 4 -- nearly a year after ...","date":"2014-04-07T21:47:40Z"},{"title":"Boston Stronger: How Two Boston Marathon Bombing Victims Survived—and Fell in Love","url":"http://www.glamour.com/inspired/2014/03/boston-marathon-bombing-victims-engaged-getting-married","source":"Glamour","description":"The bombings at the Boston Marathon one year ago left four people dead and 264 seriously injured. But Rebekah Gregory and Pete DiMartino didn't just survive—they fell in love. And on April 21 they'll be back at the race...this time as newlyweds.","date":"2014-01-01T23:55:51Z"}],"marathon finish line":[{"title":"Marathon Medical Response Strengthened After Bombing","url":"http://boston.cbslocal.com/2014/04/06/marathon-medical-response-strengthened-after-bombing/","source":"boston.cbslocal.com","description":"BOSTON (CBS) – On Marathon Monday Boston hospitals and first responders are always prepared to see runners with the typical injuries of cramping or dehydration. But when tragedy struck at the finish line in 2013, years of intense training and ...","date":"2014-04-06T10:43:08Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"},{"title":"'Massive' explosions hit Boston Marathon finish line","url":"http://www.bizjournals.com/boston/news/2013/04/15/bomb-explosion-boston-marathon-finish.html","source":"The Business Journal","description":"Two \"massive\" explosions occurred near the Boston Marathon finish line at 2:50 p.m. Monday, Boston police said, resulting in at least three dead and more than 100 injured. At least two explosions occurred 50 to 100 yards apart, Boston Police ...","date":"2013-06-22T10:19:37Z"}],"demar teen nose":[{"title":"Instant Index: Boston Marathon Bombing Survivors Married","url":"http://abcnews.go.com/WNT/video/instant-index-boston-marathon-bombing-survivors-married-23209133","source":"ABC News","description":"David Muir reveals the stories people have been buzzing about all week.","date":"2014-04-05T21:57:12Z"}],"copley square":[{"title":"Boston marathon bombing exhibit seeks to remember, heal","url":"http://www.latimes.com/nation/nationnow/la-na-nn-boston-marathon-bombing-exhibit-seeks-to-remember-and-heal-20140331,0,5041237.story","source":"Los Angeles Times","description":"There are five well-known stages of grief, from denial and anger through bargaining and depression. As the first anniversary of the Boston marathon bombing approaches, the city is moving toward the final stage: acceptance. As part of that process, the city ...","date":"2014-03-31T19:04:11Z"}],"dzhokhar tsarnaev":[{"title":"Timeline: The Boston Marathon bombing, manhunt and investigation","url":"http://www.cnn.com/2013/05/01/justice/boston-marathon-timeline/index.html","source":"CNN","description":"(CNN)-- After twin blasts shook Boston -- killing three and wounding more than 260 others -- investigators sprung into action looking for those responsible. New details emerged about that probe Wednesday, when three friends of surviving bombing ...","date":"2013-05-01T22:12:42Z"},{"title":"Docs: Dead Boston Marathon Bombing Suspect Tied to 2011 Triple Murder","url":"http://www.theblaze.com/stories/2013/10/22/docs-dead-boston-marathon-bombing-suspect-tied-to-2011-triple-murder/","source":"Theblaze","description":"BOSTON (AP) — Slain Boston Marathon bombing suspect Tamerlan Tsarnaev was named as a participant in an earlier triple homicide by a man who was subsequently shot to death while being questioned by authorities, according to a filing made by federal ...","date":"2013-10-23T04:19:00Z"},{"title":"Boston Marathon bombing suspect is alive and in custody","url":"http://www.wzzm13.com/news/article/253398/280/Boston-on-lockdown-as-police-search-for-bomb-suspect","source":"WZZM 13","description":"WATERTOWN, Mass. (USA TODAY) -- Police captured Boston Marathon bombing suspect Dzhokhar Tsarnaev Friday night, ending a tense, five-day drama that gripped Massachusetts with fear and rekindled the specter of terror across the nation. Police arrested the ...","date":"2013-04-19T16:00:23Z"}],"marathon sports":[{"title":"Marathon Sports prepares for emotional race day","url":"http://www.bostonglobe.com/business/2014/04/06/marathon-sports-prepares-for-emotional-race-day/G7FbB4HmSPv6wz4TCXCPeI/story.html","source":"The Boston Globe","description":"The store’s proximity to the Boston Marathon bombings — right next to one of the explosions — has made it a powerful empathetic force, driving friends and strangers to connect with staff who were there at the time. Nearly a year later ...","date":"2014-04-07T15:56:55Z"},{"title":"Boston bombing witness recalls carnage one year on","url":"http://usatoday30.usatoday.com/video/boston-bombing-witness-recalls-carnage-one-year-on/3436838750001","source":"usatoday30.usatoday.com","description":"Marathon Sports is just meters from where the first blast went off at 2013's Boston Marathon, and it quickly became a triage and treatment center for the injured. Duration: 01:08 Video provided by AFP","date":"2014-04-04T23:52:55Z"}],"longtime mayor":[{"title":"Former Boston Mayor Tom Menino reflects on Marathon bombings","url":"http://www.myfoxboston.com/story/25186682/2014/04/07/former-boston-mayor-tom-menino-reflects-on-marathon-bombings","source":"My Fox Boston","description":"(MyFoxBoston.com) -- FOX 25's Maria Stephanos sat down with former Boston Mayor Tom Menino for his reflections as the anniversary of the Boston Marathon bombings approaches. The mayor spoke about how everyone responded after accused bomber ...","date":"2014-04-07T20:36:06Z"}],"deceased sister bay":[{"title":"Today's Take: After Boston bombing, 'I figured I would change my life'","url":"http://www.doorcountyadvocate.com/article/20140405/GPG0101/304050325/Today-s-Take-After-Boston-bombing-figured-would-change-my-life-","source":"Door County Advocate","description":"Watch Green Bay area residents Carrie Miller and Jeremy Metzler talk about what they remember from the bombings at the 2013 Boston Marathon and what they expect from this year’s event online at greenbaypressgazette.com. It’s a powerful word ...","date":"2014-04-06T06:32:36Z"}],"governor deval patrick":[{"title":"Lessons from the Boston Marathon Bombings","url":"http://www.bu.edu/today/2014/lessons-from-the-boston-marathon-bombings/","source":"Boston University","description":"Few could have imagined last year’s Boston Marathon bombings. What the bombers themselves likely didn’t imagine was that they were attacking a city that had relentlessly drilled for such a catastrophe—not just security personnel, but players usually ...","date":"2014-03-26T03:39:32Z"},{"title":"Boston Marathon Bomb Tragedy","url":"http://gonewengland.about.com/b/2013/04/17/boston-marathon-bomb-tragedy.htm","source":"gonewengland.about.com","description":"The Boston Marathon, a tradition since 1897 that takes place on the iconic Patriots Day holiday, was disrupted at 2:50 p.m. EDT Monday by two bomb explosions that left three dead and more than 170 injured. A third, apparently unrelated explosion ...","date":"2013-04-16T04:58:13Z"}],"jeff bauman":[{"title":"Boston Marathon Bombing","url":"http://time.com/tag/boston-marathon-bombing/","source":"Time","description":"The FBI refuted a claim made by the attorneys for Boston Marathon bombing suspect Dzhokhar Tsarnaev that his brother Tamerlan, who died in a shootout with police, was asked by the agency to become an informant (BOSTON) — Boston Marathon bombing suspect ...","date":"2014-03-25T14:46:26Z"}],"law enforcement":[{"title":"Boston Marathon bomb response exposed 'fault lines' in policing: study","url":"http://news.yahoo.com/boston-marathon-bomb-response-exposed-fault-lines-policing-070452110--sector.html","source":"Yahoo! News","description":"BOSTON (Reuters) - The massive manhunt for the perpetrators of last year's Boston Marathon bomb attack exposed some \"fault lines\" in coordinating law enforcement at the federal, state and local levels, according to a study released on Thursday. Emergency ...","date":"2014-04-03T07:04:48Z"},{"title":"After Boston Marathon bombings, coordination then chaos, report says","url":"http://www.alaskadispatch.com/article/20140404/after-boston-marathon-bombings-coordination-then-chaos-report-says","source":"Alaska Dispatch","description":"The response to the Boston Marathon bombing that killed three and wounded 260 a year ago was remarkably effective in the immediate aftermath but unduly chaotic during the day-long search for the suspects later that week, according to a new ...","date":"2014-04-04T12:54:22Z"},{"title":"How The Boston Marathon Bombing Investigation Will Be Conducted","url":"http://www.forbes.com/sites/gregorymcneal/2013/04/15/how-will-the-boston-marathon-bombing-investigation-be-conducted/","source":"Forbes","description":"As law enforcement flocks to the scene of the bombings at the Boston Marathon, the information they are able to gather at the scene of the attack will be critically important in identifying suspects and building a criminal case against them.","date":"2013-04-14T23:58:45Z"},{"title":"Law Enforcement Finally Tracks Down, Captures Boston Marathon Bombing Suspect","url":"http://newyork.cbslocal.com/2013/04/19/boston-marathon-suspect-shot-dead/","source":"Cbslocal","description":"WATERTOWN, Mass. (CBSNewYork/AP) — Following an intense manhunt that caused chaos in Massachusetts and riveted the rest of the nation, law enforcement finally captured the second Boston Marathon bombing suspect on Friday night. Following a short standoff ...","date":"2013-04-20T10:51:23Z"},{"title":"Boston Marathon bombing suspects are brothers of Chechen origin, say reports","url":"http://www.ndtv.com/article/world/boston-marathon-bombing-suspects-are-brothers-of-chechen-origin-say-reports-356286","source":"NDTV","description":"Watertown: The two suspects in Monday's Boston Marathon bombing have been identified as men from Chechnya. Earlier today they killed a police officer at the MIT campus, injured a transit officer in a firefight and threw explosive devices at police during ...","date":"2013-04-19T11:14:03Z"},{"title":"FBI release Boston Marathon bomb details","url":"http://www.aljazeera.com/news/americas/2013/04/2013416152112944580.html","source":"AJE Al Jazeera English","description":"Images show a backpack and apparent fragments of a pressure cooker as bureau probes attack that left three people dead. Federal Bureau of Investigation (FBI) agents have said the Boston Marathon bombing was carried out with kitchen pressure cookers packed ...","date":"2013-04-17T17:35:49Z"}],"reading experience":[{"title":"Exclusive: Aunt of Marathon victim Lu Lingzi speaks about loss, moving forward","url":"http://www.wcvb.com/news/exclusive-aunt-of-marathon-victim-lu-lingzi-speaks-about-loss-moving-forward/25364252","source":"WCVB | WCVB Boston","description":"LU LINGZI CAME FOR COLLEGE AND SHE DIED IN THE BOSTON MARATHON BOMBING ATTACK. WE HAVE NOT HEARD FROM HER FAMILY UNTIL TONIGHT. THEY SPOKE -- WE SPOKE EXCLUSIVELY TO HER AUNT. SHE LOVED BOSTON. THE FOOD, THE CULTURE, AND ONE TIME SHE TOLD ME ...","date":"2014-04-07T19:38:50Z"},{"title":"Boston Marathon bombing exhibit displays shoes, runners' bibs","url":"http://www.wmur.com/news/boston-marathon-bombing-exhibit-displays-shoes-runners-bibs/25246644","source":"WMUR-TV","description":"After the twin bombings at the Boston Marathon last April, mourners began leaving thousands of items at a makeshift memorial near the finish line to honor the victims of the attacks. Some left teddy bears, signs and marathon bibs while others draped ...","date":"2014-03-31T15:15:07Z"}],"erika brannock":[{"title":"Md. Teacher Who Lost Part Of Her Leg In Boston Marathon Bombing Throws Out First Pitch","url":"http://baltimore.cbslocal.com/2014/04/04/md-teacher-who-lost-part-of-her-leg-in-boston-marathon-bombing-throws-out-first-pitch/","source":"CBS Baltimore","description":"BALTIMORE (WJZ) — It was a very special moment at Camden Yards Thursday night when Erika Brannock, the Maryland teacher who lost part of her leg in the Boston Marathon bombing, took the mound. Brannock threw out the first pitch at the game ...","date":"2014-04-04T11:21:18Z"}],"red sox":[{"title":"Boston Red Sox found inspiration through the resilience of a city and its people","url":"http://msn.foxsports.com/other/story/boston-red-sox-found-inspiration-through-the-resillence-of-a-city-and-its-people-040414","source":"FOX Sports","description":"(In the coming weeks, you'll see in our series at FOXSports.com what the Boston bombing means to more than two dozen people directly affected at last year's marathon. So 2014 is the comeback, because 2013 was the knockdown. This is the next ...","date":"2014-04-04T12:54:22Z"},{"title":"Milwaukee Brewers (1-2) at Boston Red Sox (2-1), 2:05 p.m. (ET)","url":"http://www.newsobserver.com/2014/04/04/3757763/milwaukee-brewers-1-2-at-boston.html","source":"The News & Observer","description":"(SportsNetwork.com) - The Boston Red Sox will raise their third World Series championship banner in 10 years on Friday when they start a three-game series with the Milwaukee Brewers in the 114th home opener and 103rd at Fenway Park. The Sox are ...","date":"2014-04-04T14:20:16Z"},{"title":"Ryan Braun hears jeers during 0-for-5 game at Boston","url":"http://seattletimes.com/html/mariners/2023304588_baseballnotes05xml.html","source":"The Seattle Times","description":"BOSTON — From the boos to the bad at-bats, Ryan Braun’s first road game since his 65-game suspension was a rough afternoon. He went 0 for 5 against the Red Sox on Friday. But he was 5 for 5 in getting hooted by Fenway Park’s passionate fans.","date":"2014-04-03T23:54:07Z"},{"title":"Red Sox Receive Their World Series Rings From Marathon Survivors","url":"http://www.yardbarker.com/mlb/articles/red_sox_receive_their_world_series_rings_from_marathon_survivors/16185022","source":"Yardbarker","description":"In one of the classiest moves you’ll see this year, the Boston Red Sox had some marathon bombing survivors and family members deliver the World Series Rings to the players. Definitely a great look from the organization and these rings look absolutely ...","date":"2014-04-02T23:55:18Z"},{"title":"Red Sox Receive Their World Series Rings From Marathon Survivors","url":"http://www.yardbarker.com/mlb/articles/red_sox_receive_their_world_series_rings_from_marathon_survivors/16185022","source":"Yardbarker","description":"In one of the classiest moves you’ll see this year, the Boston Red Sox had some marathon bombing survivors and family members deliver the World Series Rings to the players. Definitely a great look from the organization and these rings look absolutely ...","date":"2014-04-02T23:55:18Z"},{"title":"Red Sox Receive Their World Series Rings From Marathon Survivors","url":"http://www.yardbarker.com/mlb/articles/red_sox_receive_their_world_series_rings_from_marathon_survivors/16185022","source":"Yardbarker","description":"In one of the classiest moves you’ll see this year, the Boston Red Sox had some marathon bombing survivors and family members deliver the World Series Rings to the players. Definitely a great look from the organization and these rings look absolutely ...","date":"2014-04-02T23:55:18Z"},{"title":"Red Sox Receive Their World Series Rings From Marathon Survivors","url":"http://www.yardbarker.com/mlb/articles/red_sox_receive_their_world_series_rings_from_marathon_survivors/16185022","source":"Yardbarker","description":"In one of the classiest moves you’ll see this year, the Boston Red Sox had some marathon bombing survivors and family members deliver the World Series Rings to the players. Definitely a great look from the organization and these rings look absolutely ...","date":"2014-04-02T23:55:18Z"},{"title":"Red Sox Receive Their World Series Rings From Marathon Survivors","url":"http://www.yardbarker.com/mlb/articles/red_sox_receive_their_world_series_rings_from_marathon_survivors/16185022","source":"Yardbarker","description":"In one of the classiest moves you’ll see this year, the Boston Red Sox had some marathon bombing survivors and family members deliver the World Series Rings to the players. Definitely a great look from the organization and these rings look absolutely ...","date":"2014-04-02T23:55:18Z"},{"title":"Red Sox Receive Their World Series Rings From Marathon Survivors","url":"http://www.yardbarker.com/mlb/articles/red_sox_receive_their_world_series_rings_from_marathon_survivors/16185022","source":"Yardbarker","description":"In one of the classiest moves you’ll see this year, the Boston Red Sox had some marathon bombing survivors and family members deliver the World Series Rings to the players. Definitely a great look from the organization and these rings look absolutely ...","date":"2014-04-02T23:55:18Z"},{"title":"Red Sox Receive Their World Series Rings From Marathon Survivors","url":"http://www.yardbarker.com/mlb/articles/red_sox_receive_their_world_series_rings_from_marathon_survivors/16185022","source":"Yardbarker","description":"In one of the classiest moves you’ll see this year, the Boston Red Sox had some marathon bombing survivors and family members deliver the World Series Rings to the players. Definitely a great look from the organization and these rings look absolutely ...","date":"2014-04-02T23:55:18Z"},{"title":"Red Sox Receive Their World Series Rings From Marathon Survivors","url":"http://www.yardbarker.com/mlb/articles/red_sox_receive_their_world_series_rings_from_marathon_survivors/16185022","source":"Yardbarker","description":"In one of the classiest moves you’ll see this year, the Boston Red Sox had some marathon bombing survivors and family members deliver the World Series Rings to the players. Definitely a great look from the organization and these rings look absolutely ...","date":"2014-04-02T23:55:18Z"},{"title":"Red Sox Receive Their World Series Rings From Marathon Survivors","url":"http://www.yardbarker.com/mlb/articles/red_sox_receive_their_world_series_rings_from_marathon_survivors/16185022","source":"Yardbarker","description":"In one of the classiest moves you’ll see this year, the Boston Red Sox had some marathon bombing survivors and family members deliver the World Series Rings to the players. Definitely a great look from the organization and these rings look absolutely ...","date":"2014-04-02T23:55:18Z"}],"118th boston marathon":[{"title":"BOSTON MARATHON: Hingham man running on team honoring Martin Richard","url":"http://www.wickedlocal.com/article/20140403/News/140408179","source":"Wicked Local","description":"Martin W. Richard was an 8-year-old boy killed in the Boston Marathon bombings on April 15, 2013. The Richard family established the Martin W. Richard Charitable Foundation (Team MR8) to honor Martin’s message of peace by investing in ...","date":"2014-04-05T08:56:57Z"}],"armored vehicles":[{"title":"Lessons Learned from the Boston Marathon Bombing","url":"http://www.ammoland.com/2014/03/lessons-learned-from-the-boston-marathon-bombing/","source":"AmmoLand.com - Shooting Sports News","description":"Pittsfield, MA --(Ammoland.com)- In many ways, the Boston Marathon bombing incident served as a wakeup call. Those in the law enforcement community and the public who may have harbored somewhat of an “It’s never going to happen here” sentiment were ...","date":"2014-03-20T23:56:24Z"},{"title":"5 critical lessons about armored vehicles from the Boston Marathon Bombing","url":"http://www.policeone.com/police-products/vehicles/specialty/articles/6990737-5-critical-lessons-about-armored-vehicles-from-the-Boston-Marathon-Bombing/","source":"Police one.com","description":"In many ways, the Boston Marathon bombing incident served as a wakeup call. Those in the law enforcement community and the public who may have harbored somewhat of an “It’s never going to happen here” sentiment were faced with the hard reality of the ...","date":"2014-03-19T21:34:25Z"}],"lt. ed walsh":[{"title":"Timeline of Boston Fire","url":"http://www.theepochtimes.com/n3/605938-timeline-of-boston-fire/","source":"The Epoch Times","description":"Honoring the fallen is part of the process of healing. Less than one year from the Boston Marathon Bombing, the city mourns another tragic event. The loss of the lives of two Boston firefighters has again left us shaken. Within hours of the ...","date":"2014-04-07T09:44:41Z"}],"boston marathon bombings":[{"title":"Man who lost legs in Boston Marathon bombing is engaged","url":"http://www.aol.com/article/2014/03/23/man-who-lost-legs-in-boston-marathon-bombing-is-engaged/20854930/","source":"AOL Travel News","description":"Jeff Bauman, who lost both legs in the Boston Marathon bombings, then helped authorities identify the suspects, poses with his expectant fiancé, Erin Hurley, at their home in Carlisle, Mass. Standing on artificial legs, Boston Marathon bombing ...","date":"2014-03-23T18:59:21Z"},{"title":"Couple seriously hurt in Boston Marathon bombings gets engaged","url":"http://www.nbcnews.com/news/other/couple-seriously-hurt-boston-marathon-bombings-gets-engaged-f8C11352102","source":"NBC News","description":"A young couple still battling to recover from serious injuries they suffered in the Boston Marathon bombings is taking their relationship to another level: they’re getting married. Pete DiMartino, 28, asked Rebekah Gregory, 26, on Friday if she would tie ...","date":"2013-10-08T08:04:23Z"},{"title":"Dzhokhar Tsarnaev Charged In Boston Marathon Bombings","url":"http://www.inquisitr.com/630256/dzhokhar-tsarnaev-charged-in-boston-marathon-bombings/","source":"The Inquisitr","description":"Dzhokhar Tsarnaev was charged in the Boston Marathon bombings on Monday in a sealed complaint. The charges came during his initial court appearance, which was conducted in his hospital room by a federal magistrate. The announcement was made by Gary H.","date":"2013-04-21T23:57:37Z"},{"title":"Muslim Woman Attacked After Boston Marathon Bombings","url":"http://newsone.com/2396424/heba-abolaban-boston-marathon-bombings-terrorist/","source":"News One","description":"A Muslim woman living in Boston told the Malden Patch that she was attacked by a crazed man Wednesday morning in an apparent hate crime related to Monday’s Boston Marathon bombings. RELATED: Official: 12 Bodies Recovered After West Texas Blast Heba ...","date":"2013-04-19T16:43:20Z"},{"title":"Mother and daughter injured at Boston Marathon bombing reunite at hospital","url":"http://rockcenter.nbcnews.com/_news/2013/04/19/17831617-mother-and-daughter-injured-at-boston-marathon-bombing-reunite-at-hospital","source":"Rock Center with Brian Williams","description":"Sydney Corcoran and her mother Celeste were both seriously injured in the Boston Marathon bombings on Monday. Sydney, a high school senior, suffered shrapnel wounds to her legs and severed her femoral artery. Her mother lost both legs below the knees.","date":"2013-04-18T23:54:01Z"},{"title":"David Ortiz drops F-bomb during Boston Marathon ceremony (Video)","url":"http://larrybrownsports.com/baseball/david-ortiz-f-bomb-boston-marathon/184712","source":"larrybrownsports.com","description":"Like the Bruins before them, the Red Sox spent a good deal of time before their opening pitch on Saturday paying tribute to those who were affected by the Boston Marathon bombings. The organization held a moment of silence for those who lost their lives ...","date":"2013-04-20T18:29:31Z"}],"suspect no.":[{"title":"Boston Marathon Bombing Suspect Captured","url":"http://pittsburgh.cbslocal.com/2013/04/19/image-leads-to-hunt-for-boston-bombing-suspect/","source":"pittsburgh.cbslocal.com","description":"WATERTOWN, Mass. (AP) – Boston Police say a 19-year-old college student wanted in the Boston Marathon bombings is in custody after a manhunt that left the city virtually paralyzed and his older brother and accomplice dead. Police announced via Twitter ...","date":"2013-04-18T23:54:01Z"}],"social media":[{"title":"SOCIAL MEDIA VENT : New Report Tracks How Boston Police Leveraged Social Media During Boston Marathon Bombings","url":"http://www.4-traders.com/SOCIAL-MEDIA-VENT-3517015/news/SOCIAL-MEDIA-VENT--New-Report-Tracks-How-Boston-Police-Leveraged-Social-Media-During-Boston-Maratho-18225723/","source":"4 Traders","description":"\" The Boston Police Department has long embraced both community policing and the use of social media,\" the report begins. \"The department put its experience to good and highly visible use in April 2013 during the dramatic, rapidly developing investigation ...","date":"2014-04-08T10:47:56Z"}],"finish line":[{"title":"Boston Bombing: Top 10 Facts You Need to Know","url":"http://www.heavy.com/news/2013/04/boston-marathon-bombing-top-10-facts/","source":"heavy.com","description":"A day of athletic celebration turned into chaos on Monday at the Boston Marathon after two bombs exploded near the finish line. The attack is being treated as terroristic, however, it is not known whether the origin of the bombs were domestic or international.","date":"2013-04-16T11:53:24Z"},{"title":"A look at Boston Marathon bombing, investigation","url":"http://www.9news.com/rss/article/332302/188/A-look-at-Boston-Marathon-bombing-investigation-","source":"9News","description":"Two explosions near the finish line of the Boston Marathon on April 15 killed three people and wounded more than 200 others. Authorities launched a massive manhunt for two suspects seen on surveillance video before one died following a gun battle with ...","date":"2013-04-24T05:46:00Z"},{"title":"Boston Marathon Bombings: United in running","url":"http://www.sheknows.com/health-and-wellness/articles/993135/boston-marathon-bombings-united-in-running","source":"SheKnows","description":"What Megan Searfoss remembered most was how perfect the morning was. The weather, the crowd, the training. She was ready. But the avid runner and founder of the women’s only 5K Run Like a Mother had no idea that the finish line she crossed minutes before ...","date":"2013-05-07T04:26:09Z"},{"title":"Boston Marathon bombings: Updated map of the scene","url":"http://www.sbnation.com/2013/4/15/4228502/boston-marathon-bombings-updated-map","source":"SB Nation","description":"The Boston Globe has an updated map and timeline of the carnage in Boston After a flurry of confusion and chaos, we are starting to get a clearer picture of just what happened at the Boston Marathon bombings. The Boston Globe released an updated ...","date":"2013-04-15T23:43:15Z"},{"title":"Boston Marathon bombings: Suburban apartment searched","url":"http://www.wtsp.com/news/article/311366/81/Boston-Marathon-bombings-Suburban-apartment-searched","source":"10Connects.com","description":"Massachusetts State Police confirm to The Associated Press that a search warrant related to the probe was served Monday night in Revere, but provided no further details. Some investigators were seen leaving the Revere house early Tuesday carrying brown ...","date":"2013-04-16T12:14:52Z"},{"title":"One very dark day in Boston","url":"http://www.heraldtribune.com/article/20140406/ARCHIVES/404061010","source":"Herald Tribune","description":"Even knowing the trajectory of the story of last year's Boston Marathon bombings, and the outcome, listening to Jim Frangione's reading of \"Long Mile Home: Boston Under Attack, The City's Courageous Recovery, and the Epic Hunt for Justice\" is a ...","date":"2014-04-04T11:21:18Z"},{"title":"JFK Library Bombing? 3rd Bomb Suspected Following Boston Marathon 2013 Explosions (VIDEO, PHOTO)","url":"http://www.christianpost.com/news/jfk-library-bombing-3rd-bomb-suspected-following-boston-marathon-2013-explosions-video-photo-93991/","source":"The Christian Post","description":"A third potential bomb explosion has been confirmed at JFK Library in Boston, according to authorities. Earlier, just before 3 p.m. two large bomb explosions were seen at the Boston Marathon route near the finish line, killing at least 2 and injuring at ...","date":"2013-04-16T05:26:51Z"},{"title":"Ala. runners returning to Boston Marathon one year after bombing","url":"http://www.myfoxal.com/story/25060887/ala-man-returning-to-boston-marathon-one-year-after-bombing","source":"Fox 6 WBRC","description":"Two Alabama runners say they will run again in the Boston Marathon one year after the deadly bombing. Vestavia Hills resident Jack Burnette still gets emotional when he thinks back to last year's Boston Marathon and how he came so close to completing it.","date":"2014-04-01T00:47:47Z"},{"title":"'These runners just finished and now they don't have legs': Witnesses recount war zone at end of Boston Marathon as bombs left race course littered with limbs of 25-30 people","url":"http://www.dailymail.co.uk/news/article-2309563/Boston-bombing-2013-pictures-Marathon-blasts-witnesses-recount-war-zone-end.html","source":"Daily Mail","description":"Witnesses have described how twin bomb blasts turned the 26th mile of the Boston Marathon into a war zone, littering the final stretch of the race with disembodied limbs, wounded runners who lost their legs, and a lone shoe with flesh still in it.","date":"2013-04-16T20:21:38Z"},{"title":"FBI seeks images in Boston Marathon bomb inquiry","url":"http://news.cincinnati.com/viewart/20130415/NEWS/304150118/FBI-seeks-images-Boston-Marathon-bomb-inquiry","source":"Cincinnati.com","description":"Police and federal agents appealed to the public Tuesday for amateur video and photos that might yield clues to the Boston Marathon bombing as the chief FBI agent in Boston vowed “we will go to the ends of the Earth” to find whoever carried out the ...","date":"2013-04-15T23:28:56Z"},{"title":"Boston Marathon bombing kills 3, injures over 140","url":"http://www.wkrn.com/story/21982498/2-explosions-at-boston-marathon-finish-line","source":"WKRN","description":"BOSTON (AP) - Two bombs exploded in the crowded streets near the finish line of the Boston Marathon on Monday, killing at least three people and injuring more than 140 in a bloody scene of shattered glass and severed limbs that raised alarms that ...","date":"2013-05-15T20:01:34Z"},{"title":"Boston Marathon bombing kills 3, injures over 140","url":"http://www.wkrn.com/story/21982498/2-explosions-at-boston-marathon-finish-line","source":"WKRN","description":"BOSTON (AP) - Two bombs exploded in the crowded streets near the finish line of the Boston Marathon on Monday, killing at least three people and injuring more than 140 in a bloody scene of shattered glass and severed limbs that raised alarms that ...","date":"2013-05-15T20:01:34Z"},{"title":"Boston Marathon bombing kills 3, injures over 140","url":"http://www.wkrn.com/story/21982498/2-explosions-at-boston-marathon-finish-line","source":"WKRN","description":"BOSTON (AP) - Two bombs exploded in the crowded streets near the finish line of the Boston Marathon on Monday, killing at least three people and injuring more than 140 in a bloody scene of shattered glass and severed limbs that raised alarms that ...","date":"2013-05-15T20:01:34Z"},{"title":"Boston Marathon bombing kills 3, injures over 140","url":"http://www.wkrn.com/story/21982498/2-explosions-at-boston-marathon-finish-line","source":"WKRN","description":"BOSTON (AP) - Two bombs exploded in the crowded streets near the finish line of the Boston Marathon on Monday, killing at least three people and injuring more than 140 in a bloody scene of shattered glass and severed limbs that raised alarms that ...","date":"2013-05-15T20:01:34Z"},{"title":"Boston Marathon bombing kills 3, injures over 140","url":"http://www.wkrn.com/story/21982498/2-explosions-at-boston-marathon-finish-line","source":"WKRN","description":"BOSTON (AP) - Two bombs exploded in the crowded streets near the finish line of the Boston Marathon on Monday, killing at least three people and injuring more than 140 in a bloody scene of shattered glass and severed limbs that raised alarms that ...","date":"2013-05-15T20:01:34Z"},{"title":"Boston Marathon bombing kills 3, injures over 140","url":"http://www.wkrn.com/story/21982498/2-explosions-at-boston-marathon-finish-line","source":"WKRN","description":"BOSTON (AP) - Two bombs exploded in the crowded streets near the finish line of the Boston Marathon on Monday, killing at least three people and injuring more than 140 in a bloody scene of shattered glass and severed limbs that raised alarms that ...","date":"2013-05-15T20:01:34Z"},{"title":"Boston Marathon bombing kills 3, injures over 140","url":"http://www.wkrn.com/story/21982498/2-explosions-at-boston-marathon-finish-line","source":"WKRN","description":"BOSTON (AP) - Two bombs exploded in the crowded streets near the finish line of the Boston Marathon on Monday, killing at least three people and injuring more than 140 in a bloody scene of shattered glass and severed limbs that raised alarms that ...","date":"2013-05-15T20:01:34Z"},{"title":"Boston Marathon bombing kills 3, injures over 140","url":"http://www.wkrn.com/story/21982498/2-explosions-at-boston-marathon-finish-line","source":"WKRN","description":"BOSTON (AP) - Two bombs exploded in the crowded streets near the finish line of the Boston Marathon on Monday, killing at least three people and injuring more than 140 in a bloody scene of shattered glass and severed limbs that raised alarms that ...","date":"2013-05-15T20:01:34Z"},{"title":"Boston Marathon bombing kills 3, injures over 140","url":"http://www.wkrn.com/story/21982498/2-explosions-at-boston-marathon-finish-line","source":"WKRN","description":"BOSTON (AP) - Two bombs exploded in the crowded streets near the finish line of the Boston Marathon on Monday, killing at least three people and injuring more than 140 in a bloody scene of shattered glass and severed limbs that raised alarms that ...","date":"2013-05-15T20:01:34Z"}],"heather abbott":[{"title":"Boston marathon doubles security for upcoming race","url":"http://kfor.com/2014/04/05/boston-marathon-doubles-security-for-upcoming-race/","source":"KFOR-TV","description":"It’s been almost a year since the Boston Marathon bombings. The dozens of victims wounded in the attack, on the road to healing. Some of those victims, returning to the hospital where they were treated immediately after the blasts. Doctors and ...","date":"2014-04-05T17:46:40Z"}],"bombing bomb-sniffing dogs":[{"title":"Boston Marathon Bombing","url":"http://www.opednews.com/articles/Boston-Marathon-Bombing-by-Paul-Craig-Roberts-130420-765.html","source":"OpEdNews","description":"A number of you have asked me my take on the Boston Marathon Bombing and subsequent events. I am flattered that so many look to me for leadership on so many issues. However, I have not followed closely the Boston event. My website hasn't the resources to ...","date":"2013-04-19T23:59:59Z"}],"friday night":[{"title":"Boston Marathon bombing suspects: Second suspect captured, Boston celebrates","url":"http://articles.chicagotribune.com/2013-04-20/news/chi-boston-bombings-20130419_1_boston-marathon-officers-suspect","source":"Chicago Tribune","description":"WATERTOWN, Mass. — Police captured a 19-year-old ethnic Chechen suspected of carrying out the Boston Marathon bombings with his older brother after an intense day-long manhunt on Friday that closed down the city and turned a working-class ...","date":"2013-04-19T10:45:25Z"}],"nbc news":[{"title":"Badly wounded Boston Marathon bombing suspect responding to questions","url":"http://usnews.nbcnews.com/_news/2013/04/21/17848814-badly-wounded-boston-marathon-bombing-suspect-responding-to-questions?lite","source":"NBC News","description":"Despite a serious throat wound preventing him from speaking, the surviving Boston Marathon bombing suspect is beginning to respond to questions from investigators, federal officials tell NBC News. Nearly 48 hours after he was taken into custody following ...","date":"2013-04-21T18:35:29Z"}],"muslim right now.":[{"title":"Boston Marathon Bombing Reaction","url":"http://susris.com/2013/04/16/boston-marathon-bombing-reaction/","source":"susris.com","description":"Two bombs exploded yesterday near the finish line of the Boston Marathon killing three and wounding over 150 bystanders. Local and federal authorities have launched a major investigation to find those responsible for this terrorist attack. This SUSRIS ...","date":"2013-04-15T23:57:34Z"}],"boston red sox":[{"title":"An emotional opening day: Boston Red Sox and Boston Marathon tragedy will always share a connection","url":"http://www.masslive.com/redsox/index.ssf/2014/04/an_emotional_opening_day_bosto.html","source":"Mass Live The Republican","description":"BOSTON -- The questions are often the same: What do the Boston Red Sox have to do with the Boston Marathon bombing? On the whole, they're fair questions. Why does a baseball team assume responsibility for helping a city heal over a monumental tragedy?","date":"2014-04-04T20:25:20Z"}],"boston marathon bombers":[{"title":"Boston Marathon bombing: Live updates on the hunt for suspects","url":"http://www.nj.com/news/index.ssf/2013/04/boston_marathon_bombing_live_b.html","source":"New Jersey Online","description":"BOSTON — Here are the latest developments in the massive manhunt for Boston Marathon bombing suspect Dzhokhar A. Tsarnaev: 8:42 p.m.: Suspect #2 is reported alive and in custody — NBC other news agencies are reporting Tsarnaev is alive and in custody ...","date":"2013-04-20T00:57:15Z"}],"los angeles clippers":[{"title":"Doc Rivers loves how Boston showed resolve after Marathon bombings","url":"http://msn.foxsports.com/other/story/doc-rivers-loves-how-boston-showed-resolve-after-marathon-bombings-040114","source":"FOX Sports","description":"(In the coming weeks, you’ll see in our series at FOXSports.com what the Boston bombing means to more than two dozen people directly affected at last year’s marathon. So 2014 is the comeback, because 2013 was the knockdown. This is our ...","date":"2014-04-01T15:06:46Z"}],"beck":[{"title":"Boston Marathon bombing victim sues Glenn Beck","url":"http://rt.com/usa/glenn-beck-boston-bombing-649/","source":"RT","description":"A Saudi Arabian man injured by one of the two bombs that detonated at last year’s Boston Marathon is suing conservative commentator Glenn Beck in federal court for defamation. Abdulrahman Alharbi, then 20, was among the hundreds hurt during last April ...","date":"2014-04-02T02:19:39Z"}],"death penalty":[{"title":"Prosecutors to seek death penalty in Boston Marathon bombing","url":"http://articles.latimes.com/2014/jan/30/nation/la-na-boston-bombing-20140131","source":"Los Angeles Times","description":"WASHINGTON — Federal prosecutors will seek the death penalty for Dzhokhar Tsarnaev in last year's Boston Marathon bombing, saying in court papers that the deadly plot was committed in an \"especially heinous, cruel and depraved manner.","date":"2014-01-31T14:16:14Z"},{"title":"In Boston, Mixed Reaction to Death Penalty Decision in Marathon Bombings Case","url":"http://thelede.blogs.nytimes.com/2014/01/30/in-boston-mixed-reaction-to-death-penalty-decision-in-marathon-bombings-case/","source":"New York Times Blogs Thelede","description":"When he was a state lawmaker, Martin J. Walsh, the mayor of Boston, voted against the death penalty. On Thursday, he said that he would vote the same way today. But Mr. Walsh also said he supported the judicial process and therefore the Justice ...","date":"2014-01-31T03:03:21Z"},{"title":"Alleged Boston Marathon bomber faces death penalty","url":"http://tracking.si.com/2014/01/30/feds-seek-death-penalty-boston-marathon-bombings/","source":"SI Tracking Blog","description":"Federal prosecutors announced they will seek the death penalty against Dzhokhar Tsarnaev in the Boston Marathon bombings that killed three and wounded more than 260 others, reports the Associated Press. Prosecutors say that Dzhokhar and his older brother ...","date":"2014-01-30T19:10:55Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"},{"title":"U.S. to seek death penalty in Boston Marathon bombing case","url":"http://www.thehindu.com/news/international/world/us-to-seek-death-penalty-in-boston-marathon-bombing-case/article5636454.ece","source":"The Hindu","description":"U.S. Attorney General Eric Holder has announced that he will seek the death penalty for Dzhokhar Tsarnaev (20), suspect in the April 15 2013 Boston Marathon bombing, in which three were killed and 264 injured. In a statement Mr. Holder, who is said to ...","date":"2013-04-14T23:58:45Z"}],"defense team":[{"title":"Boston Marathon Bomb Suspect’s Trial Date Set for Nov. 3","url":"http://www.bloomberg.com/news/2014-02-12/boston-marathon-bomb-suspect-s-trial-date-set-for-nov-3.html","source":"Bloomberg","description":"Dzhokhar Tsarnaev, the accused terrorist who faces a possible death sentence if he’s convicted of bombing last year’s Boston Marathon, will go to trial Nov. 3, almost a year earlier than his lawyers requested. U.S. District Judge George A.","date":"2014-02-12T14:30:38Z"}],"homeland security napolitano":[{"title":"Obama Addresses Boston Marathon Bombing","url":"http://www.weeklystandard.com/blogs/obama-addresses-boston-marathon-bombing_716400.html","source":"Weekly Standard","description":"President Barack Obama addressed the Boston Marathon bombing just now from the White House: The president was careful not to say the bombings were a terrorist attack, but he did say, \"We don't yet have all the answers, but we do know that multiple people ...","date":"2013-04-15T22:03:02Z"}],"boston police":[{"title":"At least 3 dead in Boston Marathon bombing","url":"http://www.11alive.com/rss/article/288436/40/President-Obama-to-speak-on-Boston-bombing-at-610","source":"WXIA 11 Alive","description":"BOSTON -- Police in Boston said at least three people were killed after two explosions near the finish line of the Boston Marathon Monday. At least 100 people have been reported hurt. About two hours after the winners crossed the line, there was a loud ...","date":"2013-04-15T21:48:43Z"}],"alleged bomber dzhokhar":[{"title":"Harvard study asks why was 'Boston Strong'?","url":"http://www.milforddailynews.com/article/20140403/News/140408567","source":"Milford Daily News","description":"A new study, released today by the Harvard Kennedy School's Program on Crisis Leadership, takes a look back at the Boston Marathon bombings of last year, and the aftermath of the manhunt in Watertown for alleged bomber Dzhokhar Tsarnaev.","date":"2014-04-03T21:38:06Z"}],"new prosthetic leg":[{"title":"Boston Marathon bombing survivor dances again","url":"http://www.whas11.com/news/Boston-Marathon-bombing-survivor-dances-again-251172881.html","source":"WHAS 11","description":"BOSTON (AP) -- A professional dancer has taken the stage for the first time since losing part of her left leg in the Boston Marathon bombing last year. Thirty-three-year-old Adrianne Haslet-Davis of Boston danced at the 2014 TED Conference in Vancouver ...","date":"2014-03-20T12:14:53Z"}],"new york post":[{"title":"10 Most Racist Tweets About Boston Marathon Bombing","url":"http://www.policymic.com/articles/35453/10-most-racist-tweets-about-boston-marathon-bombing","source":"Policy Mic","description":"The horrific Boston Marathon bombing has devastated the nation. Events like these remind us that humanity can really be the worst. As the entire country is mourning and trying to piece the tragic events together, some people prefer use this opportunity to ...","date":"2013-04-14T23:58:45Z"}],"left leg":[{"title":"Boston Marathon Bombing Survivor Dances for the First Time Since Losing Her Leg Thanks to High-Tech Prosthetic","url":"http://americanlivewire.com/2014-03-19-boston-marathon-bombing-survivor-dances-first-time-since-losing-leg-thanks-high-tech-prosthetic/","source":"American Live Wire","description":"April 15, 2013 is a day that will forever be etched in Adrianne Haslet-Davis’ mind, but Wednesday night, she courageously turned tragedy into triumph when she danced publicly for the first time since losing her leg on that fateful day in the Boston ...","date":"2014-03-20T10:41:50Z"}],"one-year anniversary":[{"title":"Former Charlotte Athletic Club Trainer, General Manager to Return to Boston Marathon","url":"http://clubindustry.com/blog/former-charlotte-athletic-club-trainer-general-manager-return-boston-marathon","source":"clubindustry.com","description":"You may remember Nicole Gross and her lasting image that was displayed around the world after the shocking and tragic bombings at the Boston Marathon last year. Gross and her husband, Michael, who at the time served as a personal trainer and the ...","date":"2014-04-04T17:33:32Z"}],"clementi":[{"title":"Rochester marathoner returns to Boston","url":"http://13wham.com/news/features/local-news/stories/rochester-marathoner-returns-boston-644.shtml","source":"13ABC WHAN","description":"Rochester, N.Y. - Distance runner Mark Clementi was about to finish his first Boston Marathon last year when suddenly he heard a loud bang. \"It went from being one of the best days of my life to becoming one of the worst days of my life,\" said ...","date":"2014-04-05T23:58:54Z"}],"push jeff bauman":[{"title":"Boston Marathon bombing survivor engaged, expecting child","url":"http://www.wpxi.com/news/news/national/boston-marathon-bombing-survivor-engaged-expecting/nfJ9p/?icmp=cmgcontent_internallink_relatedcontent_2014_partners1","source":"WPXI","description":"Jeff Bauman, one of the best-known survivors of the Boston Marathon bombing, had some good news to share with the world Sunday. He's engaged to his longtime girlfriend—and they're expecting a child. Bauman and his fiancée, Erin Hurley, announced the ...","date":"2014-03-24T05:29:17Z"}],"oscar pistorius murder":[{"title":"Boston Marathon bombings bear marks of 'lone wolf', says expert","url":"http://www.news.com.au/world/boston-marathon-bombs-made-from-pressure-cookers-packed-with-ball-bearings-stashed-in-black-nylon-backpacks/story-fndir2ev-1226622132249","source":"News.com.au","description":"THE FBI has confirmed the Boston Marathon bombs may have been made from pressure cookers after recovering fragments of dark nylon, BBs and nails from the scene. FBI special agent-in-charge Rick Deslauriers told a media conference that both explosives were ...","date":"2013-04-18T04:41:32Z"}],"deadly bombings":[{"title":"Boston Marathon bombing suspects likely acted alone","url":"http://www.cbc.ca/news/world/boston-marathon-bombing-suspects-likely-acted-alone-1.1354868","source":"CBC","description":"New details emerged Tuesday from U.S. officials and family members about how the two Boston Marathon bombing suspects may have been swayed by a radical, anti-American strain of Islam. A U.S. senator said they had been radicalized by sources on the web, not ...","date":"2013-04-23T20:41:58Z"}],"homeland security conduct":[{"title":"Boston Marathon Bombing Investigation","url":"http://www.c-span.org/video/?312389-4/boston-marathon-bombing-investigation","source":"c-span.org","description":"Representative Bobby Scott (D-VA) talked abouit FBI and Homeland Security conduct in the investigation of the Boston Marathon… read more Representative Bobby Scott (D-VA) talked abouit FBI and Homeland Security conduct in the investigation of the Boston ...","date":"2013-04-25T23:52:52Z"}],"law enforcement source":[{"title":"Suspect ID’d in Boston Marathon bombings","url":"http://wtvr.com/2013/04/17/boston-marathon-bombing-arrest/","source":"WTVR-TV","description":"(CNN) — Investigators in Washington and Boston denied Wednesday that an arrest had been made in the bombing of the Boston Marathon. They had earlier said there was “substantial” progress in the case. There is conflicting information as to whether ...","date":"2013-04-17T17:50:08Z"}],"heritage trails chapter":[{"title":"Local Heritage Trails DAR chapter honors here from Boston Marathon","url":"http://www.yourhoustonnews.com/courier/living/local-heritage-trails-dar-chapter-honors-here-from-boston-marathon/article_1098b4bf-4b57-5718-8084-93cc6fcefb1b.html","source":"Your Houston News","description":"During the recent TXDAR state conference held at the Hyatt Regency Dallas Hotel, Carlos “Alexander” Arredondo was the recipient of the DAR Americanism medal during the Conference Awards Evening held on Friday night. Arredondo and his wife, Melida, were ...","date":"2014-04-06T03:55:07Z"}],"producer gary glasberg":[{"title":"'NCIS' boss: Boston Marathon bombing survivors inspired new storyline","url":"http://insidetv.ew.com/2014/01/15/ncis-delilah-bombing-boston-marathon/","source":"Entertainment Weekly","description":"Tuesday night’s episode of NCIS introduced a storyline that’s going to see one of the characters — DOD employee Delilah Fielding — learning to live her life as a disabled person. On Wednesday, executive producer Gary Glasberg revealed ...","date":"2014-01-15T18:45:45Z"}],"new york":[{"title":"Boston Marathon Bombing: 3 Possible Terrorist Connections","url":"http://www.policymic.com/articles/35221/boston-marathon-bombing-3-possible-terrorist-connections","source":"Policy Mic","description":"Initial reports from the Boston Police are citing 3 dead and dozens injured by 2 successive explosions at the Boston Marathon finish line. The Boston Marathon is an international spectacle, established in 1897. The world's best marathon runners train for ...","date":"2013-04-15T20:37:08Z"},{"title":"Boston Marathon bombings: List of other terror attacks on American soil","url":"http://www.nj.com/news/index.ssf/2013/04/boston_marathon_bombings_explo.html","source":"New Jersey Online","description":"While there's yet to be an indication who planned or executed the bombings Monday at the Boston Marathon, a White House official said it will be viewed as \"an act of terror. \"However, we don't yet know who carried out this attack, and a thorough ...","date":"2013-04-16T10:06:02Z"},{"title":"The Boston Marathon Bombings: The Latest Updates, NYU’s Response, And What You Can Do To Help","url":"http://nyulocal.com/national/2013/04/16/the-boston-marathon-bombings-the-latest-updates-nyus-response-and-what-you-can-do-to-help/","source":"nyulocal.com","description":"Authorities are still searching today for a suspect in yesterday’s deadly bombings at the finish line of the Boston marathon, which killed 3 people and injured 176, according to the most recent reports. Although there were numerous rumors that a suspect ...","date":"2013-04-15T23:57:34Z"}],"brannock":[{"title":"Seven months after Boston Marathon bombing, local victim walking","url":"http://www.baltimoresun.com/news/maryland/bal-bs-md-erika-brannock-profile-20131110,0,5575246.htmlstory","source":"The Baltimore Sun","description":"Erika Brannock slides to the edge of her wheelchair. She looks down at a pair of carefully selected gray New Balance sneakers. And stands. Her thigh slides deeper into a flexible plastic socket as she shifts her weight from her right leg to her ...","date":"2013-11-09T17:56:22Z"},{"title":"Tonight on AC360: Boston bombing victim reunited with her hero","url":"http://ac360.blogs.cnn.com/2013/06/04/wednesday-on-ac360-boston-bombing-victim-reunited-with-her-hero/","source":"CNN Anderson Cooper 360","description":"Erika Brannock's life was forever changed the day the bombs exploded at the Boston Marathon finish line in April. Part of her left leg was blown off, and her right leg was broken. She might have died if a stranger hadn't been there to provide ...","date":"2013-06-03T23:56:44Z"}],"incident":[{"title":"Boston Marathon Bombing: Raw Videos from the Finish Line","url":"http://newsfeed.time.com/2013/04/16/boston-marathon-bombing-raw-video-from-the-finish-line/","source":"Time","description":"At the Boston Marathon on Monday afternoon, journalists and cameramen waiting at the finish line expecting to capture the jubilance of the runners soon found themselves covering a tragedy instead. Videos of the twin explosions that rocked the ...","date":"2013-04-15T23:57:34Z"}],"boston bombing movie":[{"title":"Boston Marathon Bombing To Be Turned Into A Movie","url":"http://www.cinemablend.com/new/Boston-Marathon-Bombing-Turned-Movie-38411.html","source":"Cinema Blend","description":"It hasn't even been four months since the Boston Marathon bombings rocked the nation on April 15th, but already a movie adaptation is in the works. But before you cry out, \"Too soon,\" consider the pair behind the proposed docudrama. Paul Tamasy and Eric ...","date":"2013-07-08T22:17:57Z"}],"zooey deschanel":[{"title":"Oops! Zooey Deschanel Captioned as Boston Marathon Bombing Suspect","url":"https://tv.yahoo.com/news/oops-zooey-deschanel-captioned-boston-marathon-bombing-suspect-150300754.html","source":"YAHOO","description":"Who's that girl? It's ... the Boston Marathon bomber? During the intense lockdown and manhunt for the Boston Marathon bombing suspects Friday, a local Fox affiliate in Dallas, Texas misidentified one of the suspects as none other than New Girl ...","date":"2013-04-21T15:15:04Z"}],"wise giving alliance":[{"title":"Boston Marathon Bombings: How to Send Help (and Avoid Scams)","url":"http://business.time.com/2013/04/17/boston-marathon-bombings-how-to-help-and-avoid-scams/","source":"business.time.com","description":"It’s only human nature to want to help out victims of a disaster, but tragic events also bring scam artists out of the woodwork. In the aftermath of the Boston Marathon bombings, an outpouring of support has prompted numerous charitable ...","date":"2013-04-17T23:55:12Z"}],"middle eastern descent":[{"title":"Muslim victim of Boston Marathon bombing sues Glenn Beck for defamation and slander","url":"http://www.rawstory.com/rs/2014/03/31/muslim-victim-of-boston-marathon-bombing-sues-glenn-beck-for-defamation-and-slander/","source":"Raw Story","description":"A Muslim victim of the Boston Marathon bombing has sued Glenn Beck for defamation and slander after the talk show host accused him of funding the attacks. Race spectator Abdulrahman Alharbi filed a federal lawsuit against Beck and his companies, The Blaze ...","date":"2014-03-31T16:12:23Z"}],"marathon bomber dzhokhar":[{"title":"Boston Marathon bombing: Dramatic images of manhunt, suspect in custody","url":"http://sports.yahoo.com/photos/boston-marathon-bombing-suspects-manhunt-mit-shooting-explosion-watertown-1366361801-slideshow/","source":"YAHOO!","description":"A daylong manhunt culminated Friday evening with authorities taking suspected Boston Marathon bomber Dzhokhar Tsarnaev, 19, into custody alive. Tsarnaev was found hiding on a boat in the yard of a Franklin Street home in the Boston suburb of Watertown.","date":"2013-04-18T23:54:01Z"}],"p.m.":[{"title":"Explosions Reported at Boston Marathon Finish Line [Live Updates]","url":"http://nymag.com/daily/intelligencer/2013/04/bomb-reported-at-boston-marathon-finish-line.html","source":"New York Magazine","description":"Two explosions reportedly went off at the finish line of the Boston Marathon today, killing at least two people and injuring dozens more, according to authorities. Dispatches and photographs from the scene have poured in on social media showing smoke and ...","date":"2013-04-16T04:08:07Z"}],"scarborough downs":[{"title":"Boston Marathon bombing victim honored with a different kind of run","url":"http://www.wlbz2.com/story/local/2013/05/27/6759917/","source":"WLBZ 2","description":"SCARBOROUGH, Maine (NEWS CENTER) -- Krystle Campbell, one of three people killed inthe bombing at the Boston Marathon, was remembered on this Memorial Day with a winner's circle ceremony at Scarborough Downs. Campbell was standing near the finish line ...","date":"2013-05-27T21:49:01Z"}],"terrorist attack":[{"title":"Boston Marathon bombing was meticulously plotted in advance ... by the police!","url":"http://www.naturalnews.com/040795_Boston_Marathon_bombing_terror_plots.html","source":"Natural News","description":"(NaturalNews) Federal, state and local police agencies, along with the various state National Guard forces, have for years war-gamed terrorist attack scenarios. Such preparation is more than prudent, given the scope and severity of the 9/11 attacks, which ...","date":"2013-06-16T19:09:18Z"}],"marathon bombing suspect":[{"title":"Boston Marathon Bombing Suspect, Dzhokhar Tsarnaev, Caught! (PHOTOS)","url":"http://globalgrind.com/2013/04/19/boston-marathon-bombing-suspect-dzhokhar-tsarnaev-caught-watertown-boat-photos/","source":"Global Grind","description":"Despite concerns raised by the recent bombings at the Boston Marathon, the London marathon prevailed today and thousands of runners offered tributes to those killed and injured in the tragedy that took place last Monday. The race began after a moment of ...","date":"2013-04-21T18:35:29Z"},{"title":"Tsarnaev’s Trial for Boston Marathon Bombing Begins Nov 3","url":"http://www.jewishpress.com/news/tsarnaevs-trial-for-boston-marathon-bombing-begins-nov-3/2014/02/13/","source":"Jewish Press","description":"Attorneys for Dzokhar Tsarnaev, the 20 year-old sole remaining suspect in last year’s Boston Marathon Bombing attack, met in Boston for a status conference with the prosecutors and the judge on Wednesday, Feb. 12. This is the first court appearance since ...","date":"2014-02-12T23:56:08Z"}],"rep. steve stockman":[{"title":"The 8 Worst Responses To The Boston Marathon Bombings","url":"http://thinkprogress.org/politics/2013/04/16/1870971/8-worst-boston-responses/","source":"Think Progress","description":"The horror that was the aftermath of the explosions at the end of the Boston Marathon on Monday drew forth some of the best of people. With three dead and more than 100 wounded, dozens of citizens comforted and aided the injured, thousands more offered up ...","date":"2013-04-16T23:13:26Z"}],"email address":[{"title":"The Boston Marathon Bombings and the Image of God","url":"http://www.charismanews.com/opinion/39133-the-boston-marathon-bombings-and-the-image-of-god","source":"Charisma News","description":"People embrace during a candlelight service at Arlington Street Church in Boston on Tuesday that honored the victims of the Boston Marathon bombings. (Reuters/Shannon Stapleton) In light of the horrible tragedy at the Boston Marathon Monday, many pundits ...","date":"2013-04-17T19:23:11Z"}],"actual terrorist attack":[{"title":"Ron Paul: Police manhunt for Boston Marathon bombing suspect scarier than attack","url":"http://www.washingtontimes.com/news/2013/apr/29/ron-paul-police-manhunt-boston-marathon-bombing-su/","source":"Washington Times","description":"Former Rep. Ron Paul said the law enforcement that swarmed around Boston in the days following the marathon bombings was scarier than the actual terrorist attack. “The Boston bombing provided the opportunity for the government to turn what should have ...","date":"2013-04-28T23:56:28Z"}],"suffolk county":[{"title":"IRS extends tax deadline for Boston bombing victims","url":"http://money.cnn.com/2013/04/17/pf/taxes/boston-marathon-bombing/index.html","source":"CNN Money","description":"Taxpayers impacted by the explosions in Boston have another three months to file their taxes. The extension automatically applies to anyone who lives in Suffolk County, Mass., which includes Boston. Anyone outside of Suffolk County who was ...","date":"2013-04-17T16:38:33Z"}],"conspiracy theories":[{"title":"Why Boston Marathon Bombings Ignited Conspiracies","url":"http://www.livescience.com/29038-why-boston-bombings-ignited-conpsiracies.html","source":"LiveScience","description":"Like the Sept. 11 terrorist attacks, the Sandy Hook massacre and other tragedies, the recent Boston Marathon bombing has spawned several conspiracy theories. Some of the more cynical conspiracy theorists do it simply for attention and ratings, or to ...","date":"2013-04-25T15:31:47Z"}],"commissioner davis":[{"title":"Boston Commish: 3 lessons learned from marathon bombing","url":"http://www.policeone.com/chiefs-sheriffs/articles/6547563-Boston-Commish-3-lessons-learned-from-marathon-bombing/","source":"Police one.com","description":"It is hard to believe more than six months have passed since the Boston Marathon bombing that killed three people and injured 264 others. It was a day that many will never forget, including Edward Davis, Commissioner of the Boston Police Department.","date":"2013-10-25T18:21:18Z"}],"marathon bombing":[{"title":"Alicia Ann Lynch: Boston Marathon Bombing Halloween Costume Draws Death Threats; Social Media User Gets Fired - Hoax or Fact?","url":"http://au.ibtimes.com/articles/519155/20131104/boston-marathon-bombing-halloween-costume-twitter-facebook.htm","source":"Int'l Business Times","description":"Alicia Ann Lynch is the latest name to draw death threats on Twitter over a joke, which, according to many social media users, was not funny. Alicia posted photos of herself in a Boston marathon bombing Halloween costume. Is the news some attention ...","date":"2013-11-04T09:26:54Z"}],"cause raising money on behalf of":[{"title":"Local man raising money in name of Boston Marathon victim","url":"http://www.abcactionnews.com/news/state/local-man-raising-money-in-name-of-boston-marathon-victim?autoplay=true","source":"ABC Action News","description":"It's been almost at year since last year's deadly bombings at the Boston Marathon. Three people died and hundreds others were injured. Ed Kelly is a local man moving forward from the tragedy by being among the tens of thousands of runners in ...","date":"2014-04-05T21:21:25Z"}],"login form":[{"title":"Live updates: Three killed in Boston Marathon explosions","url":"http://www.smh.com.au/world/live-updates-three-killed-in-boston-marathon-explosions-20130416-2hwmy.html","source":"Sydney Morning Herald","description":"• Two explosions went off near the finish line of the Boston Marathon just before 3pm local time (5am AEST) — about four hours after the start of the men's race. • Three people died and at least 140 were injured as a result of the bomb blasts, which ...","date":"2013-04-15T20:22:49Z"}],"false flag":[{"title":"DHS documents prove Boston Marathon bombing was false flag 'drill' planned months in advance","url":"http://www.naturalnews.com/040898_Boston_Marathon_false_flag_terror_drills.html","source":"Natural News.com","description":"(NaturalNews) It has been about two months now since multiple pressure cooker bombs went off near the finish line of the 2013 Boston Marathon, an event that triggered a massive show of police state force as hordes of armed SWAT troopers marched the streets ...","date":"2013-06-22T17:07:39Z"}],"charlotte athletic club":[{"title":"Boston Marathon Bombings Affect Fitness Club Industry","url":"http://clubindustry.com/profits/boston-marathon-bombings-affect-fitness-club-industry","source":"clubindustry.com","description":"The bombs that exploded near the finish line of the Boston Marathon on Monday, which killed three and wounded more than 170, shook the city of Boston and the entire nation. The fitness club industry was no exception. Dan Salerno, the co-fitness director at ...","date":"2013-04-15T23:57:34Z"}],"youth design":[{"title":"Tank Design captures Boston Marathon Bombing events in new book through iconography","url":"http://baystatebanner.com/news/2014/mar/24/tank-design-captures-boston-marathon-bombing-event/","source":"baystatebanner.com","description":"Designers at the Cambridge-based design firm Tank have joined hands to create a book documenting the events of the Boston Marathon Bombing last April that tells the story in iconography. \"When you're driving on a road and you're seeing a sign that's ...","date":"2014-03-24T14:40:28Z"}],"neighbor lily huynh":[{"title":"Neighbors recall Boston marathon bombing victim, 8","url":"http://www.wzzm13.com/news/article/252937/2/Boy-died-in-Boston-watching-dad-finish-marathon","source":"WZZM 13","description":"BOSTON (USA TODAY)- The mood outside the gray wood-frame house on Carruth Street where the Richard family lives was quiet and somber Tuesday. An occasional neighbor, even strangers, approached with flowers and balloons and set them on the front steps.","date":"2013-04-15T23:57:34Z"}],"la sala":[{"title":"Boston bombings lead to security improvements for California International Marathon","url":"http://www.sacbee.com/2013/11/30/5959485/boston-bombings-lead-to-security.html","source":"Sacramento Bee","description":"When thousands of runners take off from Folsom Dam in the California International Marathon next Sunday, organizers hope few will notice any difference from past races through the Sacramento region. But, in the aftermath of the Boston Marathon bombings ...","date":"2013-12-01T01:31:04Z"}],"world-famous boston marathon":[{"title":"Boston Marathon bombing response a world model, governor says","url":"https://ca.sports.yahoo.com/news/boston-marathon-bombing-response-world-model-governor-says-163516657--sector.html","source":"YAHOO! SPORTS","description":"BOSTON (Reuters) - Boston's handling of the bombing attack on its marathon in April has become a model for cities around the world on how to respond to tragedy, Massachusetts Governor Deval Patrick said on Monday, as the city made its final preparations ...","date":"2014-03-24T20:31:13Z"}],"advertisement":[{"title":"In the Wake of the Boston Marathon Bombing, Twitter Was Full of Lies","url":"http://www.smithsonianmag.com/smart-news/in-the-wake-of-the-boston-marathon-bombing-twitter-was-full-of-lies-5294419/","source":"smithsonianmag.com","description":"From the time two bombs went off near the finish line of the Boston Marathon on April 15, until Dzhokhar Tsarnaev was pulled out of a boat, nearly 8 million relevant tweets were sent by 3.7 million people, say researchers Aditi Gupta, Hemank Lamba ...","date":"2013-10-24T18:43:58Z"}],"kate gosselin":[{"title":"Kate Gosselin Using Boston Bombing Tragedy To Gain Attention, Wants To Run A Marathon For Victims","url":"http://www.celebdirtylaundry.com/2013/kate-gosselin-boston-bombing-run-marathon-0417/","source":"Celebrity Dirty Laundry","description":"Is there anything worse than a reality television star who uses a national tragedy to try to increase her own profile? At least the Kardashians, whatever else you can say about them, have kept their mouths shut in the face of the Boston marathon bombings ...","date":"2013-04-17T12:49:29Z"}],"native new yorker":[{"title":"Neil Diamond plans to write song about Boston Marathon bombing","url":"http://entertainment.nbcnews.com/_news/2013/04/23/17876068-neil-diamond-plans-to-write-song-about-boston-marathon-bombing?lite","source":"NBCNews.com","description":"Though a native New Yorker, Neil Diamond has become an inspirational figure in the city of Boston's recovery from the bombings at the Boston Marathon last week. Diamond's \"Sweet Caroline\" is a staple at the Red Sox' Fenway Park, and Saturday he made ...","date":"2013-04-22T23:56:26Z"}],"richard falk":[{"title":"Princeton Invites 9/11 Truther Who Blamed Boston Marathon Bombing on “American Global Domination” to Deliver Lecture","url":"http://www.frontpagemag.com/2014/dgreenfield/princeton-invites-911-truther-who-blamed-boston-marathon-bombing-on-american-global-domination-to-deliver-lecture/","source":"Front Page","description":"Eight months after the Muslim terror bombings that killed and crippled so many Americans in Boston, Princeton University is set to provide a forum to a 9/11 Truther who justified the bombings as a response to “American Global Domination” and who has ...","date":"2014-02-16T18:57:54Z"}],"porter square books":[{"title":"Artists Donate to Auction Inspired by Boston Marathon Bombing","url":"http://www.publishersweekly.com/pw/by-topic/childrens/childrens-industry-news/article/58994-artists-donate-to-auction-inspired-by-boston-marathon-bombing.html","source":"Publishers Weekly","description":"For children’s book author and illustrator Joe McKendry, whose first book was Beneath the Streets of Boston (Godine), the Boston Marathon bombing felt “personal.” Not only had he and his wife, Susan, lived in Boston’s South End and spent many hours ...","date":"2013-09-05T20:53:40Z"}],"red cross":[{"title":"Where to donate to aid Boston Marathon bombing victims","url":"http://www.metrowestdailynews.com/article/20130418/News/304189890","source":"MetroWest Daily News","description":"As fundraising to aid the victims of the Boston Marathon bombing continues, here's a guide to finding trustworthy ways to help. Attorney General Martha Coakley’s office has warned people to donate carefully and check out charities to make sure they are ...","date":"2013-04-18T22:49:35Z"}],"8-year-old child":[{"title":"CNN: 8-Year-Old Killed in Boston Marathon Bombings","url":"http://www.weeklystandard.com/blogs/cnn-8-year-old-killed-boston-marathon-bombings_716401.html","source":"Weekly Standard","description":"CNN now reports that an 8-year-old child was killed in today's Boston marathon bombings: \"We're now being told, as bad as the situation is, according to ... one of the local stations in Boston, one of the two people killed was an 8-year-old child,\" said ...","date":"2013-04-15T22:31:40Z"}],"karen odom":[{"title":"Boston Marathon bomb survivor John Odom set to return home to Torrance","url":"http://www.dailybreeze.com/general-news/20130828/boston-marathon-bomb-survivor-john-odom-set-to-return-home-to-torrance","source":"Daily Breeze","description":"Nearly five months after a bomb almost took his life at the Boston Marathon, John Odom of Torrance was cleared by doctors on Wednesday to finally come home. Odom’s wife, Karen, who has never left her husband’s side, has been chronicling her husband’s ...","date":"2013-08-29T02:39:35Z"}],"dna sample":[{"title":"Female DNA Found on Boston Marathon Bomb","url":"http://www.newsmax.com/Newsfront/boston-bomb-female-dna/2013/04/29/id/501912/","source":"NewsMax","description":"DNA from a female has been found on one of the bombs used in the Boston Marathon terrorist attack, but officials say they don’t know if it belongs to someone who might have aided in making the bombs. FBI agents investigating the bombings have visited the ...","date":"2013-04-29T22:43:42Z"}],"website uses cookies":[{"title":"Boston Marathon Bombing: Town In Lockdown","url":"http://news.sky.com/story/1080275/boston-marathon-bombing-town-in-lockdown","source":"Sky.com","description":"Residents of Watertown have been told to stay in their homes as one of the Boston marathon suspects remains on the loose. Dzhokhar A Tsarnaev, 19 - described as \"armed and dangerous\" - is on the run and being hunted by police. His brother Tamerlan has been ...","date":"2013-04-19T10:23:57Z"}],"acute stress":[{"title":"Prolonged viewing of Boston Marathon bombings media coverage tied to acute stress","url":"http://medicalxpress.com/news/2013-12-prolonged-viewing-boston-marathon-media.html","source":"Medical Xpress","description":"Stepping away from the television, computer screen or smartphone in the aftermath of terrorist attacks or mass shootings may be beneficial to your mental health. That's the takeaway from a new study by UC Irvine researchers showing that six or more daily ...","date":"2013-12-09T19:36:47Z"}],"117th boston marathon":[{"title":"Cellphone Overload At Boston Marathon Bombings Highlight Reliability Concerns","url":"http://sanfrancisco.cbslocal.com/2013/04/17/cellphone-overload-at-boston-marathon-bombings-highlight-reliability-concerns/","source":"CBS","description":"SAN FRANCISCO (KCBS) – Following the bombings near the finish line of the Boston Marathon this week, cellphone services became so overloaded in the area that many thought authorities had shut it down completely. It highlights the growing concerns here in ...","date":"2013-04-17T15:19:48Z"}],"cnn":[{"title":"CNN Now Pulling Back Report that Suspect Arrested in Boston Marathon Terrorist Bombings","url":"http://themoderatevoice.com/180451/cnn-suspect-arrested-in-boston-marathon-terrorist-bombings/","source":"The Moderate Voice","description":"UPDATE: CNN is now reporting that sources tell them their earlier report was not correct: there has been no arrest. Several CNN reporters are now nixing earlier reports that they had a suspect in custody. CNN has removed the lower screen scrawl about an ...","date":"2013-04-17T17:57:17Z"}],"ethnic chechen brothers":[{"title":"Chinese student in coma after Boston Marathon bombings","url":"http://www.scmp.com/news/china/article/1216037/chinese-student-coma-after-boston-marathon-bombings","source":"South China Morning Post","description":"One female student from China is in a coma after suffering serious injuries in the Boston Marathon bombings, China's official Xinhua News Agency has reported quoting an unnamed official from the Chinese consulate in New York. The woman, who was named by ...","date":"2013-04-14T23:58:45Z"}],"soft touch":[{"title":"Therapy Dog Helps Victims of Boston Marathon Bombings","url":"http://www.wggb.com/2013/04/17/therapy-dog-helps-victims-of-boston-marathon-bombings/","source":"abc40","description":"BOSTON, Mass. (WGGB) — The healing process for those directly involved with the bombings at the Boston Marathon will take a long time. Help comes in many ways. Meet Bailey, a one and a half-year old Golden Retriever. Baily and Jack Foley of Milton are a ...","date":"2013-04-17T20:49:05Z"}],"19-year-old dzhokhar tsarnaev":[{"title":"Neighbors applaud, cheer after authorities capture Boston Marathon bombing suspect","url":"http://www.toledoblade.com/Nation/2013/04/20/Neighbors-applaud-cheer-after-authorities-capture-Boston-Marathon-bombing-suspect.html","source":"Toledo Blade","description":"WATERTOWN, Mass. — Police officers and firefighters stood grim-faced with guns and rifles, lining the street leading to the suburban property where a suspect in twin bombings at the Boston Marathon was believed to be holed up. Reporters and spectators ...","date":"2013-04-20T05:29:16Z"}],"kennedy and boston fire lt. edward j. walsh were":[{"title":"Funeral held for second fallen Boston firefighter","url":"http://www.concordmonitor.com/news/cops/courts/fires/11433849-95/funeral-held-for-second-fallen-boston-firefighter","source":"Concord Monitor","description":"A Boston firefighter and former Marine killed in an apartment blaze last week was praised yesterday as a courageous, compassionate man who served his country in Iraq and his community at home. Firefighters from across the country and citizens numbered in ...","date":"2014-04-04T04:18:58Z"}],"boston magazine":[{"title":"Bath Magazine apologises over copycat front cover that took ‘inspiration’ from tribute to victims of Boston Marathon bombing","url":"http://www.independent.co.uk/news/uk/home-news/bath-magazine-apologises-after-front-cover-took-inspiration-from-boston-marathon-bombings-image-9093499.html","source":"The Independent","description":"A British magazine has been forced to apologise after using a front cover image which it says was “inspired” by another publication’s tribute to victims of the Boston Marathon bombing. The front cover of The Bath Magazine’s February edition showed ...","date":"2014-01-29T13:42:49Z"}],"golf game":[{"title":"Couple Injured By Boston Marathon Bombing To Have Dream Wedding","url":"http://www.myfoxphilly.com/story/24480294/couple-injured-by-boston-marathon-bombing-to-have-dream-wedding","source":"MyFox Philadelphia","description":"A young couple still recovering from injuries that they suffered in the Boston Marathon Bombings is getting married. Better yet, a popular wedding planning website is paying for the whole celebration. The couple, Rebekah Gregory and Pete DiMartino, was at ...","date":"2014-01-31T13:26:08Z"},{"title":"Couple Injured By Boston Marathon Bombing To Have Dream Wedding","url":"http://www.myfoxphilly.com/story/24480294/couple-injured-by-boston-marathon-bombing-to-have-dream-wedding","source":"MyFox Philadelphia","description":"A young couple still recovering from injuries that they suffered in the Boston Marathon Bombings is getting married. Better yet, a popular wedding planning website is paying for the whole celebration. The couple, Rebekah Gregory and Pete DiMartino, was at ...","date":"2014-01-31T13:26:08Z"},{"title":"Couple Injured By Boston Marathon Bombing To Have Dream Wedding","url":"http://www.myfoxphilly.com/story/24480294/couple-injured-by-boston-marathon-bombing-to-have-dream-wedding","source":"MyFox Philadelphia","description":"A young couple still recovering from injuries that they suffered in the Boston Marathon Bombings is getting married. Better yet, a popular wedding planning website is paying for the whole celebration. The couple, Rebekah Gregory and Pete DiMartino, was at ...","date":"2014-01-31T13:26:08Z"},{"title":"Couple Injured By Boston Marathon Bombing To Have Dream Wedding","url":"http://www.myfoxphilly.com/story/24480294/couple-injured-by-boston-marathon-bombing-to-have-dream-wedding","source":"MyFox Philadelphia","description":"A young couple still recovering from injuries that they suffered in the Boston Marathon Bombings is getting married. Better yet, a popular wedding planning website is paying for the whole celebration. The couple, Rebekah Gregory and Pete DiMartino, was at ...","date":"2014-01-31T13:26:08Z"},{"title":"Couple Injured By Boston Marathon Bombing To Have Dream Wedding","url":"http://www.myfoxphilly.com/story/24480294/couple-injured-by-boston-marathon-bombing-to-have-dream-wedding","source":"MyFox Philadelphia","description":"A young couple still recovering from injuries that they suffered in the Boston Marathon Bombings is getting married. Better yet, a popular wedding planning website is paying for the whole celebration. The couple, Rebekah Gregory and Pete DiMartino, was at ...","date":"2014-01-31T13:26:08Z"},{"title":"Couple Injured By Boston Marathon Bombing To Have Dream Wedding","url":"http://www.myfoxphilly.com/story/24480294/couple-injured-by-boston-marathon-bombing-to-have-dream-wedding","source":"MyFox Philadelphia","description":"A young couple still recovering from injuries that they suffered in the Boston Marathon Bombings is getting married. Better yet, a popular wedding planning website is paying for the whole celebration. The couple, Rebekah Gregory and Pete DiMartino, was at ...","date":"2014-01-31T13:26:08Z"},{"title":"Couple Injured By Boston Marathon Bombing To Have Dream Wedding","url":"http://www.myfoxphilly.com/story/24480294/couple-injured-by-boston-marathon-bombing-to-have-dream-wedding","source":"MyFox Philadelphia","description":"A young couple still recovering from injuries that they suffered in the Boston Marathon Bombings is getting married. Better yet, a popular wedding planning website is paying for the whole celebration. The couple, Rebekah Gregory and Pete DiMartino, was at ...","date":"2014-01-31T13:26:08Z"},{"title":"Couple Injured By Boston Marathon Bombing To Have Dream Wedding","url":"http://www.myfoxphilly.com/story/24480294/couple-injured-by-boston-marathon-bombing-to-have-dream-wedding","source":"MyFox Philadelphia","description":"A young couple still recovering from injuries that they suffered in the Boston Marathon Bombings is getting married. Better yet, a popular wedding planning website is paying for the whole celebration. The couple, Rebekah Gregory and Pete DiMartino, was at ...","date":"2014-01-31T13:26:08Z"},{"title":"Couple Injured By Boston Marathon Bombing To Have Dream Wedding","url":"http://www.myfoxphilly.com/story/24480294/couple-injured-by-boston-marathon-bombing-to-have-dream-wedding","source":"MyFox Philadelphia","description":"A young couple still recovering from injuries that they suffered in the Boston Marathon Bombings is getting married. Better yet, a popular wedding planning website is paying for the whole celebration. The couple, Rebekah Gregory and Pete DiMartino, was at ...","date":"2014-01-31T13:26:08Z"}],"police department":[{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"},{"title":"Three Men Arrested in Connection with Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/three-men-arrested-in-connection-with-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"Three men were arrested and charged today in connection with the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, both of New Bedford, were charged in a criminal complaint with conspiracy to obstruct justice by ...","date":"2013-05-02T00:21:33Z"}],"islamic fundamentalism":[{"title":"Part Two: Why Bomb the Boston Marathon?","url":"http://sandiegofreepress.org/2013/04/part-two-why-bomb-the-boston-marathon/","source":"sandiegofreepress.org","description":"Editor’s Note: Since most of the news media ‘experts’ have no clue what they’re talking about when it comes to the the lives of the Boston Marathon bombers we’re publishing this detailed backgrounder by researcher Chip Berlet. Part One ...","date":"2013-04-22T23:56:26Z"},{"title":"Part Two: Why Bomb the Boston Marathon?","url":"http://sandiegofreepress.org/2013/04/part-two-why-bomb-the-boston-marathon/","source":"sandiegofreepress.org","description":"Editor’s Note: Since most of the news media ‘experts’ have no clue what they’re talking about when it comes to the the lives of the Boston Marathon bombers we’re publishing this detailed backgrounder by researcher Chip Berlet. Part One ...","date":"2013-04-22T23:56:26Z"},{"title":"Part Two: Why Bomb the Boston Marathon?","url":"http://sandiegofreepress.org/2013/04/part-two-why-bomb-the-boston-marathon/","source":"sandiegofreepress.org","description":"Editor’s Note: Since most of the news media ‘experts’ have no clue what they’re talking about when it comes to the the lives of the Boston Marathon bombers we’re publishing this detailed backgrounder by researcher Chip Berlet. Part One ...","date":"2013-04-22T23:56:26Z"},{"title":"Part Two: Why Bomb the Boston Marathon?","url":"http://sandiegofreepress.org/2013/04/part-two-why-bomb-the-boston-marathon/","source":"sandiegofreepress.org","description":"Editor’s Note: Since most of the news media ‘experts’ have no clue what they’re talking about when it comes to the the lives of the Boston Marathon bombers we’re publishing this detailed backgrounder by researcher Chip Berlet. Part One ...","date":"2013-04-22T23:56:26Z"},{"title":"Part Two: Why Bomb the Boston Marathon?","url":"http://sandiegofreepress.org/2013/04/part-two-why-bomb-the-boston-marathon/","source":"sandiegofreepress.org","description":"Editor’s Note: Since most of the news media ‘experts’ have no clue what they’re talking about when it comes to the the lives of the Boston Marathon bombers we’re publishing this detailed backgrounder by researcher Chip Berlet. Part One ...","date":"2013-04-22T23:56:26Z"},{"title":"Part Two: Why Bomb the Boston Marathon?","url":"http://sandiegofreepress.org/2013/04/part-two-why-bomb-the-boston-marathon/","source":"sandiegofreepress.org","description":"Editor’s Note: Since most of the news media ‘experts’ have no clue what they’re talking about when it comes to the the lives of the Boston Marathon bombers we’re publishing this detailed backgrounder by researcher Chip Berlet. Part One ...","date":"2013-04-22T23:56:26Z"},{"title":"Part Two: Why Bomb the Boston Marathon?","url":"http://sandiegofreepress.org/2013/04/part-two-why-bomb-the-boston-marathon/","source":"sandiegofreepress.org","description":"Editor’s Note: Since most of the news media ‘experts’ have no clue what they’re talking about when it comes to the the lives of the Boston Marathon bombers we’re publishing this detailed backgrounder by researcher Chip Berlet. Part One ...","date":"2013-04-22T23:56:26Z"},{"title":"Part Two: Why Bomb the Boston Marathon?","url":"http://sandiegofreepress.org/2013/04/part-two-why-bomb-the-boston-marathon/","source":"sandiegofreepress.org","description":"Editor’s Note: Since most of the news media ‘experts’ have no clue what they’re talking about when it comes to the the lives of the Boston Marathon bombers we’re publishing this detailed backgrounder by researcher Chip Berlet. Part One ...","date":"2013-04-22T23:56:26Z"},{"title":"Part Two: Why Bomb the Boston Marathon?","url":"http://sandiegofreepress.org/2013/04/part-two-why-bomb-the-boston-marathon/","source":"sandiegofreepress.org","description":"Editor’s Note: Since most of the news media ‘experts’ have no clue what they’re talking about when it comes to the the lives of the Boston Marathon bombers we’re publishing this detailed backgrounder by researcher Chip Berlet. Part One ...","date":"2013-04-22T23:56:26Z"}],"new bedford":[{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"},{"title":"Federal Grand Jury Indicts Two Men for Obstruction of Justice in the Boston Marathon Bombing Investigation","url":"http://www.fbi.gov/boston/press-releases/2013/federal-grand-jury-indicts-two-men-for-obstruction-of-justice-in-the-boston-marathon-bombing-investigation","source":"FBI Press Room (press release)","description":"BOSTON—A federal grand jury today returned a two-count indictment against two men previously charged with conspiracy to obstruct justice in the Boston Marathon bombing investigation. Dias Kadyrbayev, 19, and Azamat Tazhayakov, 19, nationals of Kazakhstan ...","date":"2013-08-08T17:23:29Z"}],"getty imagestwo explosions":[{"title":"Boston Marathon Explosion: Country Stars React","url":"http://tasteofcountry.com/boston-marathon-explosion/","source":"Taste of Country","description":"Two explosions near the finish line of the 2013 Boston Marathon have the nation on edge Tuesday afternoon (April 15). Country stars like Lady Antebellum, Scotty McCreery, the Band Perry and Lee Brice took to Twitter to send prayers toward those involved.","date":"2013-04-14T23:58:45Z"},{"title":"Boston Marathon Explosion: Country Stars React","url":"http://tasteofcountry.com/boston-marathon-explosion/","source":"Taste of Country","description":"Two explosions near the finish line of the 2013 Boston Marathon have the nation on edge Tuesday afternoon (April 15). Country stars like Lady Antebellum, Scotty McCreery, the Band Perry and Lee Brice took to Twitter to send prayers toward those involved.","date":"2013-04-14T23:58:45Z"},{"title":"Boston Marathon Explosion: Country Stars React","url":"http://tasteofcountry.com/boston-marathon-explosion/","source":"Taste of Country","description":"Two explosions near the finish line of the 2013 Boston Marathon have the nation on edge Tuesday afternoon (April 15). Country stars like Lady Antebellum, Scotty McCreery, the Band Perry and Lee Brice took to Twitter to send prayers toward those involved.","date":"2013-04-14T23:58:45Z"},{"title":"Boston Marathon Explosion: Country Stars React","url":"http://tasteofcountry.com/boston-marathon-explosion/","source":"Taste of Country","description":"Two explosions near the finish line of the 2013 Boston Marathon have the nation on edge Tuesday afternoon (April 15). Country stars like Lady Antebellum, Scotty McCreery, the Band Perry and Lee Brice took to Twitter to send prayers toward those involved.","date":"2013-04-14T23:58:45Z"},{"title":"Boston Marathon Explosion: Country Stars React","url":"http://tasteofcountry.com/boston-marathon-explosion/","source":"Taste of Country","description":"Two explosions near the finish line of the 2013 Boston Marathon have the nation on edge Tuesday afternoon (April 15). Country stars like Lady Antebellum, Scotty McCreery, the Band Perry and Lee Brice took to Twitter to send prayers toward those involved.","date":"2013-04-14T23:58:45Z"},{"title":"Boston Marathon Explosion: Country Stars React","url":"http://tasteofcountry.com/boston-marathon-explosion/","source":"Taste of Country","description":"Two explosions near the finish line of the 2013 Boston Marathon have the nation on edge Tuesday afternoon (April 15). Country stars like Lady Antebellum, Scotty McCreery, the Band Perry and Lee Brice took to Twitter to send prayers toward those involved.","date":"2013-04-14T23:58:45Z"},{"title":"Boston Marathon Explosion: Country Stars React","url":"http://tasteofcountry.com/boston-marathon-explosion/","source":"Taste of Country","description":"Two explosions near the finish line of the 2013 Boston Marathon have the nation on edge Tuesday afternoon (April 15). Country stars like Lady Antebellum, Scotty McCreery, the Band Perry and Lee Brice took to Twitter to send prayers toward those involved.","date":"2013-04-14T23:58:45Z"},{"title":"Boston Marathon Explosion: Country Stars React","url":"http://tasteofcountry.com/boston-marathon-explosion/","source":"Taste of Country","description":"Two explosions near the finish line of the 2013 Boston Marathon have the nation on edge Tuesday afternoon (April 15). Country stars like Lady Antebellum, Scotty McCreery, the Band Perry and Lee Brice took to Twitter to send prayers toward those involved.","date":"2013-04-14T23:58:45Z"},{"title":"Boston Marathon Explosion: Country Stars React","url":"http://tasteofcountry.com/boston-marathon-explosion/","source":"Taste of Country","description":"Two explosions near the finish line of the 2013 Boston Marathon have the nation on edge Tuesday afternoon (April 15). Country stars like Lady Antebellum, Scotty McCreery, the Band Perry and Lee Brice took to Twitter to send prayers toward those involved.","date":"2013-04-14T23:58:45Z"}]}