[{"title":"Enron-style cultures still linger","url":"http://www.expressnews.com/business/local/article/Enron-style-cultures-still-linger-5377718.php","source":"expressnews.com","description":"When Enron collapsed more than decade ago, many smart people wondered how a high-flying company that was once so profitable could fall that hard and that fast. To continue reading this story, you will need to be a digital subscriber to ...","date":"2014-04-05T02:16:05Z"},{"title":"Judge Accepts Plea Deal in SAC Insider Trading Case","url":"http://dealbook.nytimes.com/2014/04/10/judge-accepts-plea-deal-in-sac-insider-trading-case/","source":"Deal Book","description":"Prosecutors often fear job losses and threats to the broader economy – Arthur Andersen, Enron’s accounting firm, shut down after its indictment — but the rare show of criminal force against SAC demonstrated that such charges were not an ...","date":"2014-04-10T12:25:46Z"},{"title":"PwC’s Booz Deal Revives Specter of Enron-Era Auditing Conflicts","url":"http://www.businessweek.com/news/2014-04-04/pwc-s-booz-deal-revives-specter-of-enron-era-auditing-conflicts","source":"Businessweek","description":"PricewaterhouseCoopers LLP’s acquisition of consulting firm Booz & Co., completed this week, has U.S. regulators eyeing the potential for conflicts of interest in the auditing industry -- again. The deal, one of the biggest by a major ...","date":"2014-04-05T10:30:01Z"},{"title":"Hidden gems","url":"http://www.economist.com/news/business/21600692-reviving-old-brands-sometimes-makes-more-sense-creating-new-ones-hidden-gems","source":"The Economist online","description":"You need to choose your brand well—there is a big difference between Shinola and, say, Enron—and manage its revival carefully. Many of the most successful exercises in reviving brands are also exercises in repositioning them. Henry Juszkiewicz ...","date":"2014-04-10T13:44:31Z"},{"title":"Uncle Funky's Daughter Founder Tonya Goff Launches New Vision","url":"http://www.examiner.com/article/uncle-funky-s-daughter-founder-tonya-goff-launches-new-vision","source":"Examiner","description":"It was the year 2003, and Tonya received a meager severance package from Dynegy after the deal with Enron was abandoned. “I didn’t know what was my next step…all I knew was that I always had a desire to own a business of some sort – and I didn’t ...","date":"2014-04-09T19:36:27Z"},{"title":"America’s First Marine Highway Comes Back to Life","url":"http://www.marinelink.com/news/americas-highway-marine366775.aspx","source":"Marine Link","description":"Goldman’s biggest year on the New York Canal System coincided with the year that Enron failed. As it turned out, numerous, high value turbines had to be moved into storage. The shippers turned to Goldman and his fledgling operation.","date":"2014-04-10T10:45:33Z"},{"title":"Enron for Dummies","url":"http://www.nytimes.com/2002/01/26/opinion/enron-for-dummies.html","source":"New York Times","description":"''I saw this week that President Bush is 'outraged' by the Enron scandal, and I know I should be too, but there's a lot I still don't get. For starters, what kind of company is Enron, exactly? Enron is a new-economy company, a thinking-outside ...","date":"2002-01-25T23:57:09Z"},{"title":"Timeline of Enron's Collapse","url":"http://www.washingtonpost.com/wp-dyn/articles/A25624-2002Jan10.html","source":"Washington Post","description":"Sept. 21: The first criminal trial involving former Enron Corp. executives opens with prosecutors charging that the defendants conspired with Wall Street bankers to carry out a sham transaction. Sept. 10: Prosecutors argue in court papers that ...","date":"2004-09-29T23:56:55Z"},{"title":"Enron And the Gramms","url":"http://www.nytimes.com/2002/01/17/opinion/enron-and-the-gramms.html","source":"New York Times","description":"When Senator Phil Gramm and his wife Wendy danced, it was most often to Enron's tune. Mr. Gramm, a Texas Republican, is one of the top recipients of Enron largess in the Senate. And he is a demon for deregulation. In December 2000 Mr. Gramm was ...","date":"2002-01-16T23:53:30Z"},{"title":"Here's What 'The Wolf Of Wall Street' Teaches Us About Corporate Storytelling","url":"http://www.forbes.com/sites/berlinschoolofcreativeleadership/2014/04/09/heres-what-the-wolf-of-wall-street-teaches-us-about-corporate-story-telling/","source":"Forbes","description":"Some corporations do acquire a collective identity that shapes their stories – Enron as the hubristic “smartest guys in the room” or Goldman Sachs as a “great vampire squid.” But these companies that take on such depictions are exceptions.","date":"2014-04-08T23:55:20Z"},{"title":"An Enron chronology","url":"http://usatoday30.usatoday.com/money/industries/energy/2006-01-23-enron-chronology_x.htm","source":"usatoday30.usatoday.com","description":"David J. Phillip, AP 1985 — Houston Natural Gas merges with InterNorth to form Enron, HNG CEO Kenneth Lay becomes CEO of combined company the following year. James Nielsen, AFP/Getty Images Enron's corporate headquarters in downtown Houston is ...","date":"2006-01-22T23:53:10Z"},{"title":"Enron Fast Facts","url":"http://www.cnn.com/2013/07/02/us/enron-fast-facts/index.html","source":"CNN","description":"(CNN)-- Here's a look at what you need to know about Enron. Before its collapse, Enron marketed electricity and natural gas, delivered energy and other physical commodities, and provided financial and risk management services to customers around ...","date":"2013-07-02T15:29:53Z"},{"title":"Is Enron Overpriced?","url":"http://money.cnn.com/2006/01/13/news/companies/enronoriginal_fortune/index.htm","source":"CNN Money","description":"NEW YORK (FORTUNE) -- In Hollywood parlance, the \"It Girl\" is someone who commands the spotlight at any given moment -- you know, like Jennifer Lopez or Kate Hudson. Wall Street is a far less glitzy place, but there's still such a thing as an ...","date":"2006-01-12T23:57:52Z"},{"title":"The Enron Story That Waited To Be Told","url":"http://www.washingtonpost.com/wp-dyn/articles/A64769-2002Jan17.html","source":"Washington Post","description":"Bethany McLean, a 31-year-old Fortune magazine reporter with an impossibly soft voice, decided to take a hard look at Enron last January. The Houston energy company didn't like her questions. The CEO, Jeffrey Skilling, called her unethical and ...","date":"2002-01-17T23:59:29Z"},{"title":"Pay Madness At Enron","url":"http://www.forbes.com/2002/03/22/0322enronpay.html","source":"Forbes","description":"There are those who believe– Jeffrey Skilling Jeffrey Skilling is one–that Enron was a successful company brought down by a crisis of confidence in the market. Then there are those who think Enron appeared successful but actually hid its ...","date":"2002-03-21T23:56:21Z"}]