[{"title":"MH370's captain spoke final words to air traffic control, investigators say","url":"http://www.aol.com/article/2014/04/10/mh370s-captain-spoke-final-words-to-air-traffic-control-invest/20866986/","source":"AOL","description":"CANBERRA, AUSTRALIA - APRIL 10 : A handout image released by the Australian Maritime Safety Authority (AMSA) in Canberra, Australia, 10 April 2014, shows the search area and Sonobuoy search area where 14 planes and 13 ships are scouring a 57,923 ...","date":"2014-04-10T11:49:59Z"},{"title":"Officials Say MH370 Could Be Found Within Days After Another Signal Detected","url":"https://news.yahoo.com/officials-mh370-could-found-within-days-another-signal-115000224.html","source":"Yahoo News","description":"An Australian plane searching for missing Malaysia Airlines Flight 370 has detected yet another signal in an area where four others have been picked up so far, prompting officials to say that traces of MH370 could be found within days. Over the weekend ...","date":"2014-04-10T11:49:59Z"},{"title":"CNN’s Blitzer sacrifices NCAA championship game for MH370","url":"http://www.washingtonpost.com/blogs/erik-wemple/wp/2014/04/10/cnns-blitzer-sacrifices-ncaa-championship-game-for-mh370/","source":"Washington Post","description":"CNN’s extensive coverage of MH370 is now on record as causing some inconvenience. CNN anchor Wolf Blitzer, a big sports fan, set off on Sunday for north Texas to attend the NCAA championship game. His itinerary, however, was scrapped amid developments ...","date":"2014-04-10T12:40:05Z"},{"title":"MH370 in a Million Pieces?","url":"https://news.yahoo.com/mh370-million-pieces-202400517--politics.html","source":"Yahoo News","description":"Nobody has said it in so many words, but those searching the Indian Ocean for Flight MH370 would appear to be driven by the principle that failure is not an option. The public voice of the search, retired Australian air chief marshal Angus Houston, speaks ...","date":"2014-04-09T20:19:24Z"},{"title":"MH370 Search Buoys Detect New Possible Signal","url":"http://news.sky.com/story/1240227/mh370-search-buoys-detect-new-possible-signal","source":"Sky News HD","description":"Search teams trying to find the missing Malaysia Airlines plane have detected another possible signal from a black box recorder. After dropping sound-locating buoys into the search zone, an Australian Navy P-3 Orion aircraft detected the potential signal ...","date":"2014-04-10T08:36:42Z"},{"title":"Hunt for MH370 closes in on 'final resting place'","url":"http://timesofindia.indiatimes.com/world/rest-of-world/Hunt-for-MH370-closes-in-on-final-resting-place/articleshow/33545507.cms","source":"Times of India","description":"PERTH: The hunt for the missing Malaysian jet was on Thursday narrowed down drastically to a targeted patch in the Indian Ocean after fresh underwater signals possibly from the plane's black box were picked up this week. Today's search zone was ...","date":"2014-04-10T06:27:51Z"},{"title":"In MH370, Putrajaya bares its deepest flaws, says Bloomberg columnist","url":"http://www.themalaysianinsider.com/malaysia/article/in-mh370-putrajaya-bares-its-deepest-flaws-says-bloomberg-columnist","source":"The Malaysian Insider","description":"A prominent Bloomberg columnist wrote yesterday that the global outcry over the loss of flight MH370 has highlighted Putrajaya’s deepest flaws, and all-too-few of its strengths. William Pesek said that while six months ago US president Barak ...","date":"2014-04-10T02:53:07Z"},{"title":"More pings raise hopes missing MH370 jetliner will be found soon","url":"http://www.aol.com/article/2014/04/09/more-pings-raise-hopes-missing-mh370-jetliner-will-be-found-soon/20866060/","source":"AOL","description":"In this April 9, 2014 photo provided by the Australian Defense Force, a Royal Australian Air Force AP-3C Orion flies past Australian Defense vessel Ocean Shield on a mission to drop sonar buoys to assist in the acoustic search of the missing ...","date":"2014-04-09T11:22:32Z"},{"title":"MH370 Live: Official detect new underwater signal during search","url":"http://www.firstpost.com/world/mh370-live-hunt-for-black-box-shifted-to-one-patch-of-indian-ocean-1424627.html","source":"Firstpost","description":"15.10 pm: Official says searchers detect underwater signal in hunt for missing Malaysian plane Official says searchers detect underwater signal in hunt for missing Malaysian plane. An Australian official says a search crew hunting for the missing Malaysian ...","date":"2014-04-10T02:10:10Z"},{"title":"MH370: Still a long journey to go, says Hishammuddin","url":"http://english.astroawani.com/news/show/mh370-still-a-long-journey-to-go-says-hishammuddin-33627","source":"Astro Awani","description":"KUALA LUMPUR: Acting Transport Minister Datuk Seri Hishammuddin Tun Hussein said he was grateful to the Australian authorities for their efforts to identify signals detected in the southern Indian Ocean as the hunt for the missing Malaysian ...","date":"2014-04-10T14:20:18Z"},{"title":"MH370 Search Team Hopes to Find Wreckage \"Within Matter of Days\"","url":"http://www.slate.com/blogs/the_slatest/2014/04/09/mh370_search_more_pings_raise_hopes_that_wreckage_will_be_found_within_matter.html","source":"Slate","description":"Officials leading the search effort for Flight 370 sounded their most optimistic tone to date on Wednesday, suggesting that they hope to locate the wreckage of the missing Malaysian airliner \"within a matter of days.\" Here's why optimism is ...","date":"2014-04-09T13:45:42Z"},{"title":"Hunt for Malaysia Airlines MH370 set for 'final' steps","url":"http://www.financialexpress.com/news/hunt-for-malaysia-airlines-mh370-set-for-final-steps/1239800","source":"Financial Express","description":"SummarySearch teams to send down a robotic vehicle to confirm if it is black box from Malaysia Airlines MH370 plane. New 'pings' stoke optimism for Malaysia Airlines MH370 plane hunt After Malaysia Airlines MH370 tragedy, woman kidnapped from resort brings ...","date":"2014-04-10T16:43:28Z"},{"title":"MH370 fallout: Malaysia expects 30,000 Chinese tourists to cancel trips","url":"http://www.straitstimes.com/the-big-story/asia-report/china/story/mh370-fallout-malaysia-expects-30000-chinese-tourists-cancel-t","source":"The Straits Times","description":"KUALA LUMPUR - Malaysia expects at least 30,000 tourists from China to cancel their trips here this year in the wake of the disappearance of the Malaysia Airlines jetliner. Calling the sudden spike in cancellations \"unprecedented\", the Malaysian ...","date":"2014-04-10T12:47:15Z"},{"title":"MH370 Found in Australia? New Hopes to Find the Plane Rise as Search Area Gets Narrowed Down to Southern Indian Ocean","url":"http://au.ibtimes.com/articles/547565/20140410/mh370-found-mh-370-black-box-theory.htm","source":"International Business Times","description":"MH370 has gone missing for more than a month. Recently, a chink of hope has risen speculating that soon the remains of Boeing 777 would be found. Search teams have accessed signals from a particular patch of Southern Indian Ocean, which are ...","date":"2014-04-10T07:25:07Z"},{"title":"Malaysia Airlines flight MH370 update: Possible fifth ping heard by Australian jet","url":"http://www.salon.com/2014/04/10/malaysia_airlines_flight_mh370_update_possible_fifth_ping_heard_by_australian_jet/","source":"Salon","description":"On Thursday an Australian Air Force jet scouring the Indian Ocean detected what may have been a fifth “ping” from a man-made device. Search teams have yet to confirm the signal. “The acoustic data will require further analysis overnight ...","date":"2014-04-10T14:27:28Z"}]