[{"title":"Sandy Hook School Students Launch Space Talk","url":"http://www.newtownbee.com/news/news/2014/04/09/sandy-hook-school-students-launch-space-talk/199416","source":"Newtown Bee","description":"Flight engineers on the International Space Station helped Sandy Hook Elementary School students celebrate the end of the school’s One School One Read program on Tuesday, April 8. Seated inside Monroe’s Chalk Hill Middle School’s Lecture ...","date":"2014-04-10T07:03:39Z"},{"title":"Those Who Lost Loved Ones In 9/11, Sandy Hook Support Fort Hood Victims' Families","url":"http://www.huffingtonpost.com/2014/04/09/mass-shooting-victims-fam_n_5118161.html","source":"The Huffington Post","description":"DALLAS (AP) — Dozens of families who lost loved ones during Sept. 11, the shooting at Connecticut's Sandy Hook elementary school and other attacks are trying to support victims of similar tragedies with a new fund, and its first efforts will ...","date":"2014-04-08T19:37:38Z"},{"title":"The Sandy Hook Hoax SUBMISSION: Was it \"OK?\"","url":"http://www.thepeoplesvoice.org/TPV3/Voices.php/2014/04/10/the-sandy-hook-hoax-submission-was-it-ok","source":"The People's Voice","description":"Furthermore, Adam Lanza, a scrawny, socially awkward 20-year old, mind controlled patsy, could not have shot 20 innocent children (and six adults) at the Sandy Hook Elementary School in less than five minutes, with an assault rifle [still in the ...","date":"2014-04-10T16:43:28Z"},{"title":"Out Of The Rubble Of Tragedy, How To Build A New Sandy Hook?","url":"http://www.npr.org/2014/04/09/301028058/out-of-the-rubble-of-tragedy-how-to-build-a-new-sandy-hook","source":"NPR News","description":"Audie Cornish speaks with Barry Svigals, the founding and managing partner of Svigals and Partners, the group chosen to design the new Sandy Hook elementary school.","date":"2014-04-09T16:51:49Z"},{"title":"NRA Picks Reverend Who Blamed Sandy Hook On Secularism To Keynote Prayer Breakfast","url":"http://mediamatters.org/blog/2014/04/08/nra-picks-reverend-who-blamed-sandy-hook-on-sec/198797","source":"Media Matters","description":"The 2014 National Rifle Association annual meeting's prayer breakfast will be keynoted by a reverend who claimed that the December 2012 Sandy Hook Elementary School massacre \"is what happens when a society turns its back on God\" by separating ...","date":"2014-04-07T22:44:56Z"},{"title":"Sandy Hook assistance not included in state taxable income","url":"http://www.wfsb.com/story/25183233/sandy-hook-assistance-not-included-in-state-taxable-income","source":"Eye Witness News 3","description":"\"Gov. (Dannel) Malloy wants to be sure those workers who stepped up during the horrific shootings at Sandy Hook Elementary School are able to receive the full benefit of state assistance payments,\" said DRS Commissioner Kevin Sullivan. \"One important ...","date":"2014-04-07T14:16:42Z"},{"title":"Lessons learned in Sandy Hook shootings serve to launch fresh security strategies","url":"http://www.securityinfowatch.com/article/11371182/sandy-hook-provides-lessons-learned-for-school-security-at-isc-west","source":"Security Info Watch","description":"The shooting that claimed the lives of 20 children and six adults in December 2013 at Sandy Hook Elementary School in Newtown, Conn. proved to be a turning point in the way security professionals and school administrators viewed campus security.","date":"2014-04-02T23:55:18Z"},{"title":"School security improving, but it comes at a price","url":"http://www.wsmv.com/story/25209205/school-security-improving-but-it-comes-at-a-price","source":"WSMV","description":"In the 16 months since the shootings at Sandy Hook Elementary School, nearly every elementary and middle school in the state has an armed officer patrolling the hallways. \"It's a two-day training, highly specialized, done by the federal government.","date":"2014-04-09T22:56:53Z"},{"title":"State Indictment Is Dismissed in Sandy Hook ID Theft Case","url":"http://www.newyorklawjournal.com/id=1202650056018/State-Indictment-Is-Dismissed-in-Sandy-Hook-ID-Theft-Case","source":"New York Law Journal","description":"Nouel Alba posted a solicitation on Facebook pretending to be the paternal aunt of one of the Sandy Hook Elementary School shooting victims. NBC A state judge has dismissed the indictment of a woman who posed as the relative of a Sandy Hook Elementary ...","date":"2014-04-07T19:24:31Z"},{"title":"West Orange Resident Joins with Sandy Hook Parent to Recognize National Crime Victims' Rights Week","url":"http://thealternativepress.com/articles/west-orange-resident-joins-with-sandy-hook-parent","source":"The Alternative Press","description":"Keynote speakers included Nicole Hockley, mother of Dylan Hockley, who was killed at Sandy Hook Elementary in Newtown, Conn..; Aaron Muhammad of Elevated Places Inc., and Ashley Craig, a high school senior who started the organization Students ...","date":"2014-04-08T21:46:29Z"},{"title":"Police substation adds security to Waynesville schools","url":"http://www.wlwt.com/news/police-substation-adds-security-to-waynesville-schools/25400342","source":"WLWT 5","description":"Along with the police substation all the schools for the district are all on campus as well; the elementary, middle and high school are all centrally located in one place, and after the Sandy Hook tragedy police partnered with the district to ...","date":"2014-04-09T20:12:15Z"},{"title":"Project Camelot … Robbie Parker … Sandy Hook: Connect the Dots","url":"http://www.thepeoplesvoice.org/TPV3/Voices.php/2014/04/04/project-camelot-robbie-parker-sandy-hook","source":"The People's Voice","description":"Furthermore, Adam Lanza, a scrawny, socially awkward 20-year old, mind controlled patsy, could not have shot 20 innocent children (and six adults) at the Sandy Hook Elementary School in less than five minutes, with an assault rifle [still in the ...","date":"2014-04-04T13:58:47Z"},{"title":"Musician to perform Sandy Hook benefit song at Daniel Barden Mudfest","url":"http://www.wktv.com/news/top-stories/Mudfest-to-honor-Sandy-Hook-victims-253992551.html","source":"WKTV","description":"The Mudfest started last year to remember Daniel Barden, a 7-year-old student who was killed in the Sandy Hook Elementary School shooting. The founder, Dan Williams, started the event after attending Barden's funeral. Barden and his niece were friends and ...","date":"2014-04-05T03:13:21Z"},{"title":"Assault weapon sales boom cools off","url":"http://money.cnn.com/2014/04/09/news/companies/assault-weapon-sales/index.html","source":"CNN Money","description":"The buying became even more frenzied the following month, after a gunman used a Bushmaster to massacre 20 children and six educators at Sandy Hook Elementary School in Newtown, Conn. After that shooting, demand got crazy, said John Reids ...","date":"2014-04-09T11:01:03Z"},{"title":"New playground at CT park honors Sandy Hook victim","url":"http://www.kpax.com/news/new-playground-at-ct-park-honors-sandy-hook-victim/","source":"8KPAX","description":"The family moved to Newtown four months before the Dec. 14, 2012, mass slaying at Sandy Hook Elementary School. Ana Grace Marquez-Greene died with 19 other first-graders and six educators. This Friday, on what would've been Ana's 8th birthday, a playground ...","date":"2014-04-03T23:54:07Z"}]